{
  "newsItems": [
    {
      "title": "World News: Breaking international headlines and latest updates",
      "url": "https://metro.co.uk/news/world/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://metro.co.uk/wp-content/client-mu-plugins/metro-branding/images/m-black-share.png",
        "1": "https://metro.co.uk/wp-content/uploads/2025/09/SEI_267719390-d748.jpg?quality=90&strip=all&w=646&h=363&crop=1",
        "2": "https://metro.co.uk/wp-content/uploads/2025/09/image-1fca.png?w=427&h=240&crop=1",
        "3": "https://metro.co.uk/wp-content/uploads/2025/09/GettyImages-1710518162-fb5a-e1758806602447.jpg?quality=90&strip=all&w=646&h=363&crop=1",
        "4": "https://metro.co.uk/wp-content/uploads/2025/09/SEI_266351187-4b8c-e1758801672249.jpg?quality=90&strip=all&w=646&h=363&crop=1"
      },
      "content": "# World\n\n#### HOT TOPICS:\n\n## Trending Now\n\n- More mystery drones that caused major airport closures spotted above Europe Channel: World World 4 hours ago By Noora Mykkanen\n\n### More mystery drones that caused major airport closures spotted above Europe\n\n- Former French president Nicolas Sarkozy jailed for five years over criminal conspiracy\n\n- Dad dies on Turkish 'pirate boat' before crew 'covers him up and host foam party'\n\n- Denmark considers getting Nato involved after ‘hybrid drone attacks’ above airports\n\n- 'Nato and EU have declared war on Russia,' says Kremlin's foreign minister\n\n## Galleries\n\n### Meet the people who won huge on the lottery and soon wished they hadn’t\n\n### ‘I died and my relatives in the afterlife all gave me the same message’\n\n### Older people who can do these 7 everyday things are in great shape\n\n### The 10 Netflix shows absolutely everyone is watching right now\n\n### Is humanity’s population about to decline — and could we face extinction?\n\n## More Stories\n\n### Preacher who falsely predicted the Rapture awkwardly asks viewers to be patient\n\n### More mystery drones that caused major airport closures spotted above Europe\n\n#### News Updates\n\nStay on top of the headlines with daily email updates.\n\n### A social media platform is 'labeling users as Antifa members' - what's really going on?\n\n### More than 1,000 schoolchildren fall ill with food poisoning from dodgy lunches\n\n### 'Nato and EU have declared war on Russia,' says Kremlin's foreign minister\n\n### British killer arrested in Spain after 17 months on the run\n\n### Former French president Nicolas Sarkozy jailed for five years over criminal conspiracy\n\n### Denmark considers getting Nato involved after ‘hybrid drone attacks’ above airports\n\n### Dad dies on Turkish 'pirate boat' before crew 'covers him up and host foam party'\n\n### Body found in search for missing British tourist in Spanish woods\n\n### Now North Koreans aren't allowed to say 'I love you' to each other in letters\n\n### Burglars flee with £700,000-worth of jewellery from ex-Everton boss's home\n\n### Gaza-bound flotilla with Greta Thunberg on board struck by drones\n\n### Boy, 13, arrested after 'grenade' explodes in Oslo causing car windows to shatter\n\n### Elon Musk's estranged father accused of 'sexually abusing five of his children'\n\n### Macron rings Trump for help after New York police block his car in the street\n\n### British tourist, 58, found dead in Spanish sea by wife after drowning off beach\n\n### Singers on tour found dead after being kidnapped and tortured by drug cartel\n\n### One of the world's largest cargo planes comes within metres of a block of flats\n\n### TODAY'S GAMES",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "China’s plans to cut emissions too weak to stave off global catastrophe, say experts | Climate crisis | The Guardian",
      "url": "https://www.theguardian.com/environment/2025/sep/24/chinas-plans-to-cut-emission-too-weak-to-stave-off-global-catastrophe-say-experts?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/a597f0f139e94c61c8ab48dfce0617479ed7c367/0_0_4606_3686/master/4606.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a897131aafc6b939aee9eabb5ef60c14",
        "1": "https://i.guim.co.uk/img/media/a597f0f139e94c61c8ab48dfce0617479ed7c367/0_0_4606_3686/master/4606.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=94b8c8d315c65c8c11ec61cc8350b318",
        "2": "https://i.guim.co.uk/img/media/a597f0f139e94c61c8ab48dfce0617479ed7c367/452_0_4606_3686/master/4606.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Chinese president Xi Jinping delivered a video speech to the UN climate summit in New York, announcing plans to cut greenhouse gas emissions by between 7% and 10% of their peak by 2035 Photograph: Xinhua/ShutterstockView image in fullscreenChinese president Xi Jinping delivered a video speech to the UN climate summit in New York, announcing plans to cut greenhouse gas emissions by between 7% and 10% of their peak by 2035 Photograph: Xinhua/Shutterstock\n\n# China’s plans to cut emissions too weak to stave off global catastrophe, say experts\n\nXi suggested US is not rising to the climate challenge in his UN speech, but critics say new cuts fall ‘far short’ of what is necessary\n\nChina announced its plans for future cuts to greenhouse gas emissions on Wednesday, producing a scathing response from experts who said they were much too weak to stave off global catastrophe.The world’s second-biggest economy is also the biggest source of carbon dioxide by far, and its decisions on how far and how fast to shift to a low-carbon model will determine whether the world can stay within relatively safe temperature bounds.China’s plans are to cut emissions by between 7% and 10% of their peak by 2035 – a long way from the 30% cut that experts said was feasible and necessary.Xi Jinping, the president of China, made the announcement at a summit of world leaders to discuss the climate crisis at the UN general assembly on Wednesday afternoon in New York.The US president, Donald Trump, who made a sometimes rambling speech on Tuesday in which he dismissed the climate crisis as a “con job”, was not present.‘Science demands action’: world leaders and UN push climate agenda forward despite Trump’s attacksRead moreXi made an oblique reference to the US, saying “some countries” were not rising to the climate challenge. “The international community should stay focused on the right direction,” he added. “[Countries] must live up to their responsibilities. The rights of developing countries must be fully respected.”But experts said China was failing to show leadership in its climate commitments. Kaysie Brown, associate director for climate diplomacy and governance at the E3G thinktank, said: “China’s 2035 target falls critically short of what is needed. It’s neither aligned with China’s economic decarbonisation, nor its own 2060 carbon neutrality goal.“Without stronger near-term ambition, China risks undermining its claim to upholding multilateralism and its clean economy leadership, and sending mixed signals to global markets.”‘There is only one player’: why China is becoming a world leader in green energyRead moreHowever, others noted privately that China had a longstanding habit of setting unambitious targets but then substantially exceeding them. “Underpromising and overdelivering is what we expect from China,” said one person involved with climate diplomacy.Bernice Lee, distinguished fellow at the Chatham House thinktank, said the business world and other governments would take their cue from China’s clear direction of travel, rather than the finer points of its plans.“There are UN targets, and then there’s reality,” she said. “The reality is the country invested $625bn in clean energy last year – 31% of the global total. Its clean energy surge is reshaping the global economy and displacing coal at home. My bet is that other countries will read the writing on the wall and recognise that China is fully committed, and be reassured as they seek to shift off fossil fuels.”China’s national plan, known as a nationally determined contribution (NDC) under the Paris agreement, will also contain measures to boost the share of non-fossil fuels to more than 30% of its energy consumption and to expand its wind and solar capacity to 3,600GW, more than six times 2020 levels.Clean energy already makes up more than 10% of China’s GDP, and about a quarter of its economic growth, while its sale of components such as solar panels has driven down the cost of renewables by about 90% around the world in the last decade. The country has revolutionised electric vehicle and battery technology, fuelling their adoption around the world.But China, whose emissions may be reaching a peak, is also still highly dependent on coal power, which enjoys strong political support within Xi’s government. New coal-fired power plants are still in development, despite a promise made in 2021 to “phase down” coal.‘Something is working’: UN climate chief optimistic about green transitionRead morePaul Bledsoe, a former Clinton White House climate adviser now with American University in Washington, told the Guardian: “China’s new commitment is a good sign that their clean energy economy is beginning to help them lower emissions, but it’s not [moving] quickly enough. China could reach these goals much sooner, by the end of this decade.“In particular, China must also commit to shutting down many of its antiquated coalmines, which are responsible not only for the largest single source of CO2 emissions globally, but also 20% of the global methane emissions from fossil fuels.”China’s commitments will help to shape the Cop30 UN climate summit taking place in Brazil in November. There, all countries are supposed to unveil their NDCs, in line with the Paris agreement.The UN’s climate chief has already admitted to the Guardian that the commitments to be made in Belem will fall short of the emissions cuts needed to limit global heating to 1.5C above preindustrial levels, the pledge made in the 2015 Paris climate agreement.The task for the UN, Brazil and countries hoping to avoid the worst ravages of the climate crisis will be to show how those inadequate national targets can be improved on, and set out a global plan that allows the Paris agreement to be fulfilled.\n\nExplore more on these topics\n\n- [Climate crisis](https://www.theguardian.com/environment/climate-crisis) - [Paris climate agreement](https://www.theguardian.com/environment/paris-climate-agreement) - [China](https://www.theguardian.com/world/china) - [Xi Jinping](https://www.theguardian.com/world/xi-jinping) - [Greenhouse gas emissions](https://www.theguardian.com/environment/carbon-emissions) - [United Nations](https://www.theguardian.com/world/unitednations) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "BBC and news agencies launch film calling on Israel to allow foreign journalists into Gaza",
      "url": "https://www.bbc.com/news/articles/c8d7yrp80m8o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/0250/live/b6164580-997d-11f0-b6a6-3b33e4575a79.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/7be7/live/f1e4bda0-9ac5-11f0-8459-f985f888de2a.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/8059/live/a4480160-9a57-11f0-894b-0159b5abffc9.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/28aa/live/8dd39c60-9a42-11f0-928c-71dbb8619e94.jpg.webp"
      },
      "content": "# BBC and news agencies launch film calling on Israel to allow foreign journalists into Gaza\n\nThe BBC and three international news agencies have released a short film calling on Israel to allow foreign journalists into Gaza.\n\nThe film, launched by the corporation with Agence France-Presse (AFP), the Associated Press (AP) and Reuters, is narrated by veteran BBC journalist David Dimbleby.\n\nHe said: \"International journalists must now be allowed into Gaza to share the burden with the Palestinian reporters there so we can all bring the facts to the world.\"\n\nForeign journalists have been banned from entering Gaza independently since Israel launched its 2023 offensive following the Hamas 7 October attacks. A small number have been taken into the Strip by Israeli troops under controlled access.\n\nThe Israel Defense Forces (IDF) has previously said that to \"allow journalists to report safely\" in Gaza the military \"accompanies them when in the battlefield\".\n\nThe BBC has contacted the Israeli foreign ministry and the Israel Defense Forces (IDF) for comment.\n\nLast year Israel's High Court of Justice ruled that restrictions on entry to Gaza were justified on security grounds.\n\nDeborah Turness, CEO of BBC News, said: \"It is almost two years since October 7th when the world witnessed Hamas' atrocities. Since then, a war has been raging in Gaza but international journalists are not allowed in.\n\n\"We must now be let into Gaza. To work alongside local journalists, so we can all bring the facts to the world.\"\n\nThe film premieres in New York on Wednesday night at an event hosted by the Committee to Protect Journalists, to coincide with the United Nations General Assembly. It features footage of historic events and atrocities captured by journalists.\n\nThey include scenes of the D-Day landings during World War Two, the Vietnam War, Ethiopia's 1984 famine, China's Tiananmen Square protests, the Rwandan genocide, the Syrian refugee crisis and the war in Ukraine.\n\n\"In Ukraine, journalists from around the world risk their lives every day to report the suffering of the people,\" says Dimbleby in the film.\n\n\"But when it comes to Gaza the job of reporting falls solely to Palestinian journalists, who are paying a terrible cost, leaving fewer to bear witness.\"\n\nThis is not the first time news organisations have called on Israeli authorities to allow journalists into the territory.\n\nIn July, BBC News, AFP, AP and Reuters issued a statement expressing \"desperate concern\" for journalists in Gaza experiencing dire circumstances including hunger and displacement.\n\nIn August, 27 countries including the UK backed a statement calling for Israel to allow immediate foreign media access to Gaza and condemned attacks on journalists there.\n\nAccording to the UN Human Rights Office, at least 248 Palestinian journalists have been killed in Israeli attacks in Gaza.\n\nIsrael has repeatedly denied that its forces target journalists.\n\nThe Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.\n\nAt least 65,419 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry. The ministry's figures are quoted by the UN and others as the most reliable source of statistics available on casualties.\n\n## BBC and news agencies warn journalists in Gaza at risk of starvation\n\n## 'I can barely do one story. I just feel dizzy' - BBC's Gaza freelance journalists tell of struggle for food\n\n## UK backs call for Israel to allow foreign media into Gaza\n\n## Who were the Al Jazeera journalists killed by Israel in Gaza?\n\n## Israel and the Palestinians: History of the conflict explained\n\n## What is Hamas and why is it fighting with Israel in Gaza?",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "Palestinians in West Bank stranded as Israel shuts only international crossing",
      "url": "https://www.bbc.com/news/articles/c9wd74r0qdvo?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/f597/live/933332a0-9a07-11f0-97f5-bd38218a3641.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/a3d0/live/64ede740-9a1c-11f0-92db-77261a15b9d2.png.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/aa78/live/ea24a750-987d-11f0-b146-278281693603.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/8617/live/879fa280-9835-11f0-928c-71dbb8619e94.jpg.webp"
      },
      "content": "# Palestinians in West Bank stranded as Israel shuts only international crossing\n\nIsrael has closed the only crossing between the Israeli-occupied West Bank and neighbouring Jordan, stopping more than two million Palestinians from accessing the outside world.\n\nThe Israeli airports authority, which oversees the Allenby Bridge crossing, said it would be closed indefinitely from Wednesday morning \"at the direction of the political leadership\". It did not provide a reason.\n\nThe closure has stranded many Palestinians in the West Bank, who are unable to go on planned trips abroad. Those who are abroad have been unable to travel home.\n\nIt comes days after two Israeli military personnel were shot dead near the crossing by a Jordanian gunman, who was killed at the scene.\n\nIt was briefly shut following that incident but had since reopened.\n\nProminent Palestinian politician Mustafa Barghouti told the BBC the closure was a \"dangerous move\" that meant \"imprisoning\" people in the West Bank and \"depriving them from the only passage out\".\n\nThe crossing - also known as the King Hussein Bridge - lies about halfway between Amman and Jerusalem and is the only official crossing point between the West Bank and Jordan. It is also the only entry point to the West Bank that does not go through Israel.\n\n## 'We need solutions': Palestinians in West Bank fear recognition is not enough\n\n## What does recognising a Palestinian state mean?\n\nMost Palestinians in the West Bank are not allowed to travel through Israeli airports or other Israeli border crossings, meaning the bridge is an essential connection to the outside world.\n\n\"You're talking here about disrupting the relationship between hundreds of thousands of families who are usually connected through Jordan,\" Barghouti said.\n\n\"Thousands of people who are stuck in Jordan, they don't have resources to go and pay for hotels. They cannot stay outside. There are mothers who live with their children in the West Bank who need to come back,\" he added.\n\nJordan is home to more than 2m registered Palestinian refugees, while more than half of its population of more than 11m are of Palestinian descent. It has maintained security, trade and diplomatic ties with Israel since a 1994 peace treaty - but is a vocal critic of Israel's actions towards Palestinians.\n\nMaxim Giacaman, 23, a medical student from Bethlehem, told the BBC he was unable to travel abroad for a key elective in his medical studies.\n\n\"I have a rotation for one month in Germany for cardiac surgery,\" he said. \"And it was a big opportunity for me and for my future, my medical future.\"\n\n\"My plane is on Saturday and I was planning to go to Amman, Jordan today,\" he says. \"So it's miserable.\"\n\nThe Allenby bridge is a key trade route for goods and medical supplies to enter the West Bank. Israeli authorities say about 9% of humanitarian aid sent by truck to Gaza passes through it.\n\nPalestinians fear its indefinite closure forms part of an Israeli response to moves announced this week by the UK, France, Australia, Canada and other countries to recognise the State of Palestine.\n\nThe Israeli government has labelled the moves a \"reward for terrorism\". Ultranationalist ministers have called for Israel to annex the West Bank outright as a response.\n\nSince the Hamas-led attack on southern Israel that killed about 1,200 people and saw 251 taken hostage, triggering the war in Gaza, Israel has significantly tightened its control over the West Bank.\n\nIt has introduced hundreds of new checkpoints across the territory, launched a large-scale Jewish settlement push, and carried out major military operations against Palestinian resistance groups. Attacks by Israeli settlers against Palestinians have also ramped up significantly.\n\n\"It shows you that the world community has failed drastically in deterring Israel from expanding its oppressive policies,\" said Barghouti. \"Israel will not be restrained unless there are serious punitive acts.\"\n\nThe Allenby bridge was named after British general Edmund Allenby, who defeated the Ottoman empire to gain control of Palestine in 1917. It was built in the following year.\n\nIsrael has controlled its side of the bridge since the 1967 Six Day War, during which Israel defeated several Arab states, and in the past has temporarily closed it during religious holidays or for security reasons.\n\n## Israel and the Palestinians: History of the conflict explained\n\n## BBC and news agencies launch film calling on Israel to allow foreign journalists into Gaza\n\n## Twenty injured in Yemen drone attack on Israel, rescuers and military say",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "Israel-Gaza live updates: Netanyahu tells UN that Israel's cause is America's, Europe's - ABC News",
      "url": "https://abcnews.go.com/International/live-updates/israel-gaza-live-updates-israel-hits-back-nations/?id=125807672&utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.abcnewsfe.com/a/b4eb4c14-afb1-4c66-b868-4e3f5c3c1da2/un-12-rt-gmh-250926_1758893806625_hpMain_16x9.jpg?w=1600",
        "1": "https://i.abcnewsfe.com/a/b4eb4c14-afb1-4c66-b868-4e3f5c3c1da2/un-12-rt-gmh-250926_1758893806625_hpMain_16x9.jpg?w=992",
        "2": "https://i.abcnewsfe.com/a/b4eb4c14-afb1-4c66-b868-4e3f5c3c1da2/un-12-rt-gmh-250926_1758893806625_hpMain.jpg",
        "3": "https://i.abcnewsfe.com/a/91ed5172-91f0-4356-8114-410f982e91f9/un-5-rt-gmh-250925_1758808840063_hpMain.jpg",
        "4": "https://i.abcnewsfe.com/a/fec3e4b1-bdae-441d-ab65-2ab4b5be6d43/donald-trump-33-gty-gmh-250925_1758832503031_hpMain_square.jpg?w=208"
      },
      "content": "# Israel-Gaza live updates: Netanyahu tells UN that Israel's cause is America's, Europe's\n\nSeveral Western nations recognized a Palestinian state this week.\n\nThe Israel Defense Forces is continuing its operation to take control of Gaza City, the largest urban area in the Gaza Strip, despite international outcry over the deteriorated humanitarian situation in the Palestinian territory.\n\nMeanwhile, in protest of Israel's continuation of its military operations in Gaza, several nations including France, the U.K. and Canada recognized Palestinian statehood as leaders gathered in New York this week for meetings at the United Nations General Assembly.\n\nIsraeli Prime Minister Benjamin Netanyahu addressed the leaders on Friday.\n\n## Key Headlines\n\n- 11 minutes agoNetanyahu makes case that Israel's cause is America's, Europe's\n\n- Sep 25, 2025, 3:44 PM EDTMicrosoft disables services to Israeli defense unit after review\n\n- Sep 25, 2025, 11:25 AM EDTIron Dome failed to intercept Houthi drone strike on Israel, IDF says\n\n- Sep 25, 2025, 10:51 AM EDTPalestinian president calls Israeli incursion on Gaza a 'genocide'\n\n- Sep 25, 2025, 10:06 AM EDTPalestinian Authority ready to govern Gaza, Palestinian president tells UN\n\n## Netanyahu makes case that Israel's cause is America's, Europe's\n\nSpeaking to leaders at the United Nations General Assembly in New York on Friday, Israeli Prime Minister Benjamin Netanyahu sought to make the case that Israel's fight is an American and European fight.\n\nNetanyahu criticized world leaders that have opposed Israel's military incursion on Gaza saying \"over time many word leaders buckled.\"\n\n\"As we fight the terrorists who murdered your citizens, you are fighting us, you condemn us, you embargo us and you wage political and legal warfare against us. This is not an indictment of Israel this is an indictment of you,\" Netanyahu said.\n\nRight as Netanyahu took the podium, General Assembly delegates staged a walk out.\n\nNetanyahu pushed back on claims that Israel is committing a genocide in Gaza and deliberately starving the Palestinians in Gaza.\n\n\"What a joke,\" Netanyahu said.\n\nNetanyahu criticized the move by western nations including France, the U.K., Canada and Belgium to recognize the state of Palestine, saying it was \"horribly wrong\" decision that will encourage \"terrorism against Jews.\"\n\n## Microsoft disables services to Israeli defense unit after review\n\nMicrsoft has announced it disabled a set of its services to an Israel Ministry of Defense unit after an August article in The Guardian alleged the Israel Defense Forces were using Microsoft products to store surveillance of Palestinians, Brad Smith, vice chair and president of Microsoft said in a note with employees Thursday.\n\nThe article revealed a unit of the Israel Defense Forces was using Azure to store \"data files of phone calls obtained through broad or mass surveillance of civilians in Gaza and the West Bank.\"\n\nMicrosoft said while it has not accessed the Israeli government's data in its review, it has found \"evidence that supports elements of The Guardian’s reporting.\"\n\nMicrosoft said its review was based in part on information the Guardian collected from outside of Microsoft that the company \"could not access in light of [its] customer privacy commitments.\"\n\n## Iron Dome failed to intercept Houthi drone strike on Israel, IDF says\n\nIsrael's Iron Dome failed to intercept the drone attack launched by the Houthis on southern Israel Wednesday, the Israel Defense Forces said.\n\nThe UAV was detected \"relatively late,\" according to an initial inquiry by the commander of the Israeli air force.\n\n\"Interception attempts were made using the Iron Dome, but were unsuccessful. The cause for that has been identified, and corrective measures were implemented,\" the IDF said Thursday.\n\n\"The Commander of the Israeli Air Force has instructed several additional steps to strengthen readiness, detection, and interception capabilities, and will provide an enhanced defensive response in the area,\" the IDF said.\n\n## Palestinian president calls Israeli incursion on Gaza a 'genocide'\n\nPalestinian President Mahmoud Abbas called the Israeli aggression in the Gaza Strip a genocide and called for an end to the incursion.\n\n\"I speak to you today after almost two years in which our Palestinian people in the Gaza Strip have been facing a war of genocide, destruction, starvation and displacement waged by the Israeli occupation forces,\" Abbas said speaking at the United Nations General Assembly.\n\n\"What Israel is carrying out is not merely an aggression, it is a war crime and a crime against humanity that is both documented and monitored and it will be recorded in history books and the pages of international conscious as one of the most horrific chapters of humanitarian tragedy in the 20th and 21st centuries,\" Abbas said.\n\nA committee has began its work to draft a constitution for the state of Palestine as a nation-state and that will be completed within three months. This will be for the state of Palestine with the 1967 borders and east Jerusalem as its capital, Abbas said.\n\nAbbas also called for Israel to stop its plans to establish more illegal settlements and plans to annex more land in the West Bank.\n\n- Israel\n\n## Sponsored Content by Taboola\n\n## Trump admin live updates: Trump announces new tariffs on cabinets, trucks, drugs\n\n- Sep 25, 4:37 PM\n\n## Mystery drones over Denmark are 'hybrid attack,' defense minister says\n\n- Sep 25, 5:00 PM\n\n## Starbucks to lay off hundreds of workers, close stores in North America\n\n- Sep 25, 8:38 AM\n\n## Coast Guard seizes 5 tons of narcotics worth over $64.5 million in Caribbean Sea bust\n\n- Sep 25, 3:27 AM\n\n## Netanyahu's jet largely avoids European airspace in unusual route to New York\n\n- Sep 25, 2:47 PM",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "Semafor - An intelligent, transparent global news platform for breaking stories, analysis and video",
      "url": "https://www.semafor.com?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.semafor.com/_next/static/media/semafor-og-lg.30379187.png",
        "1": "https://static.semafor.com/_next/static/media/signals_cover.52825a05.png",
        "2": "https://img.semafor.com/72450d3e2fe0509fe3d08fc64c4973f18986ce2e-2150x1423.jpg?rect=127%2C0%2C1897%2C1423&w=1920&h=966&q=75&auto=format",
        "3": "https://static.semafor.com/_next/static/media/world_map_sm.c8d5f47b.png",
        "4": "https://img.semafor.com/c38bcdd5c613abcae6f435e040c0d3fc1fee268b-3338x2225.jpg?rect=186%2C0%2C2967%2C2225&w=1920&h=966&q=75&auto=format"
      },
      "content": "## Comey becomes first of Trump’s enemies to face charges\n\n## DR Congo-Rwanda peace deal not ‘fully’ implemented: Boulos\n\n## DR Congo-Rwanda peace deal not ‘fully’ implemented: Boulos\n\n## Versant CEO Mark Lazarus on the new Versant, what it might buy, and life after cable\n\nBen Smith\n\n## View / Saudi’s proposed market reform shows impetus for foreign cash\n\nMatthew Martin\n\n## The World at a Glance\n\nFederal Reserve board member Lisa Cook urged SCOTUS not to fire her in a case seen as eroding the central bank’s independence.\n\nEuropean diplomats told the Kremlin that NATO is prepared to shoot down Russian planes that enter its airspace, as tensions rise.\n\nDengue and cholera are spreading across Sudan, compounding a humanitarian crisis caused by the country’s devastating civil war.\n\nBeijing launched an investigation into Mexican duties on Chinese products, as US pressures its neighbor to shrink trade with China.\n\nArgentina’s poverty rate has fallen by more than 20 percentage points since President Javier Milei took power in 2023, new data showed.\n\nA federal jury indicted former FBI Director James Comey, a longtime Donald Trump foe, over allegations he lied to Congress.\n\n## Abu Dhabi’s MGX joins consortium to keep TikTok alive in US\n\n## How Brian Niccol brewed his ‘Back to Starbucks’ strategy\n\n## Grenell frustrates Trump allies with softer line on Maduro\n\n## Do Republicans have ‘room’ for Trump critics? Paul and Massie hope so\n\n## Saudis cool on Western college degrees as local options rise\n\n## Intel seeks investment from Apple\n\n## WTO chief lauds ‘momentous’ China decision to forgo developing country benefits\n\n### CURIO\n\n## Radiohead album art gets museum treatment\n\n## Debatable: The value of multilateral organizations\n\n## Comey becomes first of Trump’s enemies to face charges\n\n## Do Republicans have ‘room’ for Trump critics? Paul and Massie hope so\n\n## Grenell frustrates Trump allies with softer line on Maduro\n\n## WHO rejects White House’s claim of Tylenol autism link\n\n## Kenya’s Ruto pushes to improve US trade relations\n\n## As Erdoğan visits White House, Trump hopes to strike deals\n\n## How one top crypto exec thinks about the industry’s must-pass bill\n\n## Government funding offramp still intact, senator says\n\n## Democrats dig in on, and often politically benefit from, protesting ICE\n\n## Massie: Republican leaders threatened supporters of push to release Epstein files\n\n## ‘Mass deployment is just around the corner’: Pony AI’s Peng on the robotaxi revolution\n\n## How Brian Niccol brewed his ‘Back to Starbucks’ strategy\n\n## Intel seeks investment from Apple\n\n## Disney could have sold ABC. But then where would we be?\n\n## Democrats are poking at MAGA’s antitrust soft spot\n\n## Abu Dhabi’s MGX joins consortium to keep TikTok alive in US\n\n## Intel seeks investment from Apple\n\n## ‘All-of-the-above’ approach needed to power AI boom, Nvidia sustainability chief says\n\n## World leaders demand consensus on AI safety in open letter\n\n## It’s time to revamp H-1Bs\n\n## House committee prods social media platforms about extremist activity\n\n## Trade restrictions likely to be new normal post-Trump\n\n## Clean energy finance firm Generate Capital expects industry consolidation\n\n## Mitsubishi fails to sell carbon-capture systems\n\n## Saudi crown prince orders rent freeze to curb Riyadh’s soaring prices\n\n## Abu Dhabi’s MGX joins consortium to keep TikTok alive in US\n\n## Dubai firms eyeing global expansion, business lobby group says\n\n## Qatar’s sovereign wealth fund partners with Blue Owl on AI\n\n## Saudis cool on Western college degrees as local options rise\n\n## DR Congo-Rwanda peace deal not ‘fully’ implemented: Boulos\n\n## Kenya’s Ruto pushes to improve US trade relations\n\n## WTO chief lauds China’s decision to forgo developing country benefits as ‘momentous occasion’\n\n## Trump’s top Africa envoy says ‘continent doesn’t need charity’\n\n## Child mortality at risk of rising in 2025 for first time this century: Gates Foundation\n\n## Miliband says rising global divisions threaten our collective ‘humanity’\n\n## US Secret Service foils major telecommunications threat ahead of UN meeting\n\n## Drone sightings in Norway and Denmark put Europe on alert\n\n## Russian warplanes breach Estonian airspace\n\n## Versant CEO Mark Lazarus on the new Versant, what it might buy, and life after cable\n\n## Disney could have sold ABC. But then where would we be?\n\n## Disney shareholders demand reasons for Kimmel suspension\n\n## Trump threatens to sue ABC News after Kimmel returns\n\n## The Verge launches a nostalgic new tech show\n\n## ‘Mass deployment is just around the corner’: Pony AI’s Peng on the robotaxi revolution\n\n## How Brian Niccol brewed his ‘Back to Starbucks’ strategy\n\n## Corinne Verdery on ‘shining the apple’ at Rick Caruso’s property empire",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "Teenage girls with no fear of police torment shopkeepers on Shirley High Street - BBC News",
      "url": "https://www.bbc.co.uk/news/articles/c0q751vlxw1o?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/96f9/live/d254ab40-996b-11f0-97f5-bd38218a3641.jpg",
        "1": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/88e9/live/4a747e30-992a-11f0-928c-71dbb8619e94.jpg",
        "2": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/d680/live/5163c870-992c-11f0-858a-a904eacbef23.jpg",
        "3": "https://ichef.bbci.co.uk/ace/standard/1800/cpsprodpb/2b8f/live/f2a27990-996b-11f0-92db-77261a15b9d2.jpg",
        "4": "https://ichef.bbci.co.uk/ace/standard/3840/cpsprodpb/e9da/live/5a7d8540-9959-11f0-928c-71dbb8619e94.jpg"
      },
      "content": "Image caption, Muhammad says it feels like the teens targeting his phone shop are above the law\n\nByDan Johnson, BBC News and Sophie Woodcock, BBC News\n\nThe teenager's sense of invincibility is clear. \"The police are never ever going to help you,\" she says, \"you can film me all you want\".She's refusing to leave a shop caught at the centre of a prolonged campaign of antisocial behaviour - windows smashed, items stolen, fires started, staff threatened and attacked.Muhammad Usman, owner of the mobile phone store in Shirley, near Southampton, is filming her on his own phone - and her juvenile bravado is in full flow. \"Touch me and I'll get you done for assault,\" she warns him.\"It's getting worse, day by day,\" Muhammad later tells us from behind his till. His voice cracks, clearly worn down by months of abuse - including, he says, a threat by a teenager to kill him. \"I've never had this kind of experience in my life before. We're feeling so helpless.\"What Muhammad and other shopkeepers have experienced over recent months captures the challenge antisocial behaviour poses to police, councils and communities at a time when the government has said tackling it is a key priority.Three doors down, on the same High Street, Nnenna Okonkwo is also feeling under siege. \"It's ridiculous that it's just a couple of teenagers causing this mayhem,\" she says through tears.\n\nImage caption, Nnenna says her store, Sunnyday International Foods, has also been targeted by teens\n\nBut these don't seem to be hooded gangsters armed with weapons. When I eventually encounter the gang, I'm faced with a 14-year-old girl in pink leggings and Crocs. \"I'm not claiming to be innocent because I'm not,\" she tells us. \"I've threatened people and I've hit people, I'll admit to that.\"\"The second you get into one bit of trouble with the police, you fall into it too deep and you can't get out,\" she adds.She says an injury forced her to give up sport and that behaving badly offers an alternative energy release. \"I found that I get the same adrenaline boost from being in trouble with the police and being missing and stuff.\"But there's little remorse. \"I regret what I do, but I don't say sorry,\" she says to cheers from the rest of the gang.She seems bright but deeply troubled. She admits drinking and she's vaping while we talk. Muhammad had already told us he had experienced racist abuse - something the girl firmly denies being involved in.One of her friends chimes in. \"I know what we're doing is wrong but we're teenage kids, we're going to have a bit of fun,\" she tells us. \"I'm sorry for most of the people we have damaged, but I have no sympathy… it's just one way of taking my anger out.\"\n\nImage caption, CCTV captured teenagers running amok in some shops in Shirley, stealing or damaging items\n\nResponding to this BBC report, Prime Minister Keir Starmer said: \"Let me be really clear what we're seeing [in Southampton] is completely unacceptable. That shouldn't be happening in any community.\"He said people committing anti-social behaviour \"should be fearful that they're going to feel the full force of the law\".Labour was elected last year promising new \"respect orders\" to ban similarly persistent offenders from town centres. Due to be introduced under the Crime and Policing Bill currently going through Parliament, breaching the orders would be a criminal offence with potential penalties including a two-year prison sentence, unlimited fines, or unpaid work.That would partially replace existing civil injunction powers. But the respect orders would not apply to under-18s. An amendment aims to bring that down to 16, but would still not apply to anyone younger.​​Ministers have also promised more neighbourhood policing. In Shirley, Muhammad's complaint is not the number of officers, but their apparent lack of power or willingness to tackle the teenagers. \"You don't see any action against them,\" he says. \"You feel they are above the law.\"\n\n## 'We need to be more robust'\n\nThe local beat officer, PC Tom Byrne, says he recognises the concern and that antisocial behaviour is being dealt with.\"We do need to remember we are dealing with young people,\" he told BBC News in July, saying that while \"there will be consequences\", these need to be appropriate when it comes to children.\n\nImage caption, Some shop windows are being broken as part of the antisocial behaviour\n\nSuch instincts to keep young people away from the criminal justice system are deep-rooted in policing - perhaps in the hope antisocial behaviour fizzles out. However, the problem has got worse over the long, hot summer of 2025.Behaviour like this isn't just happening on one High Street, and it's not just teenagers. A few miles along the south coast in Portsmouth, Neil Gibson knows the cost of repeated antisocial behaviour. His car repair business has been hit repeatedly, he believes by the same group of young men. Security camera footage shows one hooded youth hammering a windscreen with a broom until it smashes.Neil spends some evenings remotely checking his security cameras from home. \"I did phone [the police] and say look, if you send someone now, you'll catch them - perfect situation. I'm afraid they weren't interested.\"Disheartened, he says he no longer reports every incident.In nearby Fratton, a former industrial part of Portsmouth now largely residential, we see what the police are up against.\n\nPatrolling the cemetery one evening, PC Chris Middleton attempts to stop a young man zipping down a footpath on an electric scooter - but the masked figure simply ignores the constable and speeds off.We ask PC Middleton if he can see why some people believe the police are powerless. \"Yeah, I feel it,\" he says. \"At times I really do feel that we need to be more robust and we need more support from the government to tackle these things.\"A short while later, a convicted shoplifter who is wanted on recall to prison walks past - he is searched and arrested.\n\nImage caption, Officers arrest a convicted shoplifter who was carrying a bag full of chewing gum boxes\n\nIt's a similar story for councils, many of whom across the country are using community wardens to keep a grip on antisocial behaviour. Jason, a warden for Portsmouth City Council, tells us \"a lot of police stuff is being downgraded to antisocial behaviour\", multiplying his workload.Cllr Matt Boughton, chair of the Local Government Association's safer and stronger communities committee, has a similar view - telling BBC News that councils \"are increasingly having to step in when police resources are stretched…putting extra pressure on already stretched councils, pressure which is unsustainable\".How can these issues in the communities we've visited - and many others like them across the country - really be solved, then?\n\n## 'I regret all of it'\n\nSomeone whose role involves working alongside the wider criminal justice system is Donna Jones, Hampshire's police and crime commissioner (PCC). The former Conservative councillor feels the police need a change of approach to dealing with youths and their parents.\"I think the response from the police, to be absolutely honest with you, has been to take a slightly slower approach but some of these young people are committing some really horrible, nasty offences,\" she tells us while visiting shopkeepers in Shirley. She says they are being plagued by \"an urban street gang made up of quite a high number of young girls\".\"What we need to be doing is also putting the parents more on the record for some of this stuff too so perhaps some change in legislation that does make parents much more accountable.\"\n\nImage caption, Donna Jones says that some young people are committing serious offences\n\nAuthorities already possess a range of powers, including civil injunctions, community protection notices, dispersal orders and criminal behaviour orders - the original antisocial behaviour order (ASBO) was replaced in 2014. They can also fine parents and even remove social housing.But not all of these are applicable to children, and using the ones which are, at scale, will end up criminalising more children. Such measures require time and evidence to obtain, straddling police and councils and concerning often vulnerable young people.There have been arrests. According to the Crown Prosecution Service (CPS), a teenager has now been charged with 21 offences, spanning three cases, including assault, theft, arson, criminal damage, breaching a dispersal order and racially aggravated harassment. The teenager appeared at Southampton Youth Court last week and is due to appear again next month.After months of persistent antisocial behaviour, the situation in Shirley has calmed down in recent weeks.\n\nImage caption, Shirley High Street has had its issues over summer - but there is hope\n\nResponding to the BBC, Policing Minister Sarah Jones said \"for too long, people have not seen police patrolling their streets\". She said \"this government has increased police patrols in high-crime areas across the country through our Safer Streets Summer Initiative\".Pledging 3,000 more neighbourhood police on the beat by March 2026, she said \"we are sending a clear message: crime will be punished\".And on Thursday the prime minister is due to announce measures to give communities more power to \"seize boarded shops\" and \"block gambling and vape shops on their High Street\".Hampshire Police told us it had \"endeavoured to respond to as many reports as possible\" of antisocial behaviour on Shirley High Street but \"had to ensure this was balanced against the increase in emergency calls\" over the summer months.Away from the mayhem, we did find some more positive news. As the summer draws to a close and kids return to school, Jaiden, 15, recalls the hours he spent in a police cell after being arrested. From the sofa of his home in Shirley, he tells us he was causing trouble at shops \"nearly every day\".\"It was fun getting people mad but then I realised after a while it wasn't.\"His mum Kylie says she pleaded with the police to act, having felt she'd lost her son to peer pressure. \"Two or three times I asked them 'just arrest him'. They said we can't due to his age, we're going to just have to bring him home. There's not much we can do.\"He reads the list of rules he and his mum have since signed in a voluntary \"acceptable behaviour contract\". They include him not stealing, making threats, or using foul or abusive language and leaving shops when ordered. If he complies, he can avoid court.Jaiden vows to never go back to that way of life. \"I regret all of it,\" he says.Correction: This story has been updated to remove a reference about an earlier court date, involving a teenager, which did not go ahead, and updated with details about the number of offences they face.\n\n## Get in touch\n\nHave you experienced antisocial behaviour on your high street or local area? Share with us your story.\n\nContact formContact form\n\n## Related topics\n\n- [Southampton](https://www.bbc.co.uk/news/topics/cjkm56d025wt) - [Hampshire & Isle of Wight](https://www.bbc.co.uk/news/england/hampshire)\n\n## More on this story\n\n- 'Every night there is banging on our walls'Published23 May - Flats residents 'trapped' by anti-social behaviourPublished4 February - London anti-social behaviour hotspots named by MetPublished9 July\n\nView comments | 5562",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "Trump says he ‘will not allow’ Israel to annex occupied West Bank | Israel-Palestine conflict News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/9/26/trump-says-he-will-not-allow-israel-to-annex-occupied-west-bank?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/07/AP25035775574779-1752025307.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/09/AFP__20250925__76TH982__v1__HighRes__UsPoliticsTrump-1758868917.jpg?resize=730%2C410&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2020/09/royce-1757660218.jpg?resize=96%2C96&quality=80"
      },
      "content": "Trump says he ‘will not allow’ Israel to annex occupied West Bank | Israel-Palestine conflict News | Al Jazeera\n\nToggle PlayIs recognising the State of Palestine going to make a difference on the ground?\n\nBy Royce Kurmelovs and News AgenciesPublished On 26 Sep 202526 Sep 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nUnited States President Donald Trump has said that Israel cannot annex the occupied West Bank, a statement that puts him firmly at odds with Israeli Prime Minister Benjamin Netanyahu and members of his ultranationalist government who have been pressing for annexation of the Palestinian territory.\n\nTrump made his surprise remarks while speaking to reporters on Thursday, ahead of Netanyahu’s arrival in the US to address the United Nations General Assembly in New York on Friday.\n\n## Recommended Stories\n\nlist of 4 items\n\n- list 1 of 4[Israel’s Smotrich calls for phased Gaza annexation if Hamas does not disarm](https://www.aljazeera.com/news/2025/8/28/israels-smotrich-calls-for-phased-gaza-annexation-if-hamas-does-not-disarm) - list 2 of 4[Israel bristles as UK leads Western recognition of Palestine](https://www.aljazeera.com/features/2025/9/21/israel-bristles-as-uk-leads-western-recognition-of-palestine) - list 3 of 4[Israel seeks permanent Gaza control, Jewish majority in West Bank: UN](https://www.aljazeera.com/news/2025/9/23/israel-seeks-permanent-gaza-control-jewish-majority-in-west-bank-un) - list 4 of 4[Israel is guilty of war crimes, Palestine’s Abbas tells UN General Assembly](https://www.aljazeera.com/news/2025/9/25/israel-is-guilty-of-war-crimes-palestines-abbas-tells-unga)\n\nend of list\n\n“ I will not allow Israel to annex the West Bank. Nope. I will not allow. It’s not gonna happen,” Trump said.\n\nAsked whether he had discussed his plans to block any Israeli annexation attempts with Netanyahu, Trump was noncommittal.\n\n“Yeah, but I’m not gonna allow it. Whether I spoke to him or not, I’m not allowing Israel to annex the West Bank. There’s been enough. It’s time to stop now, OK?” the US president said.\n\nTrump did not offer details of what actions he would take to prevent the possible annexation of the occupied West Bank, and analysts questioned whether the notoriously capricious US leader would change his mind.\n\n## ‘What will he do about it?’\n\nSpeaking to Al Jazeera, Mouin Rabbani, an analyst and non-resident fellow at the Qatar-based Center for Conflict and Humanitarian Studies, said Trump’s statement was a “positive” development, but he questioned whether the president would “follow through”.\n\n“One attaches value to Trump’s words at their own peril,” Rabbani said.\n\n“So the question now becomes, is he going to ensure that Israel does not annex the West Bank, and if it does, what will he do about it? Will his mind perhaps be changed by another conversation that he has?”\n\nAdvertisement\n\nMohamad Elmasry, professor at the Doha Institute for Graduate Studies, also suggested caution.\n\n“The US administration sometimes does seemingly rebuke Israel or indicate their opposition to something Israel is doing, but then they end up allowing Israel to do whatever it wants,” Elmasry said, noting how former President Joe Biden had said that the US, Israel’s chief diplomatic and military backer, [would not have allowed Israel](https://www.aljazeera.com/news/2024/3/10/biden-makes-contradictory-remarks-on-red-lines-for-israel-in-gaza) to attack Gaza’s southern city of Rafah and then stood back when that happened.\n\nBut regardless the US’s rhetoric, Elmasry said, “the reality is that Israel already exerts de facto control over the West Bank … In some ways, the whole annexation question is a bit academic”.\n\nTrump’s comments potentially place his administration on a collision course with the far-right Israeli government led by Netanyahu, members of which have made the annexation of the occupied West Bank and Gaza a formal political goal.\n\nIn July, Israeli lawmakers [voted 71-to-13 in favour of a non-binding motion](https://www.aljazeera.com/news/2025/7/23/israeli-parliament-approves-symbolic-motion-on-west-bank-annexation) in the Knesset calling for the annexation of the West Bank.\n\nThe proposal was initially brought by Israel’s finance minister and far-right political leader, Bezalel Smotrich, who lives in an illegal settlement in the occupied West Bank and [holds a position within Israel’s Ministry of Defence](https://www.aljazeera.com/news/2025/7/23/israeli-parliament-approves-symbolic-motion-on-west-bank-annexation) where he oversees the administration of illegal settlements on occupied Palestinian land.\n\nSmotrich and other far-right members of Netanyahu’s governing coalition have also voiced staunch opposition to efforts to reach a deal to end Israel’s war on Gaza, even threatening to topple the government if an agreement is reached.\n\n## ICJ ruling\n\nIn advance of Australia, France, Britain, Canada, Portugal and other countries moving to recognise Palestinian statehood this week, Smotrich unveiled a plan allowing for the construction of thousands of homes in a controversial illegal settlement that bisects the occupied West Bank.\n\nThe [massive E1 settlement expansion](https://www.aljazeera.com/news/2025/8/21/israel-settlement-plan-threatens-viability-of-future-palestinian-state) on occupied land, when completed, “finally buries the idea of a Palestinian state, because there is nothing to recognise and no one to recognise”, he said in August.\n\n“Anyone in the world who tries today to recognise a Palestinian state will receive an answer from us on the ground,” he added.\n\nIsraeli settlement in the occupied West Bank has been ongoing since 1967, stretching deep into Palestinian territory and carving up the landscape thanks to a network of roads and other infrastructure controlled by the Israeli government and military.\n\nAdvertisement\n\nThe International Court of Justice [ruled in July 2024](https://www.aljazeera.com/news/2024/7/19/world-court-says-israels-settlement-policies-breach-international-law) that Israeli settlements in the occupied West Bank are illegal and must be discontinued and the land returned to Palestinians.\n\nIsrael has been a cornerstone of US foreign policy in the Middle East, and the Israeli government is heavily dependent on financial, military and intelligence support from the US to maintain its ongoing campaign in Gaza, the occupied West Bank and parts of Lebanon and Syria.\n\nAny reversal of US policy could trigger a political crisis in Israel, particularly among the far-right parties who make up Netanyahu’s coalition government.\n\nReferring to Gaza briefly on Thursday, Trump described the overall situation as “really bad, very bad”.\n\nDespite suggesting a peace deal could happen “soon”, Trump offered no details or clarity except to say that “very, really good talks” had been held with leaders of Arab states and Netanyahu.\n\nEarlier this week, Trump met with the leaders of Saudi Arabia, Qatar, the UAE, Egypt, Jordan, Turkiye, Indonesia and Pakistan on the sidelines of the UN General Assembly to discuss ending Israel’s ongoing military assault on Gaza.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.299Z"
    },
    {
      "title": "UN latest: Dozens of delegates walk out on Netanyahu's UN address in protest | World News | Sky News",
      "url": "https://news.sky.com/story/gaza-trump-un-palestine-state-netanyahu-israel-hamas-latest-live-13435340?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/09/1600x900/skynews-benjamin-netanyahu_7032274.jpg?20250926141114",
        "1": "https://e3.365dm.com/25/09/768x432/skynews-benjamin-netanyahu_7032274.jpg?20250926141114",
        "2": "https://news.sky.com/resources/ui-app-promo-apple-app-store.png",
        "3": "https://news.sky.com/resources/ui-app-promo-google-play.png",
        "4": "https://news.sky.com/resources/apple-touch-icon.png"
      },
      "content": "Live Live\n\n# UN latest: Dozens of delegates walk out on Netanyahu's UN address in protest\n\nDozens of delegates have walked out of the UN General Assembly hall as Benjamin Netanyahu started his address. Follow the latest below.\n\nFriday 26 September 2025 14:54, UK\n\n- [Gaza](https://news.sky.com/topic/gaza-8014) - [LIVE](https://news.sky.com/topic/live-7029) - [Ukraine](https://news.sky.com/topic/ukraine-6556) - [United Nations](https://news.sky.com/topic/united-nations-5784)\n\nPlease use Chrome browser for a more accessible video player UN General Assembly: Watch live\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\n##### Key points\n\n- **Benjamin Netanyahu addressing UN General Assembly - watch live above** - [Delegates stage walk out as Israeli PM begins speech](https://news.sky.com/story/un-latest-zelenskyy-to-address-general-assembly-after-trumps-big-shift-on-ukraine-13435340?postid=10244528#liveblog-body) - [Netanyahu sends direct message to hostages in Gaza](https://news.sky.com/story/un-latest-zelenskyy-to-address-general-assembly-after-trumps-big-shift-on-ukraine-13435340?postid=10244591#liveblog-body) - [And presents map showing 'where things stand today' in Middle East](https://news.sky.com/story/un-latest-zelenskyy-to-address-general-assembly-after-trumps-big-shift-on-ukraine-13435340?postid=10244579#liveblog-body) - [Before holding 'pop quiz' for UN dignitaries](https://news.sky.com/story/un-latest-zelenskyy-to-address-general-assembly-after-trumps-big-shift-on-ukraine-13435340?postid=10244623#liveblog-body) - ['You caved': Netanyahu accuses world leaders of 'buckling' after 7 October](https://news.sky.com/story/un-latest-zelenskyy-to-address-general-assembly-after-trumps-big-shift-on-ukraine-13435340?postid=10244647#liveblog-body) - Listen to the latest Trump 100 and never miss an episode by clicking [here](https://podfollow.com/trump100/view) - Live reporting by [Kieren Williams](https://news.sky.com/author/kieren-williams-1042)and[Adam McGroarty](https://news.sky.com/author/adam-mcgroarty-1049)\n\n14:49:33 Netanyahu finishes address Benjamin Netanyahu has now finished his address to the UN General Assembly.He ran over his 15-minute slot, speaking for around 40 minutes.There was applause and cheering as he walked from the podium just now, following the large walkouts when he arrived.\n\n14:48:05 Door to peace with Syria and Lebanon is open, Netanyahu says - but he sends warning The Israeli leader says the door to peace with Syria and Lebanon is open.However, he warns that until then: \"We will take whatever action we need to defend ourselves\".Earlier in the summer, Israel launched strikes on Damascus after Arab fighters clashed with Druze groups, who have historic ties with Israel, in Syria's south.It has also repeatedly struck Lebanon, where Hezbollah is based.\"Today we have begun serious negotiations with the new Syrian government,\" Netanyahu says.Syria's leader Ahmed al Sharaa became the first Syrian leader to address the assembly in almost six decades, when he spoke this week.\"I believe an agreement can be reached that respects serious sovereignty and protects both Israeli security and the security of the minorities in the region, including the Druze minority, from the founding of Israel,\" Netanyahu adds.On Lebanon, he goes on to say: \"If Lebanon takes genuine and sustained action to disarm Hezbollah, I'm sure we can achieve a sustainable peace.\"\n\n14:39:34 Netanyahu says recognising a Palestinian state 'rewards the worst antisemites on earth' Benjamin Netanyahu now turns to the countries that have been recognising a Palestinian state.He says \"every government\" should follow Donald Trump's lead in refusing to take the move.\"Instead, many do the opposite,\" he says.\"They actually reward the worst antisemites on earth.\"Netanyahu says \"nearly 90% of Palestinians\" supported the Hamas attack on 7 October 2023, and describes the move to recognise a Palestinian state as a \"very clear message\".\"Murdering Jews pays off,\" he adds.\"I have a message for these leaders, when the most savage terrorists on earth and effusively praising your decision, you didn't do something right, you did something wrong.Your disgraceful decision will encourage terrorism against Jews and against innocent people everywhere.\"For context: According to polling from the Palestinian Center for Policy and Survey Research, 72% of Palestinians who were surveyed in December 2023 supported the 7 October attacks - a number that had fallen to 50% by May of this year.In Gaza, the equivalent figures were 57% and 37%.\n\n14:33:34 Netanyahu addresses Gaza City assault Next up in his speech, Netanyahu addresses Israel's ongoing assault on Gaza City.The Israeli leader tries to refute several criticisms of his war in Gaza, including accusations of huge numbers of civilian casualties and the humanitarian crisis there.He also says Israel has been targeting \"terror tunnels\" and \"terror towers\" in the urban centre.Netanyahu is trying to frame Hamas as responsible for the conditions Palestinians find themselves in.He adds that 700,000 people have left Gaza City since Israel issued its first evacuation demands this month.On accusations that Israel is \"deliberately targeting civilians\", Netanyahu says \"the opposite is true\", stating that Israel has dropped \"millions of leaflets and sent millions of texts\" to get civilians to evacuate Gaza City.For context: More than 300,000 people have fled Gaza City in recent weeks as Israel has ordered the population to move south, but UN agencies and aid groups say an estimated 700,000 remain.More than 65,000 Palestinians have been killed since October 2023, according to the Gaza Health Ministry, more than half of them women and children.Its figure does not differentiate between civilians and fighters.\n\n14:32:05 'You caved': Netanyahu accuses world leaders of 'buckling' after 7 October Benjamin Netanyahu says \"many world leaders have buckled\" in their support of Israel following 7 October 2023.\"They buckled under the pressure of a bias media, radical Islamist constituent voices and antisemitic mobs,\" he says.\"There's a familiar saying, when the going gets tough, the tough gets going. Well, for many countries here, when the going got tough you caved.\"He says Israel has been fighting a \"seven-front war against barbarism\" for much of the last two years.\"Astoundingly, as we fight the terrorists who murdered many of your citizens, you are fighting us,\" he adds.\"You condemn us, you embargo us and you wage political and legal warfare.\"He goes on to tell the UN \"it's an indictment of you, it's an indictment of weak-kneed leaders who appease evil rather than support a nation whose brave soldiers guard you from the barbarians at the gate\".Netanyahu's comments come days after a wave of countries - including the UK, France and Canada - recognised a Palestinian state.\n\n14:28:05 Protests take place outside as Netanyahu addresses UN We're bringing you all the latest from inside the UN General Assembly, but outside, protesters have assembled in New York.People are waving Palestinian flags and chanting.Some signs read: \"End all US aid to Israel\".There is also a pro-Israel protest, where Israeli flags are being waved.\n\n14:25:18\n\n'Our enemies hate all of us': Netanyahu hosts pop quiz\n\nAs we said ahead of his address, Netanyahu was expected to use props and he's rolled out a small pop quiz now.\n\nThe first question he asks is: \"Who shouts death to America?\"\n\nHe gives the following as possible answers:\n\n- Iran - Hamas - Hezbollah - Houthis - All of the above\n\nNetanyahu says the answer is \"all of the above\".\n\nHe asks a second question - \"Who has murdered Americans and Europeans in cold blood?\"\n\nThe answers are:\n\n- Al Qaeda - Hamas - Hezbollah - Iran - All of the above\n\nThe answer was again \"all of the above\", Netanyahu says.\n\nHe uses the quiz to try and frame Israel's enemies as enemies to all of the West and the UN.\n\n\"Here's the point I wanted to make: our enemies hate all of us with equal venom. They want to drag the modern world back to the past, to a dark age of violence, fanaticism and terror. I think many of you are already feeling in your own societies,\" he says.\n\n14:19:43 Netanyahu delivers direct address to hostages Benjamin Netanyahu now says he wants to speak directly to the hostages through the loudspeakers in Gaza.He begins his message in Hebrew before repeating it in English.\"Our brave heroes, this is Prime Minister Netanyahu speaking to you live from the United Nations,\" he says.\"We have not forgotten you, not even for a second. The people of Israel are with you, we will not falter, and we will not rest until we bring all of you home.\"Now, in a direct message to Hamas, Netanyahu says \"free the hostages now\".\"If you do, you will live,\" he says.\"If you don't, Israel will hunt you down.\"For context: Leaders including Turkish President Recep Tayyip Erdogan and Qatar's emir, Tamim bin Hamad Al Thani, have previously suggested Netanyahu's actions indicate he is not interested in securing the release of the remaining hostages.Families of Israeli hostages still being held by Hamas have also said Netanyahu is the \"one obstacle\" preventing their return and reaching a peace deal.The Hostages and Missing Families Forum said Israel's strike on Qatar earlier this month showed \"every time a deal approaches, Netanyahu sabotages it\".\"The targeted operation in Qatar proved beyond any doubt that there is one obstacle to returning the 48 hostages and ending the war: Prime Minister Netanyahu,\" they said.\"The time has come to end the excuses designed to buy time so he can cling to power.\"\n\n14:19:16\n\n'Israel must finish the job in Gaza'\n\nAfter the threat of Iran, Netanyahu goes on to talk about Israel's ongoing assault of Gaza City.\n\nAnd, as our experts said, the Israeli prime minister focuses on the 7 October attack.\n\nHe says:\n\n> \"The final elements, the final remnants of Hamas are holed up in Gaza City. They vow to repeat the atrocities of October 7th again and again and again, no matter how diminished their forces. That is why Israel must finish the job. That is why we want to do so as fast as possible.\"\n\nHe goes on to add: \"Ladies and gentlemen, much of the world no longer remembers October 7th. But we remember.\"\n\nNetanyahu details what happened on 7 October, where Hamas and militant groups surged over the Israeli-Gaza border and killed 1,200 people, kidnapping around 250.\n\nOf the 48 hostages left in Gaza, Netanyahu says 20 are alive and he names them.\n\n14:17:36 'Gone': Netanyahu shows map of 'where things stand today' Benjamin Netanyahu is now telling the UN \"where things stands today\".\"Half of the Houthi leadership, gone,\" he says.\"Hassan Nasrallah in Lebanon, gone.\"The Assad regime in Syria, gone.\"Those militias in Iraq, well, they're still deterred, and their leaders, if they attack Israel, will also be gone.\"Netanyahu now turns to the \"12-day war with Iran\" as he praises Israel's \"daring pilots\".\"I want to thank president Trump for his bold and decisive action,\" he adds.\"President Trump and I promise to prevent Iran from developing nuclear weapons, and we delivered on that promise.\"We removed an existential threat to Israel and a mortal threat to the civilised world.\"\n\nThis content is provided by , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable cookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options. Unfortunately we have been unable to verify if you have consented to cookies. To view this content you can use the button below to allow cookies for this session only. Enable Cookies Allow Cookies Once\n\n[Be the first to get Breaking News Install the Sky News app for free](https://qrcode.skynews.com/skynews/appdownloadblog)\n\nfooter",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Zelensky warns UN: Russia could attack you next as Trump turns on Putin | The Independent",
      "url": "https://www.independent.co.uk/news/world/europe/zelensky-un-trump-putin-ukraine-russia-war-b2833275.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.independent.co.uk/2025/09/24/15/ONU_ASAMBLEA_GENERAL_UCRANIA_66868.jpg?width=1200&height=800&crop=1200:800",
        "1": "https://static.independent.co.uk/2025/09/24/15/ONU_ASAMBLEA_GENERAL_UCRANIA_66868.jpg",
        "2": "https://static.independent.co.uk/2025/09/23/11/52/TOPSHOT-UKRAINE-RUSSIA-CONFLICT-WAR-02sxjbb1.jpeg",
        "3": "https://static.independent.co.uk/2025/09/24/12/EUR-GEN_UCRANIA-GUERRA_75686.jpg"
      },
      "content": "Vladimir Putin is expanding his war into Europe and no country should feel safe from the Russian threat, Volodymyr Zelensky warned in an impassioned speech to the UN General Assembly.The Ukrainian leader made a plea for countries worldwide to band together and called on the UN to help bring a halt to “the most destructive arms race in human history”, as he took to the stage one day after Donald Trump’s hour-long speech on Tuesday. “Putin will keep driving the war forward, wider and deeper,” Mr Zelensky said. “We told you before: Ukraine is only the first. Now Russian drones are already flying across Europe, and Russian operations are already spreading across countries.“Putin wants to continue this war by expanding it, and no one can feel safe right now.” open image in galleryVolodymyr Zelensky speaks at UN General Assembly (AP)Nato countries have rallied together against repeated Russian incursions into European airspace recently. Earlier this month, around 20 drones entered Polish airspace; last week, three Russian MiG-31 fighter jets entered Estonian territory, where they remained for 12 minutes; and there were several other smaller-scale incursions, including into Romania. An increasingly disillusioned US president said on Tuesday that Nato member countries should shoot down Russian aircraft if they enter their airspace. He later made surprise social media comments in a dramatic shift in tone on the Ukraine war, stating that Kyiv could push Russian forces back to the “original Borders from where this War started”. But Mr Zelensky’s speech on Wednesday cut a graver tone than Trump’s Truth Social comments. The Ukrainian president sought to put the onus for stopping the spread of chaos on the international community. He warned that without supporting Ukraine militarily and cutting Russia off economically, Putin’s aggression could lead to a devastating arms race.“We are now living through the most destructive arms race in human history”, Mr Zelensky told delegates, stating that AI-controlled drones will be the next major breakthrough to be used in real combat. “Weapons move fast. Now companies are already working on drones that can shoot down other drones, and it's only a matter of time before drones are fighting drones, attacking critical infrastructure, and targeting people all by themselves, fully autonomous and with no human involved, except the few who control AI systems.” open image in galleryThe Ukrainian air defence shoots down a Russian drone above Kyiv during an overnight mass drone and missile strike (AFP/Getty)Mr Zelensky called for “global rules now for how AI can be used in weapons”, adding that this is “just as urgent as preventing the spread of nuclear weapons”. “Every year that this war goes on, weapons become even more deadly. And only Russia deserves to be blamed for this,” he added. Ukraine has decided to begin exporting its weapons to allies, Mr Zelensky added, promising that they “don’t need to start this race from scratch”. \"We are ready to make our modern weapons become your modern security. We have decided to open up arms export. And these are powerful systems tested in a real war when every international institution failed,\" he said.The Kremlin, meanwhile, earlier lashed out at a “deeply mistaken” Trump following his scathing social media comments, in which he also described Russia’s war as “aimless”.open image in galleryThe presidents of Ukraine and the US meet during the UN General Assembly in New York (AP)“As far as we understand, President Trump’s statements were made after communicating with Zelensky and, apparently, under the influence of a vision set out by Zelensky,” said Kremlin spokesperson Dmitry Peskov. “This vision contrasts sharply with our understanding of the current state of affairs.“The fact that Ukraine is being encouraged in every possible way to continue hostilities and the argument that Ukraine can win something back is, in our view, a mistaken argument ... The dynamics on the front lines speak for themselves.”Bristling at Mr Trump’s description of the Russian military as a “paper tiger”, Peskov responded: “Russia isn’t a tiger, it’s more associated with a bear. There are no paper bears. Russia is a real bear.”Peskov said Russian foreign minister Sergei Lavrov will hold talks with US secretary of state Marco Rubio later on Wednesday, where he will provide “real information” about the state of the front line in Ukraine.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "In maps: The battlefields of Ukraine, as Trump backs Kyiv to take back all territory | World News | Sky News",
      "url": "https://news.sky.com/story/in-maps-the-battlefields-of-ukraine-as-trump-backs-kyiv-to-take-back-all-territory-13437125?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/09/1600x900/skynews-ukraine-map_7031070.png?20250925092523",
        "1": "https://e3.365dm.com/25/09/768x432/skynews-ukraine-map_7031070.png?20250925092523",
        "2": "https://e3.365dm.com/25/06/75x75/skynews-narbeh-minassian_6949677.png?20250624152536",
        "3": "https://e3.365dm.com/25/09/768x432/skynews-trump-zelenskyy-michael-clarke_7030381.jpg?20250924134827"
      },
      "content": "Explainer Explainer\n\n# In maps: The battlefields of Ukraine, as Trump backs Kyiv to take back all territory\n\nAfter President Donald Trump said he thinks Ukraine can liberate all its territory, Sky News examines the areas of control - and where things are moving.\n\nMichael Drummond Foreign news reporter @MikeRDrummond\n\nThursday 25 September 2025 10:43, UK\n\nPlease use Chrome browser for a more accessible video player 6:11 Is Trump backing Ukraine now?\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nDonald Trump's assertion that Ukraine can retake all of its territory from Russia's \"paper tiger\" military was a stunning change in rhetoric.After praising Volodymyr Zelenskyy as a \"brave man\" who is \"putting up one hell of a fight\", the US president said he thinks Ukraine can liberate all its territory. \"I think Ukraine, with the support of the European Union, is in a position to fight and WIN all of Ukraine back in its original form,\" he wrote on Truth Social.Here, Sky News looks at the current state of the battlefield - and where Russian and Ukrainian troops are advancing.UN latest: Trump rages over 'sinister' escalator incident How much territory does Russia currently control?Russia currently occupies around 19% of Ukraine, including Crimea which it has held since 2014.Moscow has been primarily focused on four oblasts (regions) of Ukraine - Luhansk and Donetsk (the Donbas), Zaporizhzhia and Kherson - but recent efforts in the northeast have suggested additional targets.Vladimir Putin's forces control almost all of Luhansk, but about 30% of the others remain in Ukrainian hands and are fiercely contested. Image: Russia controlled much more of Ukraine soon after the full-scale invasion began Despite having a huge numerical advantage, Russia has largely failed to make significant progress since the early days of the full-scale invasion.Its forces have advanced consistently but slowly, and at huge cost. Key cities in the Donbas remain under Ukrainian control despite facing attack for more than a decade. Can Ukraine turn the tide at Pokrovsk?Some of the most brutal fighting is in the Donbas region of eastern Ukraine, an industrial heartland and also the location of some crucial strategic defences.One key city is Pokrovsk, a vital road and rail hub that was once home to around 60,000 people which has been enduring months of relentless assaults by Russian forces. Much of the city has been encircled by Kremlin troops, who are exerting pressure to try and squeeze defenders out. There have been suggestions that Pokrovsk would fall soon, despite its staunch resistance for so long.There have been reports that Russian forces control all supply routes into the city, making it very difficult for to Ukraine resupply its troops there.However, recent reports of a Ukrainian counteroffensive in that part of the frontline have challenged some of the assumptions about Pokrovsk, though it's unclear if it will be enough to change the overall situation. Please use Chrome browser for a more accessible video player 2:14 Can Ukraine regain all its land? 'Marching forward'\"Our warriors are marching forward,\" the head of Ukraine's armed forces Oleksandr Syrskyi said of the Pokrovsk front on Monday.Speaking last week, President Zelenskyy said the Ukrainian army is \"destroying\" Russian forces around Pokrovsk and nearby Dobropillia and has liberated 160 square kilometres since the start of the counteroffensive. Image: Ukraine's 'fortress belt' in the Donbas 'The fortress belt' that has held Russia back for a decadeElsewhere in the Donbas, Russian forces continue to push for Ukraine's 'fortress belt': a network of four cities including Kramatorsk and Sloviansk that has held back Russian forces for 11 years.Shortages of troops, supplies and chaotic management are making it increasingly hard to resist Russia's relentless pressure, however Kremlin troops have yet to achieve significant progress towards any of the cities.Colonel Pavlo Yurchuk, whose troops are defending a small city at the northern end of the fortress belt, said he's confident Russia's latest attempt to push through there won't work.\"From a military point of view it looks correct - on the map it looks neat - but after nearly three-and-a-half years of war we all know that such deep manoeuvres and wide flanking operations are not Russia's forte,\" he told the Associated Press. Battles in the northeastMeanwhile, Russian forces have advanced near Kupiansk in northeast Ukraine, not far from the fortress city of Kharkiv, the Institute for the Study of War (ISW) thinktank said last week.Like other targets along the Ukrainian frontline, Kupiansk is a key transport and logistics hub, being the location at which several major rail lines converge. Please use Chrome browser for a more accessible video player 34:11 Watch Ukraine Q&A after Trump shift Russia's ministry of defence has now publicly acknowledged Russia's intent to advance into Kharkiv region, despite it not being one of the four that Moscow has claimed in the past.It claimed in a social media post on Tuesday that its forces had partially enveloped Ukrainian defenders in Kupiansk, but this was challenged by the ISW thinktank, which said it had not seen geolocated evidence.The Russian defence ministry claimed its forces intend to leverage the seizure of Kupiansk to attack further into the region in several directions simultaneously, including towards Chuhuiv and Izium and towards Vovchansk. The nuclear power plant - and CrimeaIn the south, it's likely that Ukraine would be keen to regain control of the Zaporizhzhia Nuclear Power Plant, which has been under Russian control since March 2022.Recapturing it would contribute significantly to Ukraine's power needs.Further towards the coast, the cities of Mariupol and Melitopol remain in Russian hands. Beyond them, the crucial Crimea peninsula - linked to Russia by the controversial Kerch Bridge - has been under Russian control for a decade. The city of Kherson, which was liberated by Ukraine in 2022 after initially falling to Russia in the early days of the full-scale invasion, is in the part of Kherson region that Ukraine controls.It looks across the Dnipro river at territory controlled by Russia, though Ukraine has managed to establish and maintain a small beachhead on the other side despite heavy fire from Kremlin troops.\n\n### Related Topics\n\n- [Ukraine](https://news.sky.com/topic/ukraine-6556)\n\nfooter",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Ukraine war briefing: Trump ‘growing incredibly impatient’ with Russia over war, warns Vance | Ukraine | The Guardian",
      "url": "https://www.theguardian.com/world/2025/sep/25/ukraine-war-briefing-trump-growing-incredibly-impatient-with-russia-over-war-warns-vance?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/5b362619d973e3fe97c7bfaf6a4155902713df23/474_112_1526_1221/master/1526.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8644b9b37959a341ae68c49140b37b71",
        "1": "https://i.guim.co.uk/img/media/5b362619d973e3fe97c7bfaf6a4155902713df23/474_112_1526_1221/master/1526.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=fba4020c8d4155a26abab8e35d9f9989",
        "2": "https://i.guim.co.uk/img/media/5b362619d973e3fe97c7bfaf6a4155902713df23/474_112_1526_1221/master/1526.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Firefighters at work in Kharkiv, Ukraine, after a Russian drone attack on Wednesday. Photograph: APView image in fullscreenFirefighters at work in Kharkiv, Ukraine, after a Russian drone attack on Wednesday. Photograph: AP\n\nExplainer\n\n# Ukraine war briefing: Trump ‘growing incredibly impatient’ with Russia over war, warns Vance\n\nUS vice-president says if Moscow doesn’t negotiate in good faith it will be ‘very, very bad for their country’ as Zelenskyy appeals to world leaders to stop Putin. What we know on day 1,310\n\n- See all our Russia-Ukraine war coverage\n\n- US vice-president JD Vance has warned that Donald Trump is “growing incredibly impatient” with Moscow amid stalled efforts to resolve the Ukraine war. Trump “doesn’t feel like they’re putting enough on the table to end the war”, Vance said in North Carolina. “If the Russians refuse to negotiate in good faith, I think it’s going to be very, very bad for their country. That’s what the president made clear.” In a meeting earlier on Wednesday in New York, US secretary of state Marco Rubio apparently clashed with his Russian counterpart, calling for the “killing to stop” and demanding Moscow “take meaningful steps toward a durable resolution”. - Russian foreign minister Sergei Lavrov fired back and “stressed the unacceptability of the schemes promoted by Kyiv and some European capitals aimed at prolonging the conflict”, according to a readout of their conversation supplied by the Russian side. Trump unexpectedly suggested at the UN on Tuesday after meeting Volodymyr Zelenskyy that Ukraine could not only retake all of the territory it lost to Russia militarily since the 2022 Russian invasion but take even more. - The Ukrainian president praised Trump following the surprise pivot but cautioned that Nato alone could not underwrite his country’s security. “Because international institutions are too weak, this madness continues,” Zelenskyy told the general assembly. “Even being part of the longstanding military alliance doesn’t automatically mean you are safe.” He said he had a “good meeting” with Trump. “Of course we are doing everything to make sure Europe truly helps and of course we count on the United States.” - Zelenskyy appealed to global leaders to intervene to prevent Russia from leading the world through “the most destructive arms race in human history”, warning that the combination of drone technology and artificial intelligence would end in catastrophe, report Patrick Wintour, Oliver Holmes, Pjotr Sauer and Jennifer Rankin. Speaking to the UN general assembly on Wednesday, the Ukrainian president tried to galvanise not just the west but also China. His chilling account of how Russia is using technology to change the face of war was the opposite of Trump’s claim that Russia’s military may only be a paper tiger. Zelenskyy warned that Russian president Vladimir Putin, if unchecked, would use drones to expand his war throughout Europe. “Stopping Russia now is cheaper than wondering who will be the first to create a simple drone carrying a nuclear warhead,” he said. - Russia said it would press on with its military offensive in Ukraine and rejected Trump’s claim that Kyiv’s army could retake territory seized by Russia. The Kremlin also pushed back at Trump’s characterisation of Russia as a “paper tiger”. “The idea that Ukraine can recapture something is, from our point of view, mistaken,” Kremlin spokesperson Dmitry Peskov told reporters. He bristled at the accusation Russia was weak, saying it was a “real bear”, while conceding Russia’s economy was “experiencing tensions and problems”. - Ukraine and Syria formally restored diplomatic relations as their leaders met on the sidelines of the UN general assembly, Zelenskyy said. Ukraine broke off relations with Syria in 2022 after ousted Syrian leader Bashar al-Assad’s government recognised the independence of swathes of occupied Ukraine following Russia’s full-scale invasion. Ukraine has worked to engage with Syrian authorities since the December 2024 toppling of Assad, a staunch Russian ally. “We are pleased with this important step and are ready to support the Syrian people on their path to stability,” Zelenskyy said on Wednesday, while Syria’s leadership said it hoped for close relations with Kyiv.\n\nExplore more on these topics\n\n- [Ukraine](https://www.theguardian.com/world/ukraine) - [Russia-Ukraine war at a glance](https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance) - [Russia](https://www.theguardian.com/world/russia) - [Europe](https://www.theguardian.com/world/europe-news) - [explainers](https://www.theguardian.com/tone/explainers)\n\nShareReuse this content\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Trump’s UN speech makes it clear: the world can no longer look to the US for strong leadership | United Nations | The Guardian",
      "url": "https://www.theguardian.com/world/2025/sep/24/trump-un-general-assembly-speech-analysis?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/04ce3d29075ea9d76e13e7a6dcd27b23befd67c6/688_0_6880_5504/master/6880.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=206af7d4c5ddcbb8ee2cdfd5b15c532f",
        "1": "https://i.guim.co.uk/img/media/04ce3d29075ea9d76e13e7a6dcd27b23befd67c6/688_0_6880_5504/master/6880.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=1636ff614bac1ece88e1911ffc2b2ee2",
        "2": "https://i.guim.co.uk/img/media/04ce3d29075ea9d76e13e7a6dcd27b23befd67c6/0_0_8256_5504/master/8256.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Donald Trump delivers his speech to the 80th session of the UN general assembly at UN headquarters in New York on 23 September 2025. Photograph: Lukas Coch/AAPView image in fullscreenDonald Trump delivers his speech to the 80th session of the UN general assembly at UN headquarters in New York on 23 September 2025. Photograph: Lukas Coch/AAP\n\nAnalysis\n\n# Trump’s UN speech makes it clear: the world can no longer look to the US for strong leadership\n\nPatrick Wintourin New York\n\nUS president’s speech made a mockery of UN values and highlights the need for strong anti-Trumpian alliances\n\nSuch is the gravitational pull cast by Donald Trump and the US economy that the politics of the other 192 countries that make up the United Nations are rapidly being reduced to one long discussion about how to relate to and challenge this ever darker and weirder presidency.Before Trump’s extraordinary 58-minute speech on the supposed threats posed by open borders, sharia law, the UN’s failings and the “climate hoax”, the supporters of the UN’s values already knew they faced a challenge. Now they realise the degree to which the world’s superpower seems bent on the destruction of everything they believe.Immediately after the shocked, and even embarrassed, UN delegates had recovered from Trump’s performance, the general assembly was addressed by leaders of two large Muslim states, the Indonesian president, Prabowo Subianto, and the Turkish president, Recep Tayyip Erdoğan. Subianto was strongly applauded when he asserted: “Might cannot be right; right must be right. No one country can bully the whole of the human family. We may be weak individually, but the sense of oppression and injustice will unite us into a strong force that will overcome this injustice.” Erdoğan insisted that the Israeli prime minister, Benjamin Netanyahu, was completely out of control, and those that were silent in the face of his barbarity were complicit.Brazil’s president says in UN speech that democracy can prevail over ‘would-be autocrats’ Read moreAnd immediately prior to Trump’s address, the Brazilian president, Luiz Inácio Lula da Silva, without mentioning the US, had given a sophisticated warning about the threat posed by the new authoritarians. “Today the ideals that inspired the UN’s founders in San Francisco are under threat as never before in their history. Multilateralism is at a new crossroads. This organisation’s authority is in check. We are witnessing the constellation of an international order marked by repeated concessions to power play. Attacks on sovereignty, arbitrary sanctions and unilateral interventions are becoming the rule.“There is a clear parallel between multilateralism’s crisis and the weakening of democracy. Authoritarianism is strengthened when we fail to act in the face of arbitrary acts when international society falters in defending peace and sovereignty. All around the world, anti-democratic forces are trying to subjugate institutions and suffocate freedoms. They worship violence, glorify ignorance, act as physical and digital militias, and restrict the press,” Lula said.Others, such as South Korea’s president, Lee Jae Myung, insisted that the climate crisis was far from being a hoax, and that it represents a threat to global humanityYet the Trump speech also made even more stark and urgent the unavoidable question of how the world will operate in the absence of reliable American leadership.This is not just a question for the global south, but also for Europe as it confronts Russia, for Asia as it wrestles with Chinese power and for the Gulf as it grapples with Israel’s military dominance. One response is the alliance of autocrats on display in Beijing at the beginning of the month led by Xi Jinping and Vladimir Putin.But another is the still forming anti-Trump alliance led by democratic leaders. This is operating apart from the UN, because the reality is that the UN institutions, gridlocked by the veto of competing power blocks, and abandoned financially by America, is being bypassed.The US president’s claim to have ended seven “unendable wars”, all without any help from the UN, is absurd, but it is true that the UN security council is no longer capable of bringing conflicts to an end. As Lula explained: “The tyranny of the veto sabotages the very reason for the UN’s existence.”In his speech, the UN secretary general, António Guterres, made a pitch for the UN’s continued relevance, but he acknowledged the pillars of peace and prosperity were buckling, and multilateralism was suffering. “Multipolarity without effective multilateral institutions courts chaos – as Europe learned the hard way resulting in world war one,” he said.By the end of his speech he was left to comfort himself by insisting “we must never give up”.But the efforts to develop a strong anti-Trumpian alliance bringing together the global south and Europe have been weakened by the issue of double standards – the belief that Europe’s outrage with Russia’s invasion of Ukraine is not matched by similar outrage at Israel’s destruction of Gaza.Pedro Sánchez, the Spanish prime minister, in a speech to 500 Columbia University students on Monday, repeatedly warned his fellow Europeans to realise how much damage the double standards charge had caused to their image.Indeed, Sánchez is rapidly becoming the European leader most willing to stand in Trump’s way. At Columbia, he drew applause defending the positive virtues of migration and said: “Open societies are the best antidote to fanaticism” – remarks that had a special relevance given Trump’s attempts to silence the Columbia campus protests.He added: “When the voice of a society is silenced, it ends up dying. Open societies thrive on words. Freedom of expression, of belief, the right to participate in public life empowers citizens. Losing the freedom to dissent is opening the door to tyranny.”Trump tariffs are reshaping old alliances as the global south plots its own pathRead moreSánchez is also one of the front-rank politicians trying to build alliances to stand up to Trump, convening on Wednesday with Lula and Chile’s Gabriel Boric an alliance entitled In Defence of Democracy focusing on issues such as reinforcing multilateralism, the rule of law, and cooperation against extremism and the algorithms that weaken social cohesion.But these global alliances are still in their infancy and ill-coordinated.The greater danger is that each nation-state, driven by internal politics and assessments of their economic strength, will make their own decisions on how to combat, or bow, to American power.In making that decision, each country will know the strength of Trump’s shakedown diplomacy. By mixing trade, security, or immigration into one negotiation, Trump maximises his leverage – and however much he is reviled, it is a brave country that resists.\n\nExplore more on these topics\n\n- [United Nations](https://www.theguardian.com/world/unitednations) - [Donald Trump](https://www.theguardian.com/us-news/donaldtrump) - [Trump administration](https://www.theguardian.com/us-news/trump-administration) - [US foreign policy](https://www.theguardian.com/us-news/us-foreign-policy) - [Xi Jinping](https://www.theguardian.com/world/xi-jinping) - [Vladimir Putin](https://www.theguardian.com/world/vladimir-putin) - [Benjamin Netanyahu](https://www.theguardian.com/world/benjamin-netanyahu) - [analysis](https://www.theguardian.com/tone/analysis)\n\nShareReuse this content\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "'Great regret' some European nations buying Russian oil and gas, says top EU official | World News | Sky News",
      "url": "https://news.sky.com/story/donald-trump-is-right-that-european-nations-should-stop-buying-russian-energy-says-top-eu-official-13437532?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/08/1600x900/skynews-trump-putin_6992365.jpg?20250816065303",
        "1": "https://e3.365dm.com/25/08/768x432/skynews-trump-putin_6992365.jpg?20250816065303",
        "2": "https://e3.365dm.com/25/09/768x432/skynews-new-york-eu-eu-vice-president_7030695.jpg?20250924193130",
        "3": "https://e3.365dm.com/25/09/768x432/skynews-kaja-kallas-european-commission_7030825.jpg?20250924213346",
        "4": "https://e3.365dm.com/25/09/192x108/skynews-donald-trump-world-cup_7031967.jpg?20250926095034"
      },
      "content": "'Great regret' some European nations buying Russian oil and gas, says top EU official\n\nEuropean Commission vice-president Kaja Kallas tells Sky News that Donald Trump \"has a point\" after the US leader criticised European countries buying Russian energy.\n\nThursday 25 September 2025 05:35, UK\n\nPlease use Chrome browser for a more accessible video player 1:00 'Great regret' EU member states use Russian oil\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nDonald Trump is right that European countries should stop buying Russian oil and gas, one of the EU's top officials has told Sky News.\n\nSpeaking on [The World with Yalda Hakim](https://news.sky.com/the-world-with-yalda-hakim), European Commission vice president Kaja Kallas said it was of \"great regret\" that this was still happening among some of the bloc's member states.\n\nThe commission has proposed legislation to phase out Russian imports of its oil and gas by 1 January 2028, as Brussels tries to cut its decades-old energy relations with Moscow following Vladimir Putin's invasion of Ukraine.\n\nMost European countries stopped importing Russian crude oil in 2022 and Russian fuel in 2023, but crude imports by [Hungary](https://news.sky.com/topic/hungary-6799) and [Slovakia](https://news.sky.com/topic/slovakia-6333) have continued.\n\nImage: European Commission vice-president Kaja Kallas\n\nMs Kallas, who is the EU high representative for foreign affairs and security policy, said of [Mr Trump](https://news.sky.com/topic/donald-trump-5711/1)'s energy call: \"Of course he has a point.\n\n\"We have been saying this for quite some time, that the dependency on Russian oil and gas is actually also fuelling the war.\"\n\nShe said it was of \"great regret\" that not all member states had given up on supplies from Moscow, and said there were other options.\n\n### More on Donald Trump\n\n- [Trump threatens to move World Cup games from 'unsafe' host cities](https://news.sky.com/story/trump-threatens-to-move-world-cup-games-from-unsafe-host-cities-13438416) - [Trump starts to prosecute his enemies](https://news.sky.com/story/trump-starts-to-prosecute-his-enemies-13438319) - [Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister](https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223)\n\n### Related Topics:\n\n- [Donald Trump](https://news.sky.com/topic/donald-trump-5711) - [Hungary](https://news.sky.com/topic/hungary-6799) - [NATO](https://news.sky.com/topic/nato-5921) - [Russia](https://news.sky.com/topic/russia-5803) - [Slovakia](https://news.sky.com/topic/slovakia-6333) - [Ukraine](https://news.sky.com/topic/ukraine-6556)\n\n\"Neighbours around those countries have also proposed alternatives, so we can do this,\" she said.\n\nMs Kallas, a former Estonian prime minister, does not think NATO and EU members Hungary or Slovakia should be sanctioned, but instead they should \"really build on the alternatives that neighbours are providing them to get rid of the Russian oil and gas like President Trump has asked\".\n\nImage: Trump had hoped to persuade Putin to agree a peace deal - but hasn't had any luck. Pic: Reuters\n\nOn Wednesday, Slovakia pushed back on pressure it is facing to cut back its purchases of Russian energy, saying it was ready to discuss the issue, but singled out some European states for increasing purchases from Moscow.\n\nSlovakian foreign minister Juraj Blanar said there was hypocrisy in criticising his country when liquefied natural gas purchases from Russia to Western Europe had increased by 30% over the last year.\n\n\"France, Spain, and the Netherlands... so can you see the picture is a little bit more colourful than black and white,\" he said.\n\n**Read more from Sky News:**[Zelenskyy's UN speech was a warning and a plea](https://news.sky.com/story/zelenskyys-un-speech-was-a-warning-and-a-plea-as-he-knows-trump-can-turn-on-a-dime-13437317)[Trump is 'racist, sexist and Islamophobic', says London mayor](https://news.sky.com/story/donald-trump-is-racist-sexist-and-islamophobic-says-sadiq-khan-amid-feud-with-us-president-13437207)\n\nImage: Slovakia's foreign minister Juraj Blanar (R) speaks to Russian counterpart Sergei Lavrov. Pic: AP\n\nDonald Trump has said [the US was prepared to impose energy sanctions against Russia](https://news.sky.com/story/donald-trump-urges-nato-countries-to-stop-shocking-russian-oil-purchases-to-end-ukraine-war-13429901) - but only if all NATO countries stop buying Russian oil and implement similar measures.\n\n\"I am ready to do major sanctions on Russia when all NATO nations have agreed, and started, to do the same thing, and when all NATO nations stop buying oil from Russia,\" the US president said on his Truth Social platform earlier this month.\n\n[Follow Sky News on WhatsApp Keep up with all the latest news from the UK and around the world by following Sky News](https://whatsapp.com/channel/0029Va868Fv8vd1UsF99tP1u )\n\nAnd at the UN General Assembly on Tuesday, he said: \"In the event that Russia is not ready to make a deal to end the war, then the United States is fully prepared to impose a very strong round of powerful tariffs, which would stop the bloodshed, I believe, very quickly.\"\n\nBut for the measures to be effective, he said, \"European nations, all of you gathered here, would have to join us in adopting the exact same measures.\"\n\nPlease use Chrome browser for a more accessible video player 2:56 Yalda Hakim on development between Trump and Zelenskyy\n\nEnergy revenues remain the Kremlin's single most important source of cash to finance the war effort, making oil and gas exports a central target of Western sanctions.\n\nBut officials and analysts warn that aggressive curbs on Russian crude also risk driving up global oil prices, a prospect that could strain Western economies and weaken public support for the measures.\n\nSince 2023, NATO member Turkey has been the third-largest buyer of Russian oil, after China and India, according to the Centre for Research on Energy and Clean Air.\n\n### Related Topics\n\n- [Donald Trump](https://news.sky.com/topic/donald-trump-5711) - [Hungary](https://news.sky.com/topic/hungary-6799) - [NATO](https://news.sky.com/topic/nato-5921) - [Russia](https://news.sky.com/topic/russia-5803) - [Slovakia](https://news.sky.com/topic/slovakia-6333) - [Ukraine](https://news.sky.com/topic/ukraine-6556)\n\nfooter",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Is Russia testing NATO with aerial incursions in Europe? | Aviation News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/9/25/is-russia-testing-nato-with-aerial-incursions-in-europe?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/09/reuters_68d50d36-1758793014.jpg?resize=1200%2C630",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/09/reuters_68d50d36-1758793014.jpg?resize=770%2C513&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2024/09/SOR06401-1-1727077516.jpg?resize=96%2C96&quality=80"
      },
      "content": "Is Russia testing NATO with aerial incursions in Europe? | Aviation News | Al Jazeera\n\nSeveral European countries have claimed Russian drone incursions in NATO airspace are deliberate [File: Roman Petushkov/Reuters]\n\nBy Sarah ShamimPublished On 25 Sep 202525 Sep 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nDenmark was forced to close its northern Aalborg airport on Wednesday when unidentified [drones were detected](https://www.aljazeera.com/news/2025/9/25/denmark-shuts-second-airport-in-a-week-more-unidentified-drones-spotted) in its airspace. This follows Monday’s sighting of drones close to Copenhagen’s airport. Drones were later detected near several other airports on Thursday as well.\n\nWhile the source of these drones has not been formally confirmed, the unmanned aerial vehicles (UAVs) which crossed into [Polish](https://www.aljazeera.com/news/2025/9/10/poland-downs-drones-during-airspace-intrusion-as-russia-strikes-ukraine) and [Romanian airspace](https://www.aljazeera.com/news/2025/9/14/romania-reports-drone-incursion-during-russian-attack-on-ukraine) earlier this month were identified as Russian.\n\n## Recommended Stories\n\nlist of 4 items\n\n- list 1 of 4[NATO warns Russia of airspace violations, will defend self, deter threats](https://www.aljazeera.com/news/2025/9/23/nato-warns-russia-of-airspace-violations-will-defend-self-deter-threats) - list 2 of 4[‘Ukraine is only first’: Zelenskyy warns against Putin’s expansionist goals](https://www.aljazeera.com/news/2025/9/24/ukraine-is-only-first-zelenskyy-warns-against-putins-expansionist-goals) - list 3 of 4[Denmark reports ‘hybrid attack’ as drones shutter major airport](https://www.aljazeera.com/news/2025/9/25/denmark-shuts-second-airport-in-a-week-more-unidentified-drones-spotted) - list 4 of 4[Russia-Ukraine war: List of key events, day 1,309](https://www.aljazeera.com/news/2025/9/25/russia-ukraine-war-list-of-key-events-day-1309)\n\nend of list\n\nMeanwhile, Estonia also claimed Russian aircraft entered its airspace.\n\nHere is a closer look at the sightings across Europe and whether Russia might be deliberately testing NATO boundaries.\n\n## Which countries have reported airspace incursions?\n\n### Denmark\n\nEarly on Thursday, Danish authorities reported that “more than one” drone had been spotted near Aalborg airport in the Jutland region of northern Denmark.\n\nThe airport is used for both commercial and military flights, and its closure disrupted military operations, according to the police.\n\nThe Danish police said the drone sightings in Aalborg followed a similar pattern to those that [halted flights at Copenhagen airport](https://www.aljazeera.com/news/2025/9/22/copenhagen-airport-shut-after-sighting-of-unidentified-drones) for four hours on Monday, when several large, unidentified drones were spotted near the capital’s airport.\n\n“It is too early to say what the goal of the drones is and who is the actor behind,” the Danish police told the Reuters news agency.\n\nThe Danish armed forces said they were assisting local and national police with the investigation.\n\nOn Thursday, police said the drones had left Aalborg airspace, but additional drone sightings had been reported near airports in Esbjerg, Sonderborg and Skrydstrup in western Denmark.\n\nAdvertisement\n\n“It certainly does not look like a coincidence. It looks systematic. This is what I would define as a hybrid attack,” Defence Minister Troels Lund Poulsen told reporters.\n\nPoulsen added that Denmark does not consider itself to be facing a direct military threat. He did not directly name Russia as responsible for the drones.\n\n### Poland\n\nOn September 9 and early on September 10, NATO and [Polish forces scrambled to shoot down](https://www.aljazeera.com/news/2025/9/10/poland-shoots-down-russian-drones-will-nato-enter-war-in-ukraine) Russian drones which had entered the European nation’s airspace during a Russian aerial attack on Ukraine, which shares its northwestern border with Poland.\n\nPoland temporarily shut down at least three of its airports, including Warsaw’s Chopin airport, the country’s largest, and advised people to stay at home while the operation continued.\n\n“During today’s attack by the Russian Federation on targets in Ukraine, our airspace was repeatedly violated by drones,” the Polish military’s Operational Command said in a statement.\n\nAn operation was conducted to collect debris from the drones that had been shot down.\n\nPrime Minister Donald Tusk confirmed that the drones were from Russia, saying in a televised statement: “We are dealing with a large-scale provocation … We are ready to repel such provocations. The situation is serious, and no one doubts that we must prepare for various scenarios.”\n\n### Romania\n\nThe Southeastern European country has reported debris from Russian drones falling into its territory since the war in Ukraine began in February 2022.\n\nOn September 13, it sent two F-16 jets and two Eurofighters to intercept a [Russian drone which had breached](https://www.aljazeera.com/news/2025/9/14/romania-reports-drone-incursion-during-russian-attack-on-ukraine) its airspace during a Russian attack on Ukraine, the Romanian Ministry of National Defence said. It advised citizens to take cover.\n\nThe Defence Ministry reported that the jets had chased the drone until “it disappeared from the radar” near the Romanian village of Chilia Veche, which is close to the border with Ukraine.\n\n### Estonia\n\nEstonia’s Ministry of Foreign Affairs said three Russian fighter aircraft entered its airspace on September 19.\n\nForeign Minister Margus Tsahkna said Russia had [violated Estonian airspace](https://www.aljazeera.com/news/2025/9/19/estonia-says-russian-fighter-jets-entered-airspace-in-brazen-intrusion) four times in 2025, but the incursion “involving three fighter aircraft entering our airspace, is unprecedentedly brazen”.\n\n## How has NATO responded?\n\nOn September 10, NATO Secretary-General Mark Rutte said in relation to the Polish airspace incursion: “Our air defences were activated and successfully ensured the defence of NATO territory, as they are designed to do.”\n\nMissile and defence systems from multiple NATO allies, including Dutch F-35s, Italian AWACS jets, NATO’s Multi Role Tanker Transport Capability aircraft and German Patriot defence systems, were involved in the response to the drones, Rutte reported.\n\nAdvertisement\n\nHe said NATO had convened to discuss the situation following Poland’s request for consultations under Article 4 of the NATO Treaty, which spans 14 articles. Article 4 of the treaty allows any member country to request urgent consultations with the alliance if it feels its security or territorial integrity is threatened.\n\nIt also serves as the precursor to activating Article 5, which decrees that an armed attack on one NATO member should be considered an attack on all members of the alliance.\n\n“Allies expressed solidarity with Poland and denounced Russia’s reckless behaviour,” Rutte said, adding that it is clear that the “violation” was “not an isolated incident”.\n\nNATO again met on September 23 at the request of Estonia, according to a statement released by the alliance.\n\n“Russia bears full responsibility for these actions, which are escalatory, risk miscalculation and endanger lives. They must stop,” the NATO statement said.\n\n## Is Russia ‘testing’ the West?\n\nUkrainian officials claim Russia’s incursions into other countries’ airspace are deliberate.\n\n“Putin just keeps escalating, expanding his war, and testing the West,” Andrii Sybiha, Ukraine’s foreign minister, posted on X on September 10 after the drones were spotted in Poland.\n\n> Russian drones flying into Poland during the massive attack on Ukraine show that Putin’s sense of impunity keeps growing because he was not properly punished for his previous crimes. > Putin just keeps escalating, expanding his war, and testing the West. The longer he faces no… > — Andrii Sybiha 🇺🇦 (@andrii_sybiha) September 10, 2025\n\n“The Russian military knows exactly where their drones are headed and how long they can operate in the air. Their routes are always calculated,” Ukrainian President Volodymyr Zelenskyy wrote on X on September 13 after the drones entered Romanian airspace.\n\n“It is an obvious expansion of the war by Russia – and this is exactly how they act,” he added.\n\n> Today, Romania scrambled combat aircraft because of a Russian drone in its airspace. According to current data, the drone penetrated about 10 kilometers into Romanian territory and operated in NATO airspace for around 50 minutes. Also today, Poland responded militarily to the… > — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) September 13, 2025\n\nOther NATO allies have also claimed the incursions were deliberate.\n\n“There’s definitely no reason to suspect that this was a course correction, a mistake, or anything like that,” German Defence Minister Boris Pistorius told lawmakers. “They wouldn’t have had to take this route to fly to Ukraine.”\n\nHowever experts in drone warfare say it is still possible that the incursions were not deliberate.\n\n“Are these drone incursions deliberate? I don’t believe they necessarily are,” Marina Miron, a postdoctoral researcher at King’s College London, told Al Jazeera.\n\nDrones on autopilot are programmed with specific target coordinates in their system so if they lose the GPS signal, they “do not know where to go”. “In many cases, they literally fall from the sky. They fly somewhere until they run out of fuel.”\n\nAdvertisement\n\nThe jamming of enemy drone GPS signals is a common tactic used by both Russia and Ukraine, Miron explained.\n\nRussia also uses cheap “decoy” drones called Gerbera drones, which can be easily jammed, to overwhelm Ukraine’s air defence system, she added. These were the drones that were found to have been used in the Polish incursion.\n\n## How has Russia responded to the charges?\n\nMoscow has [denied](https://www.aljazeera.com/news/2025/9/22/russia-accuses-estonia-of-airspace-incursion-falsity-to-stoke-tensions) deliberately attacking any of the European countries, instead accusing them of making false allegations to cause tensions.\n\nAfter Russian drones entered Polish airspace, the Russian Ministry of Defence said its drones had targeted military facilities in western Ukraine and that there were no plans to strike locations in Poland.\n\nKremlin spokesman Dmitry Peskov also claimed that NATO and Ukraine “accuse Russia of provocations on a daily basis, most of the time without even trying to present at least some kind of argument”.\n\n“The side that takes a serious, responsible position should not come up with such unfounded accusations,” he told the Russian news agency Tass on Tuesday.\n\nThe next day, Peskov again said the allegations that Russian drones had violated NATO airspace were “unfounded” and “we hear such exaggerated hysteria about our military pilots allegedly violating some rules and invading someone’s airspace”.\n\n## How has Trump responded to these reports?\n\nUnited States President Donald Trump has been trying to hold negotiations to bring an end to the war in Ukraine since he assumed office in January this year. A [summit](https://www.aljazeera.com/news/2025/8/16/no-deal-at-trump-putin-meeting-key-takeaways-from-alaska-summit) he held with Russian President Vladimir Putin in Alaska in August failed to produce a peace agreement, however.\n\nEarlier this month, Trump told reporters that the drones entering Polish airspace “could have been a mistake”. This earned him rebuke, and Tusk responded, saying Poland knew it was not a mistake.\n\nHe appeared to have changed his stance when asked after a meeting with Zelenskyy on the sidelines of the United Nations General Assembly (UNGA) this week whether he believed NATO countries should shoot down Russian aircraft that enter their airspace. [Trump told reporters](https://www.aljazeera.com/news/2025/9/24/russia-a-paper-tiger-how-trump-changed-his-position-on-ukraine-nato): “Yes, I do.”\n\n## What happens next?\n\nOn Friday, defence ministers from several European countries will meet to discuss establishing a “drone wall” to protect against further incursions. Denmark will join this discussion.\n\nEuropean Commission President Ursula von der Leyen also called for a drone wall earlier this month.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Home | Euractiv",
      "url": "https://www.euractiv.com/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.euractiv.com/content/uploads/sites/2/2025/09/BT1-24.jpg",
        "1": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-2224574816-1182x788.jpg",
        "2": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-2237285784-1.jpg",
        "3": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-2236932835.jpg",
        "4": "https://www.euractiv.com/content/uploads/sites/2/2025/09/BT1-3-1400x788.jpeg"
      },
      "content": "### Policy areas\n\n- Economy\n\n- Politics\n\n- Agrifood\n\n- Health\n\n- Tech\n\n- Energy, Environment & Transport\n\n- Defence\n\n- euractiv.com\n\n- euractiv.fr\n\n- euractiv.de\n\n- euractiv.gr\n\n- euractiv.pl\n\n- euractiv.cz\n\n- euractiv.sk\n\n- euractiv.it\n\n- euractiv.es\n\n## TOP STORIES\n\n#### The UNGA tour de farce\n\nOpinion\n\n##### 'Melonimania': France eyes Italy’s right-wing experiment\n\nPolitics\n\n##### Kyiv called in to help Brussels build 'drone wall' along eastern flank\n\nDefence\n\n##### Moldova braces for high-stakes vote amid Russian disinformation blitz\n\n##### Should we worry about Romania?\n\nEconomy\n\n##### Brussels bets the house on Moldova\n\n##### Trump announces new round of drug tariffs, muddying EU-US trade deal\n\nHealth\n\n##### Europe’s energy transition hinges on upscaled storage and smarter grids\n\nEnergy, Environment & Transport\n\n##### EU weighs new €140 billion Ukraine loan using Russian assets\n\n##### EU reparation loan for Ukraine ‘will never happen’, says Belgium\n\n##### Should we worry about Romania?\n\n## Opinions\n\n##### The UNGA tour de farce\n\n##### The Brief – China’s empty promises on the road to Belém\n\n##### Shoot 'em down!\n\n## Agrifood\n\n##### HARVEST: A 'hot autumn'?\n\nAgrifood\n\n##### Danish Presidency pushes for tougher rules on rare seed varieties\n\n##### EU–India traditional food deal off menu for 2025\n\n##### HARVEST: Várhelyi vs. Kafka\n\n##### Turkish Airlines inks big Boeing deal after Erdogan visits US\n\n##### India retires 'flying coffin' Soviet fighter jets and rolls out Rafales\n\n##### Germany holds firm against French fighter jet project hysterics\n\n## Across Europe\n\n##### Slovak PM Fico wins controversial vote on anti-LGBT constitutional changes\n\n##### Eurovision members to vote in November on Israeli participation\n\n##### Court gives Germany's far-right AfD until October 2026 to leave its Berlin HQ\n\n##### ‘What matters is the ending’: Early stumbles put Romania’s new president under scrutiny\n\n## Advocacy Lab content\n\n##### Europe’s energy transition hinges on upscaled storage and smarter grids\n\n##### Europe’s digital industry wants EU’s 30-year-old telecoms regulations updated\n\nTech\n\n##### Europe can’t compete without water action, warns Danish firm\n\n##### EU farmers are deploying tech fast to meet tough sustainability targets\n\n##### Trump announces new round of drug tariffs, muddying EU-US trade deal\n\n##### FIRST AID / Commission: Unhealthy food tax could bring in €2.5 billion annually\n\n##### ITRE-SANT power struggle reignites in Parliament over the Critical Medicines Act\n\n##### Europe’s energy transition hinges on upscaled storage and smarter grids\n\n##### Turkish Airlines inks big Boeing deal after Erdogan visits US\n\n##### VOLTAGE: Looming ban on Russian gas divides countries on EU accession track\n\n## Promoted content\n\n##### Squid: The Unregulated Frontier of Sustainable Fisheries\n\n##### EU Strategy for the Danube Region – Prosperity through Diversity\n\n##### Partnerships: The engine of the agrifood transition\n\n##### Beyond the Institutions: How Associations Keep Europe Connected\n\n##### Meta extends pay-or-consent ad model to the UK\n\n##### Ireland's privacy watchdog opens probe into sale of citizens' phone locations\n\n##### One single digital regulator to rule them all\n\n## Euractiv's Pro newsletters\n\n##### THE HACK: Moldova's election disinfo battleground\n\n##### FIRST AID / Commission: Unhealthy food tax could bring in €2.5 billion annually\n\n##### VOLTAGE: Looming ban on Russian gas divides countries on EU accession track\n\n##### HARVEST: A 'hot autumn'?\n\n##### FIREPOWER: Europe designs its drone wall\n\n## The Rapporteur\n\n##### Who killed the Brussels effect?\n\n##### Brussels bets the house on Moldova\n\n##### Europe's West Bank woes\n\n##### EU palms off Green Deal with Indonesia pact",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Netanyahu's jet largely avoids European airspace in unusual route to New York - ABC News",
      "url": "https://abcnews.go.com/Politics/netanyahus-jet-largely-avoids-european-airspace-unusual-route/story?id=125935906&utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://i.abcnewsfe.com/a/f995c8c5-8c53-4012-a54f-2e1bb78f800f/netanyahu-rt-jef-250925_1758820324933_hpMain_16x9.jpg?w=1600",
        "1": "https://i.abcnewsfe.com/a/f995c8c5-8c53-4012-a54f-2e1bb78f800f/netanyahu-rt-jef-250925_1758820324933_hpMain_16x9.jpg?w=992",
        "2": "https://i.abcnewsfe.com/a/0ca21c3c-ced4-498b-995d-fbc7a57fc48a/NetanyahuFlight_v01_KA_1758812627242_hpEmbed_16x9.jpg",
        "3": "https://i.abcnewsfe.com/a/d7f3bc79-3ecf-4ea4-9a8f-9482dff95ec6/netanyahu-plane-gty-jef-250925_1758820293733_hpEmbed_3x2.jpg",
        "4": "https://i.abcnewsfe.com/a/4d41f5ea-355d-408e-b680-19acec20a37d/pete-hegseth-2-gty-gmh-250925_1758816741966_hpMain_square.jpg?w=208"
      },
      "content": "# Netanyahu's jet largely avoids European airspace in unusual route to New York\n\nThe Israeli PM, traveling to the UN General Assembly, took a longer route.\n\nIsraeli Prime Minister Benjamin Netanyahu's government jet flew an unusual route from Tel Aviv to New York Thursday, largely avoiding European airspace.\n\nNetanyahu, traveling to the United Nations General Assembly, briefly flew over Greece and Italy, but then took a circuitous route across the Mediterranean, directly over the strait of Gibraltar and then across the Atlantic, according to FlightRadar24 records viewed by ABC News. The unusual route added more than two hours to the prime minister's flight time, the records show.\n\nIn previous U.S. trips, Netanyahu's jet has flown over Greece, a large swath of Italy, before crossing the entire length of France.\n\nItaly, France and Greece are all members of the International Criminal Court which has issued an arrest warrant for Netanyahu for alleged war crimes in Gaza. Netanyahu has rejected the ICC's arrest warrant and said the actions and charges are \"absurd and false.\"\n\n### MORE: Rubio and Netanyahu meet in Israel to discuss Hamas war, Gaza City operation\n\nFlightRadar24 records show the prime minister's plane routinely flying over European airspace in the last year. Israeli media reports this is the first time Netanyahu has avoided European airspace since the ICC war crimes arrest warrant was issued in 2024.\n\n\"For some governments, giving Netanyahu permission to fly over their country would be a political liability. In the past no one would have known but now with real time flight tracking on every smart phone everyone will be able to track his plane. Technology has changed diplomacy in this small way,\" said Steve Ganyard, a former Deputy Assistant Secretary of State and ABC News contributor.\n\n## Hegseth calls rare meeting of large number of generals and admirals\n\n- Sep 25, 6:01 PM\n\n## Trump announces deal to put TikTok under control of US investors\n\n- Sep 25, 4:58 PM\n\n## Former FBI Director James Comey posts video after indictment: 'I am innocent'\n\n- Sep 25, 8:59 PM\n\nNetanyahu's flight lasted 13 hours, while a commercial flight from Tel Aviv to JFK airport routinely takes just under 11 hours.\n\nThe prime minister's office did not immediately respond to ABC News' request for comment.\n\n- Israel\n\n## Sponsored Content by Taboola\n\n## Hegseth calls rare meeting of large number of generals and admirals\n\n- Sep 25, 6:01 PM\n\n## Travis Decker manhunt: Remains positively identified as fugitive father\n\n- Sep 25, 7:59 PM\n\n## Former FBI Director James Comey posts video after indictment: 'I am innocent'\n\n- Sep 25, 8:59 PM\n\n## Trump announces deal to put TikTok under control of US investors\n\n- Sep 25, 4:58 PM\n\n### ABC News Live\n\n24/7 coverage of breaking news and live events",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "High-level talks in European football about whether to ban Israel from international competitions | World News | Sky News",
      "url": "https://news.sky.com/story/high-level-talks-in-european-football-about-whether-to-ban-israel-from-international-competitions-13437606?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://e3.365dm.com/25/09/1600x900/skynews-poak-fans-greece-israel_7030906.jpg?20250925104805",
        "1": "https://e3.365dm.com/25/09/768x432/skynews-poak-fans-greece-israel_7030906.jpg?20250925104805",
        "2": "https://e3.365dm.com/25/06/75x75/skynews-rob-harris_6949702.png?20250624153932",
        "3": "https://e3.365dm.com/25/09/768x432/skynews-paok-fans-greece-israel_7030900.jpg?20250925105302",
        "4": "https://e3.365dm.com/25/09/768x432/skynews-alexandra-xanthaki_7030915.jpg?20250924230132"
      },
      "content": "High-level talks in European football about whether to ban Israel from international competitions\n\nEuropean football's governing body UEFA - along with world body FIFA - are facing increased calls to suspend Israel's national teams and club sides from international competitions.\n\nRob Harris Sports correspondent @RobHarris\n\nThursday 25 September 2025 08:02, UK\n\nPlease use Chrome browser for a more accessible video player 2:56 A group of United Nations advisory experts says sporting sanctions are now needed after a UN commission of inquiry said Israel is committing genocide in Gaza.\n\n[Why you can trust Sky News](https://news.sky.com/info/policies-and-standards)\n\nDiscussions are taking place at high levels in European football about whether Israel should be banned but no decision has been taken, Sky News understands.\n\nUEFA - along with world body FIFA - is facing growing calls to suspend [Israel](https://news.sky.com/topic/israel-5981/1)'s national teams and club sides from international competitions.\n\nA group of United Nations advisory experts says sporting sanctions are now needed after [a UN commission of inquiry](https://news.sky.com/story/un-commission-says-israel-is-committing-genocide-in-gaza-13431987) said Israel is committing genocide in [Gaza](https://news.sky.com/topic/gaza-8014/1).\n\nThose accusations are denied by Israel as it has continued to wage war on [Hamas](https://news.sky.com/topic/hamas-8015/1), two years since the October 7 2023 atrocities.\n\nOn Wednesday, fans of Greek side PAOK booed players from Israeli club Maccabi Tel Aviv at the start of their Europa League match, as they waved Palestinian flags and unveiled a big banner which read \"Show Israel the red card\".\n\nSeveral demonstrators were detained ahead of the game in Thessaloniki, which ended 0-0.\n\nImage: Alexandra Xanthaki, the UN special rapporteur for cultural rights\n\nTwo small protests took place in the northern Greek city, calling for Israeli clubs to be expelled from European competition in response to mass casualties in the war in Gaza.\n\n### More on Gaza\n\n- [Microsoft blocks some services used by Israeli military unit after investigation into mass surveillance of Palestinians](https://news.sky.com/story/microsoft-blocks-some-services-used-by-israeli-military-unit-after-investigation-into-mass-surveillance-of-palestinians-13438335) - [Trump starts to prosecute his enemies](https://news.sky.com/story/trump-starts-to-prosecute-his-enemies-13438319) - [Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister](https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223)\n\n### Related Topics:\n\n- [Gaza](https://news.sky.com/topic/gaza-8014) - [Hamas](https://news.sky.com/topic/hamas-8015) - [Israel](https://news.sky.com/topic/israel-5981)\n\nAround 120 Israeli fans were held behind a police cordon while the Maccabi team bus was escorted by police to the 28,000-seater Toumba Stadium.\n\nAlexandra Xanthaki, the UN special rapporteur for cultural rights, told Sky News: \"I think that when we talk about teams, national teams, not individual athletes, of states that are subject to valid claims of genocide… this is where this is for sure a red line.\"\n\nFIFA and UEFA have previously rejected calls to suspend Israel but have not commented on the plea from UN rapporteurs.\n\nMs Xanthaki said Aston Villa should consider refusing to play Maccabi Tel Aviv in the Europa League in November at Villa Park - echoing calls from the club's local independent MP, Ayoub Khan.\n\nHe told Sky News: \"I think Aston Villa ought to take the high moral ground and refuse to play with Maccabi. I understand they want three points but there is also this moral argument and I suspect a large number of Villa fans wouldn't really mind Aston making that decision.\"\n\nHe highlighted potential security challenges in Birmingham dealing with visiting Israel fans at a game that could attract both pro-Palestinian and pro-Israel activism.\n\nImage: Maccabi Tel Aviv fans clap their team after the end of the match. Pic: AP\n\nMr Khan said: \"My concern is around the safety of the local businesses, the local community, the local private hire drivers, bus drivers.\"\n\nMaccabi fans faced antisemitic attacks while playing in Amsterdam last year, while there were also anti-Arab chants heard.\n\nIsrael's football association declined to comment on calls for the suspension of its teams from external competitions because they have not come from footballing counterparts.\n\nBut lawyers defending Israel have been fighting attempts to exclude the country from sport.\n\n\"It's very unfortunate that there is destruction during a war, but the Israeli Football Association and Maccabi Tel Aviv are not responsible for that destruction,\" Jonathan Turner, the chief executive of UK Lawyers for Israel, told Sky News.\n\n\"It does strike Jewish people perhaps to a considerable extent because many of us recall that the Nazis started with boycotting Jews.\"\n\n**Read more from Sky News:**[Israel 'kills 22 people including nine children' in Gaza](https://news.sky.com/story/israel-kills-22-people-including-9-children-in-horrific-massacre-in-gaza-palestinian-officials-say-13437228)[What recognising a Palestinian state actually means](https://news.sky.com/story/what-does-recognising-a-palestinian-state-mean-13401523)\n\n[Follow Sky News on WhatsApp Keep up with all the latest news from the UK and around the world by following Sky News](https://whatsapp.com/channel/0029Va868Fv8vd1UsF99tP1u )\n\nOne country banned from football is Russia, since 2022 following the start of the full-scale invasion of Ukraine.\n\nThat's because of European sides refusing to play against Russians and safety concerns if they did.\n\nIt's understood that European football chiefs are now starting to hear of teams not wanting to play Israeli opposition.\n\nAnd UEFA has started to speak up against deaths in Gaza, with a \"stop killing children\" banner displayed on the pitch at the Super Cup in August.\n\nBut whether football should take a moral stand against Israel - and whether it can legally - is still being discussed.\n\n### Related Topics\n\n- [Gaza](https://news.sky.com/topic/gaza-8014) - [Hamas](https://news.sky.com/topic/hamas-8015) - [Israel](https://news.sky.com/topic/israel-5981)\n\nfooter",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "European officials fear Donald Trump is preparing to blame them for Ukraine failure",
      "url": "https://www.ft.com/content/66308c61-9296-47ac-b4a8-fca894abfd25?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F4f8fa337-25bb-4f5f-b53c-d3f38a60c86b.jpg?source=next-barrier-page",
        "1": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fbarrier-page-components.s3.eu-west-1.amazonaws.com%2Fassets%2Fimages%2Fus_election_2024%2Fhero_banner_us_election_white_house_watch.png?source=next-barrier-page"
      },
      "content": "# US Politics 2025\n\n# European officials fear Donald Trump is preparing to blame them for Ukraine failure\n\n## Try unlimited access\n\nWant a deeper look?\n\n## Explore more offers.\n\n### Standard Digital\n\nSave now on essential digital access to quality FT journalism on any device. Saving based on monthly annualised price.\n\n- Global news & analysis\n\n- Expert opinion\n\n- FT App on Android & iOS\n\n- FT Edit: Access on iOS and web\n\n- FirstFT: the day's biggest stories\n\n- 20+ curated newsletters\n\n- Follow topics & set alerts with myFT\n\n- FT Videos & Podcasts\n\n- 10 monthly gift articles to share\n\n### Print + Premium Digital\n\nGet Premium & FT Weekend Print edition for the price of Premium. Complete digital access to quality analysis and expert insights, complemented with our award-winning Weekend Print edition.\n\n- Everything in Print\n\n- Weekday Print Edition\n\n- FT Weekend\n\n- FT Digital Edition: our digitised print edition\n\n- Global news & analysis\n\n- Expert opinion\n\n- Special features\n\n- Exclusive FT analysis\n\n- Plus\n\n- Everything in Premium Digital\n\n### Print\n\nFT newspaper delivered Monday-Saturday, plus FT Digital Edition delivered to your device Monday-Saturday.\n\n- Weekday Print Edition\n\n- FT Weekend\n\n- FT Digital Edition: our digitised print edition\n\n- Global news & analysis\n\n- Expert opinion\n\n- Special features\n\n- Exclusive FT analysis\n\nCheck whether you already have access via your university or organisation.\n\nTerms & Conditions apply\n\n## Explore our full range of subscriptions.\n\n### For individuals\n\nDiscover all the plans currently available in your country\n\n### For multiple readers\n\nDigital access for organisations. Includes exclusive features and content.\n\n## Why the FT?\n\nSee why over a million readers pay to read the Financial Times.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "European soccer body UEFA moves toward vote to suspend Israel | AP News",
      "url": "https://apnews.com/article/uefa-israel-soccer-58d19d619e326e8781416cc671ba68a4?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dims.apnews.com/dims4/default/f658ec9/2147483647/strip/true/crop/2400x1350+0+125/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F48%2F2c%2F3e698fa6a096ca23f164efe40a79%2F6fcaa8fd8df749208b505284c3117e5c"
      },
      "content": "- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES 'Palestinians will not leave,' their president tells world leaders at UN in defiant, virtual speech Japanese court rejects an appeal by Australian who says she was tricked into smuggling drugs Iran has likely carried out an undeclared missile test, satellite photos analyzed by the AP show Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- 'Palestinians will not leave,' their president tells world leaders at UN in defiant, virtual speech\n\n- Japanese court rejects an appeal by Australian who says she was tricked into smuggling drugs\n\n- Iran has likely carried out an undeclared missile test, satellite photos analyzed by the AP show\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES Ryan Walters resigns as Oklahoma's top public schools official to lead conservative educators' group Woman sues Universal Orlando over injuries from same roller coaster in which man died after ride Human remains in Washington state identified as Travis Decker, wanted for killing his daughters Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- Ryan Walters resigns as Oklahoma's top public schools official to lead conservative educators' group\n\n- Woman sues Universal Orlando over injuries from same roller coaster in which man died after ride\n\n- Human remains in Washington state identified as Travis Decker, wanted for killing his daughters\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES Ex-FBI Director James Comey indicted after Trump pushes for prosecution of longtime foe Hegseth says Wounded Knee soldiers will keep their Medals of Honor Hegseth abruptly summons top military commanders to a meeting in Virginia next week Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- Ex-FBI Director James Comey indicted after Trump pushes for prosecution of longtime foe\n\n- Hegseth says Wounded Knee soldiers will keep their Medals of Honor\n\n- Hegseth abruptly summons top military commanders to a meeting in Virginia next week\n\n- Sports SECTIONS AP Top 25 NFL MLB Ryder Cup WNBA Tennis NBA NHL TOP STORIES European soccer body UEFA moves toward vote to suspend Israel Phil Mickelson is an unwanted outsider in what could have been his Ryder Cup at Bethpage Mariners fan who gave away Cal Raleigh's 60th home run ball to child gets to meet the slugger Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- European soccer body UEFA moves toward vote to suspend Israel\n\n- Phil Mickelson is an unwanted outsider in what could have been his Ryder Cup at Bethpage\n\n- Mariners fan who gave away Cal Raleigh's 60th home run ball to child gets to meet the slugger\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES The Kahlo family opens the doors of their house, inviting visitors to Frida's beloved basement Streaming is overtaking theaters for movie watchers, an AP-NORC poll finds Paul Thomas Anderson's 'One Battle After Another' brings revolution to the (very) big screen Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- The Kahlo family opens the doors of their house, inviting visitors to Frida's beloved basement\n\n- Streaming is overtaking theaters for movie watchers, an AP-NORC poll finds\n\n- Paul Thomas Anderson's 'One Battle After Another' brings revolution to the (very) big screen\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Amazon to pay $2.5 billion to settle FTC allegations it duped customers into enrolling in Prime Starbucks to close hundreds of stores, lay off 900 workers as part of turnaround plan US economy expanded at a surprising 3.8% pace in significant upgrade of second quarter growth\n\n- Amazon to pay $2.5 billion to settle FTC allegations it duped customers into enrolling in Prime\n\n- Starbucks to close hundreds of stores, lay off 900 workers as part of turnaround plan\n\n- US economy expanded at a surprising 3.8% pace in significant upgrade of second quarter growth\n\n- Science SECTIONS Space Animals The Ancient World Climate Medicine TOP STORIES First radar images from new Earth-mapping satellite showcase Maine coast and North Dakota farmland Scientists find marine life thriving on World War II explosives in the Baltic Sea\n\n- First radar images from new Earth-mapping satellite showcase Maine coast and North Dakota farmland\n\n- Scientists find marine life thriving on World War II explosives in the Baltic Sea\n\n- Fact Check\n\n- Oddities TOP STORIES Photos show Ghana's fantasy coffins as a stylish final rest Ground squirrels are taking over a North Dakota city and officials are not amused Ghana's fantasy coffins are a colorful celebration of life and legacy Swastikas still linger on some flags in Finland's air force, but are on the way out Whale surfaces, capsizes fishing boat off New Hampshire coast Giant trolls have a message for humans about protecting the planet\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Ghana's fantasy coffins are a colorful celebration of life and legacy\n\n- Swastikas still linger on some flags in Finland's air force, but are on the way out\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Be Well TOP STORIES One path to kick-starting a healthier lifestyle: Start small Lice concerns rise as children return to school. Here's what parents can do It can be hard to shift out of negative thoughts, but there are ways to stop spiraling Facing stiff competition, remote workers up their game Do you eat a meal in 20 minutes or less? It might be time to slow down The blue light isn’t the only reason it’s a bad idea to look at screens at bedtime\n\n- One path to kick-starting a healthier lifestyle: Start small\n\n- Lice concerns rise as children return to school. Here's what parents can do\n\n- It can be hard to shift out of negative thoughts, but there are ways to stop spiraling\n\n- Facing stiff competition, remote workers up their game\n\n- Do you eat a meal in 20 minutes or less? It might be time to slow down\n\n- The blue light isn’t the only reason it’s a bad idea to look at screens at bedtime\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss An AP photographer captures a masked protester undeterred by a deluge of pepper spray 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- An AP photographer captures a masked protester undeterred by a deluge of pepper spray\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES On North Carolina’s rivers and streams, the cleanup of Helene’s fury seems never-ending In front of drowning nations, Trump calls climate change a 'con job.' Here are the facts and context Humberto becomes a hurricane in the Atlantic as Gabrielle moves away from the Azores\n\n- On North Carolina’s rivers and streams, the cleanup of Helene’s fury seems never-ending\n\n- In front of drowning nations, Trump calls climate change a 'con job.' Here are the facts and context\n\n- Humberto becomes a hurricane in the Atlantic as Gabrielle moves away from the Azores\n\n- Health TOP STORIES 'Nightmare bacteria' cases are increasing in the US Trump extends Georgia health insurance program with work requirements, despite red tape findings Sexually transmitted disease cases fall, but not syphilis in newborns Trump's touting of an unproven autism drug surprised many, including the doctor who proposed it Lice concerns rise as children return to school. Here's what parents can do What we know about autism's causes and any potential link to Tylenol\n\n- 'Nightmare bacteria' cases are increasing in the US\n\n- Trump extends Georgia health insurance program with work requirements, despite red tape findings\n\n- Sexually transmitted disease cases fall, but not syphilis in newborns\n\n- Trump's touting of an unproven autism drug surprised many, including the doctor who proposed it\n\n- Lice concerns rise as children return to school. Here's what parents can do\n\n- What we know about autism's causes and any potential link to Tylenol\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES Trump signs executive order supporting proposed deal to put TikTok under US ownership YouTube to start bringing back creators banned for COVID-19 and election misinformation How a SIM farm like the one found near the UN threatens telecom networks\n\n- Trump signs executive order supporting proposed deal to put TikTok under US ownership\n\n- YouTube to start bringing back creators banned for COVID-19 and election misinformation\n\n- How a SIM farm like the one found near the UN threatens telecom networks\n\n- Lifestyle SECTIONS Food & Recipes Gardening Homes Travel Fashion Pets TOP STORIES Trump's 'tough it out' advice to expectant moms is the latest example of men opining on women's pain One path to kick-starting a healthier lifestyle: Start small A look at the best times of day for watering, planting, pruning and other garden tasks\n\n- Trump's 'tough it out' advice to expectant moms is the latest example of men opining on women's pain\n\n- One path to kick-starting a healthier lifestyle: Start small\n\n- A look at the best times of day for watering, planting, pruning and other garden tasks\n\n- Religion TOP STORIES Vatican prosecutors suffer embarrassing loss as tribunal says their appeal is inadmissible A doomsday prediction about the Rapture is spreading on TikTok For the first time, a law school has a space just for Hindus Newsletters World of Faith Comprehensive global coverage of how religion shapes our world. See All Newsletters\n\n- Vatican prosecutors suffer embarrassing loss as tribunal says their appeal is inadmissible\n\n- A doomsday prediction about the Rapture is spreading on TikTok\n\n- For the first time, a law school has a space just for Hindus\n\n- Español TOP STORIES Cuatro detenidos por el impactante crimen de tres jóvenes argentinas que sería de autoría narco Fuerte respaldo de EEUU: Milei elimina impuestos al agro en medio de turbulencias financieras Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable Detienen a 38 personas en México, entre ellas una de EEUU, que integrarían la iglesia Luz del Mundo Trump dice que no permitirá que Israel se anexe Cisjordania Debilitado tifón Ragasa avanza por el sur de China hacia Vietnam tras causar inundaciones\n\n- Cuatro detenidos por el impactante crimen de tres jóvenes argentinas que sería de autoría narco\n\n- Fuerte respaldo de EEUU: Milei elimina impuestos al agro en medio de turbulencias financieras\n\n- Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Detienen a 38 personas en México, entre ellas una de EEUU, que integrarían la iglesia Luz del Mundo\n\n- Trump dice que no permitirá que Israel se anexe Cisjordania\n\n- Debilitado tifón Ragasa avanza por el sur de China hacia Vietnam tras causar inundaciones\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- MORE World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game Sports AP Top 25 NFL MLB Ryder Cup WNBA Tennis Tennis NBA NHL Auto Racing Soccer Entertainment Movies What to Stream Television Celebrity Interviews Music Books Business Tariffs Inflation Financial Markets Financial Wellness Technology Science Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus Health Tech Artificial Intelligence Social Media Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Most watched videos Standards Quizzes Press Releases My Account AP News Code of Conduct\n\n- World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East\n\n- Israel-Hamas war\n\n- Russia-Ukraine war\n\n- Español\n\n- China\n\n- Asia Pacific\n\n- Latin America\n\n- Europe\n\n- Africa\n\n- Middle East\n\n- U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths\n\n- Immigration\n\n- Weather\n\n- Education\n\n- Transportation\n\n- Abortion\n\n- LGBTQ+\n\n- Notable Deaths\n\n- Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game\n\n- White House\n\n- Congress\n\n- U.S. Supreme Court\n\n- 2025 Election Calendar\n\n- The latest AP-NORC polls\n\n- Ground Game\n\n- Sports AP Top 25 NFL MLB Ryder Cup WNBA Tennis Tennis NBA NHL Auto Racing Soccer\n\n- AP Top 25\n\n- NFL\n\n- MLB\n\n- Ryder Cup\n\n- WNBA\n\n- Tennis Tennis\n\n- NBA\n\n- NHL\n\n- Auto Racing\n\n- Soccer\n\n- Entertainment Movies What to Stream Television Celebrity Interviews Music Books\n\n- Movies\n\n- What to Stream\n\n- Television\n\n- Celebrity Interviews\n\n- Music\n\n- Books\n\n- Business Tariffs Inflation Financial Markets Financial Wellness Technology\n\n- Tariffs\n\n- Inflation\n\n- Financial Markets\n\n- Financial Wellness\n\n- Technology\n\n- Science Space Animals The Ancient World Climate Medicine\n\n- Space\n\n- Animals\n\n- The Ancient World\n\n- Climate\n\n- Medicine\n\n- Fact Check\n\n- Oddities\n\n- Be Well\n\n- Newsletters\n\n- Photography 2024 YEAR END PHOTOS Photo Essays Photography\n\n- 2024 YEAR END PHOTOS\n\n- Photo Essays\n\n- Photography\n\n- AP Investigations\n\n- Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus\n\n- Indigenous peoples and climate\n\n- Climate Questions\n\n- Climate Migration\n\n- India Focus\n\n- Health\n\n- Tech Artificial Intelligence Social Media\n\n- Artificial Intelligence\n\n- Social Media\n\n- Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets\n\n- Food & Recipes\n\n- Gardening\n\n- Homes\n\n- Travel\n\n- Fashion\n\n- Pets\n\n- Religion\n\n- Español\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES 'Palestinians will not leave,' their president tells world leaders at UN in defiant, virtual speech Japanese court rejects an appeal by Australian who says she was tricked into smuggling drugs Iran has likely carried out an undeclared missile test, satellite photos analyzed by the AP show Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- 'Palestinians will not leave,' their president tells world leaders at UN in defiant, virtual speech\n\n- Japanese court rejects an appeal by Australian who says she was tricked into smuggling drugs\n\n- Iran has likely carried out an undeclared missile test, satellite photos analyzed by the AP show\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES Ryan Walters resigns as Oklahoma's top public schools official to lead conservative educators' group Woman sues Universal Orlando over injuries from same roller coaster in which man died after ride Human remains in Washington state identified as Travis Decker, wanted for killing his daughters Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- Ryan Walters resigns as Oklahoma's top public schools official to lead conservative educators' group\n\n- Woman sues Universal Orlando over injuries from same roller coaster in which man died after ride\n\n- Human remains in Washington state identified as Travis Decker, wanted for killing his daughters\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES Ex-FBI Director James Comey indicted after Trump pushes for prosecution of longtime foe Hegseth says Wounded Knee soldiers will keep their Medals of Honor Hegseth abruptly summons top military commanders to a meeting in Virginia next week Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- Ex-FBI Director James Comey indicted after Trump pushes for prosecution of longtime foe\n\n- Hegseth says Wounded Knee soldiers will keep their Medals of Honor\n\n- Hegseth abruptly summons top military commanders to a meeting in Virginia next week\n\n- Sports SECTIONS AP Top 25 NFL MLB Ryder Cup WNBA Tennis NBA NHL TOP STORIES European soccer body UEFA moves toward vote to suspend Israel Phil Mickelson is an unwanted outsider in what could have been his Ryder Cup at Bethpage Mariners fan who gave away Cal Raleigh's 60th home run ball to child gets to meet the slugger Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- European soccer body UEFA moves toward vote to suspend Israel\n\n- Phil Mickelson is an unwanted outsider in what could have been his Ryder Cup at Bethpage\n\n- Mariners fan who gave away Cal Raleigh's 60th home run ball to child gets to meet the slugger\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES The Kahlo family opens the doors of their house, inviting visitors to Frida's beloved basement Streaming is overtaking theaters for movie watchers, an AP-NORC poll finds Paul Thomas Anderson's 'One Battle After Another' brings revolution to the (very) big screen Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- The Kahlo family opens the doors of their house, inviting visitors to Frida's beloved basement\n\n- Streaming is overtaking theaters for movie watchers, an AP-NORC poll finds\n\n- Paul Thomas Anderson's 'One Battle After Another' brings revolution to the (very) big screen\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Amazon to pay $2.5 billion to settle FTC allegations it duped customers into enrolling in Prime Starbucks to close hundreds of stores, lay off 900 workers as part of turnaround plan US economy expanded at a surprising 3.8% pace in significant upgrade of second quarter growth\n\n- Amazon to pay $2.5 billion to settle FTC allegations it duped customers into enrolling in Prime\n\n- Starbucks to close hundreds of stores, lay off 900 workers as part of turnaround plan\n\n- US economy expanded at a surprising 3.8% pace in significant upgrade of second quarter growth\n\n- Science SECTIONS Space Animals The Ancient World Climate Medicine TOP STORIES First radar images from new Earth-mapping satellite showcase Maine coast and North Dakota farmland Scientists find marine life thriving on World War II explosives in the Baltic Sea\n\n- First radar images from new Earth-mapping satellite showcase Maine coast and North Dakota farmland\n\n- Scientists find marine life thriving on World War II explosives in the Baltic Sea\n\n- Fact Check\n\n- Oddities TOP STORIES Photos show Ghana's fantasy coffins as a stylish final rest Ground squirrels are taking over a North Dakota city and officials are not amused Ghana's fantasy coffins are a colorful celebration of life and legacy Swastikas still linger on some flags in Finland's air force, but are on the way out Whale surfaces, capsizes fishing boat off New Hampshire coast Giant trolls have a message for humans about protecting the planet\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Ghana's fantasy coffins are a colorful celebration of life and legacy\n\n- Swastikas still linger on some flags in Finland's air force, but are on the way out\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Be Well TOP STORIES One path to kick-starting a healthier lifestyle: Start small Lice concerns rise as children return to school. Here's what parents can do It can be hard to shift out of negative thoughts, but there are ways to stop spiraling Facing stiff competition, remote workers up their game Do you eat a meal in 20 minutes or less? It might be time to slow down The blue light isn’t the only reason it’s a bad idea to look at screens at bedtime\n\n- One path to kick-starting a healthier lifestyle: Start small\n\n- Lice concerns rise as children return to school. Here's what parents can do\n\n- It can be hard to shift out of negative thoughts, but there are ways to stop spiraling\n\n- Facing stiff competition, remote workers up their game\n\n- Do you eat a meal in 20 minutes or less? It might be time to slow down\n\n- The blue light isn’t the only reason it’s a bad idea to look at screens at bedtime\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss An AP photographer captures a masked protester undeterred by a deluge of pepper spray 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- An AP photographer captures a masked protester undeterred by a deluge of pepper spray\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES On North Carolina’s rivers and streams, the cleanup of Helene’s fury seems never-ending In front of drowning nations, Trump calls climate change a 'con job.' Here are the facts and context Humberto becomes a hurricane in the Atlantic as Gabrielle moves away from the Azores\n\n- On North Carolina’s rivers and streams, the cleanup of Helene’s fury seems never-ending\n\n- In front of drowning nations, Trump calls climate change a 'con job.' Here are the facts and context\n\n- Humberto becomes a hurricane in the Atlantic as Gabrielle moves away from the Azores\n\n- Health TOP STORIES 'Nightmare bacteria' cases are increasing in the US Trump extends Georgia health insurance program with work requirements, despite red tape findings Sexually transmitted disease cases fall, but not syphilis in newborns Trump's touting of an unproven autism drug surprised many, including the doctor who proposed it Lice concerns rise as children return to school. Here's what parents can do What we know about autism's causes and any potential link to Tylenol\n\n- 'Nightmare bacteria' cases are increasing in the US\n\n- Trump extends Georgia health insurance program with work requirements, despite red tape findings\n\n- Sexually transmitted disease cases fall, but not syphilis in newborns\n\n- Trump's touting of an unproven autism drug surprised many, including the doctor who proposed it\n\n- Lice concerns rise as children return to school.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Radio Free Europe/Radio Liberty",
      "url": "https://www.rferl.org/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://gdb.rferl.org/201F5541-6127-4246-9A15-0680CE9B5172_cx0_cy2_cw0_w160_r1.jpg",
        "1": "https://gdb.rferl.org/201F5541-6127-4246-9A15-0680CE9B5172_cx0_cy2_cw0_w100_r1.jpg",
        "2": "https://gdb.rferl.org/90e28610-a772-4048-75c7-08ddfa912cba_w160_r1.jpg",
        "3": "https://gdb.rferl.org/90e28610-a772-4048-75c7-08ddfa912cba_w100_r1.jpg",
        "4": "https://gdb.rferl.org/90da1e94-9a2d-49ec-e84a-08ddfa9b841d_cx0_cy4_cw0_w160_r1.jpg"
      },
      "content": "## Accessibility links\n\n- Skip to main content\n\n- Skip to main Navigation\n\n- Skip to Search\n\n##### Follow Us\n\n- Exclusive: The Russian Neo-Nazi Behind A Shadowy GRU Recruitment Campaign\n\n#### Exclusive: The Russian Neo-Nazi Behind A Shadowy GRU Recruitment Campaign\n\n- Zelenskyy Says Trump 'Supports' Ukraine's Retaliatory Strikes On Russian Energy\n\n#### Zelenskyy Says Trump 'Supports' Ukraine's Retaliatory Strikes On Russian Energy\n\n- Vance, Rubio Press Trump’s New Hard Line Against Russia’s War Effort\n\n#### Vance, Rubio Press Trump’s New Hard Line Against Russia’s War Effort\n\n- Afghans Fear Losing 'Last Hope' As Taliban Shuts Down Internet\n\n#### Afghans Fear Losing 'Last Hope' As Taliban Shuts Down Internet\n\n- Oligarch Plahotniuc Extradited Back To Moldova Days Before Pivotal Elections\n\n#### Oligarch Plahotniuc Extradited Back To Moldova Days Before Pivotal Elections\n\n## Top Stories\n\n- EU Eyes 'Drone Wall' Amid Concerns Over Russian Airspace Violations\n\n#### EU Eyes 'Drone Wall' Amid Concerns Over Russian Airspace Violations\n\n- Imprisoned Iranian Activist Rashidi Dies Amid Allegations Of Medical Neglect\n\n#### Imprisoned Iranian Activist Rashidi Dies Amid Allegations Of Medical Neglect\n\n- EU Monitoring Threats To Moldova's Elections\n\n#### EU Monitoring Threats To Moldova's Elections\n\n- Poland Reopens Belarus Border As China Moves To Protect Trade Routes\n\n#### Poland Reopens Belarus Border As China Moves To Protect Trade Routes\n\n## Don't Miss\n\n- Braving Wartime Dangers, Orthodox Jews Flock To Ukraine To Celebrate New Year\n\n#### Braving Wartime Dangers, Orthodox Jews Flock To Ukraine To Celebrate New Year\n\n- What Does Trump's Sudden Shift Mean For Russia's War On Ukraine?\n\n#### What Does Trump's Sudden Shift Mean For Russia's War On Ukraine?\n\n- How NATO Is Boosting Eastern Defenses Amid Russian Air Incursions\n\n#### How NATO Is Boosting Eastern Defenses Amid Russian Air Incursions\n\n- As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n#### As Moldova Votes, Widespread Poverty Feeds Anti-Western Narratives\n\n- Why Does Trump Want Afghanistan's Bagram Air Base Returned To US Control?\n\n#### Why Does Trump Want Afghanistan's Bagram Air Base Returned To US Control?\n\n- Congress Wants To Label Russia A Terrorism Sponsor. Will It Happen?\n\n#### Congress Wants To Label Russia A Terrorism Sponsor. Will It Happen?\n\n- As NATO Mulls Response To Trespassing Russian Warplanes, Can It Shoot Them Down?\n\n#### As NATO Mulls Response To Trespassing Russian Warplanes, Can It Shoot Them Down?\n\n- The Sakharov Prize: Who's In The Running For The EU's Top Human Rights Award?\n\n#### The Sakharov Prize: Who's In The Running For The EU's Top Human Rights Award?\n\n- Uyghur Camp Survivor Details Forced Sterilization, Torture In Xinjiang\n\n#### Uyghur Camp Survivor Details Forced Sterilization, Torture In Xinjiang\n\n- Life Under Siege: Kostyantynivka Residents Brave Russian Drones and Shelling\n\n#### Life Under Siege: Kostyantynivka Residents Brave Russian Drones and Shelling\n\n- Armenians In Uproar After Removal Of Mount Ararat From Passport Stamps\n\n#### Armenians In Uproar After Removal Of Mount Ararat From Passport Stamps\n\n- The Kremlin Wants to Cool Down The Russian Economy. Why That Could Be A Problem\n\n#### The Kremlin Wants to Cool Down The Russian Economy. Why That Could Be A Problem\n\n## Visuals\n\n- Why Does Donald Trump Want Afghanistan's Bagram Air Base Back?\n\n#### Why Does Donald Trump Want Afghanistan's Bagram Air Base Back?\n\n- Russia Strikes 3 Ukrainian Regions As Ukraine Hits Russian Refinery\n\n#### Russia Strikes 3 Ukrainian Regions As Ukraine Hits Russian Refinery\n\n- Almost Surrounded By Russian Forces, Residents Of Kostyantynivka Hold Out\n\n#### Almost Surrounded By Russian Forces, Residents Of Kostyantynivka Hold Out\n\n- Mount Ararat, A Treasured Symbol For Armenians, To Disappear From Passport Stamps\n\n#### Mount Ararat, A Treasured Symbol For Armenians, To Disappear From Passport Stamps\n\n- Ukrainian Survivors Evacuated From Village Where Russian Strike Killed 25 Pensioners\n\n#### Ukrainian Survivors Evacuated From Village Where Russian Strike Killed 25 Pensioners\n\n- Afghan Children In Pakistan Fear Taliban Schools If Forced Home\n\n#### Afghan Children In Pakistan Fear Taliban Schools If Forced Home\n\n- RFE/RL Journalist Ihar Losik Released By Belarus After 5 Years In Detention\n\n#### RFE/RL Journalist Ihar Losik Released By Belarus After 5 Years In Detention\n\n- Newly Freed Belarusian Prisoners Shed Tears At Emotional News Conference\n\n#### Newly Freed Belarusian Prisoners Shed Tears At Emotional News Conference\n\n- On The Front Line, Ukrainian Drone Crew Hunts Russian Troops\n\n#### On The Front Line, Ukrainian Drone Crew Hunts Russian Troops\n\n- Polish Emergency Teams Respond To Russian Drone Damage At Farm\n\n#### Polish Emergency Teams Respond To Russian Drone Damage At Farm\n\n- Georgian Opposition Protesters Gather Without Incident A Day After Violent Clashes\n\n#### Georgian Opposition Protesters Gather Without Incident A Day After Violent Clashes\n\n- Afghan Teen Returns To Village To Find His Family Killed\n\n#### Afghan Teen Returns To Village To Find His Family Killed\n\n- Ukrainian Amputee Veteran Finds Solace In Caring For Dogs\n\n#### Ukrainian Amputee Veteran Finds Solace In Caring For Dogs\n\n- Sister Of Jailed Activist Kalesnikava Sees Pivotal Moment For Belarusian Prisoners\n\n#### Sister Of Jailed Activist Kalesnikava Sees Pivotal Moment For Belarusian Prisoners\n\n- Ukrainian Soldier Tells Of Being Left For Dead By Russian Captors\n\n#### Ukrainian Soldier Tells Of Being Left For Dead By Russian Captors\n\n- As Drones Close In, Civilians Flee Kostyantynivka With Humanitarian Help\n\n#### As Drones Close In, Civilians Flee Kostyantynivka With Humanitarian Help\n\n- Touring Europe, Ukrainian Orchestra 'Fights On The Cultural Front'\n\n#### Touring Europe, Ukrainian Orchestra 'Fights On The Cultural Front'\n\n- Captured Russian Soldiers Report Heavy Losses As Ukraine Repels Breach Near Dobropillya\n\n#### Captured Russian Soldiers Report Heavy Losses As Ukraine Repels Breach Near Dobropillya\n\n- How Ukraine Fires Nets To Catch Russian Drones\n\n#### How Ukraine Fires Nets To Catch Russian Drones\n\n## Beyond Our Borders\n\n- Silicon Valley Embraces US Defense Tech Amid Rising Global Conflicts\n\n#### Silicon Valley Embraces US Defense Tech Amid Rising Global Conflicts\n\n- China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n- 50 Years After The Helsinki Final Act, Can The OSCE Stay Relevant?\n\n#### 50 Years After The Helsinki Final Act, Can The OSCE Stay Relevant?\n\n- Trump Signs Order To Label Countries Wrongfully Holding US Citizens As Terror Sponsors\n\n#### Trump Signs Order To Label Countries Wrongfully Holding US Citizens As Terror Sponsors\n\n- Wider Europe Wider Europe Briefing: What Is NATO's Operation Eastern Sentry? Russia China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n- Wider Europe Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n#### Wider Europe Briefing: What Is NATO's Operation Eastern Sentry?\n\n- Russia China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n#### China's Defense Universities Help Russia Offset Sanctions And Export Controls, New Research Shows\n\n## Most Popular Stories\n\n#### Ukraine Pounds Major Russian Oil Refineries As Fuel Shortages Reported\n\n#### As NATO Mulls Response To Trespassing Russian Warplanes, Can It Shoot Them Down?\n\n#### What Does Trump's Sudden Shift Mean For Russia's War On Ukraine?\n\n#### How NATO Is Boosting Eastern Defenses Amid Russian Air Incursions\n\n#### Vance, Rubio Press Trump’s New Hard Line Against Russia’s War Effort\n\n## Follow Us\n\n## RFE/RL Investigates\n\n- A Toxic Trail Exposed: How Russia Makes Chemical Weapons And Uses Them Against Ukraine\n\n#### A Toxic Trail Exposed: How Russia Makes Chemical Weapons And Uses Them Against Ukraine\n\n- Satellite Images Appear To Show Secretive Construction Of 'Strategic' Base In Belarus\n\n#### Satellite Images Appear To Show Secretive Construction Of 'Strategic' Base In Belarus\n\n- Europe Faces Critical Challenges in Countering Russian Drone Threats\n\n#### Europe Faces Critical Challenges in Countering Russian Drone Threats",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Asian shares tumble after Trump says he will impose new tariffs on drugs and other goods | The Independent",
      "url": "https://www.independent.co.uk/news/donald-trump-united-states-asian-manila-philippines-b2834077.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.independent.co.uk/2025/09/24/04/Financial_Markets_Wall_Street_81398.jpg?width=1200&height=800&crop=1200:800"
      },
      "content": "Asian shares fell on Friday after President Donald Trump announced plans for new tariffs including 100% import taxes on pharmaceutical drugs starting Oct. 1.Trump said Thursday on his social media site that foreign makers of furniture and cabinetry were flooding the United States with their products and that tariffs must be applied “for National Security and other reasons.” He said foreign-made heavy trucks and parts are hurting domestic producers. However, most such trucks are either made in America or are U.S. brands made in Canada or Mexico.U.S. futures slipped while oil prices rose. Most Asian indexes were in the red, with Japan's Nikkei 225 down around 0.3% to 45,629.79. Sumitomo Pharma Co.'s shares lost 5.2% while Chugai Pharmaceutical sank 3.9%.Government data on Friday showed inflation in the Tokyo area rose 2.5% year-on-year in September, matching the pace in August but falling below expectations of an uptick to 2.8%. Inflation, however, was still above the Bank of Japan’s 2% target, leading to speculation about a rate hike later this year.South Korea's Kospi tumbled 2.5% to 3,384.58 in a third consecutive session of losses amid growing worries over prolonged tariff negotiations with the U.S. In Chinese markets, Hong Kong's Hang Seng index fell 0.7% to 26,313.66 while the Shanghai Composite index was down 0.1% to 3,850.07.Australia's S&P/ASX 200 rose 0.2% to 8,790.20. India's BSE Sensex fell 0.7% while Taiwan's Taiex lost 1.5%.On Thursday, Wall Street stumbled to a third straight loss as U.S. stocks gave back more of their big gains for the year so far.The S&P 500 fell 0.5% to 6,604.72, marking its longest losing streak in more than a month. The Dow Jones Industrial Average dropped 0.4% to 45,947.32, and the Nasdaq composite sank 0.5% to 22,384.70. All three indexes are still near their records set at the start of the week. Stocks felt pressure from reports showing the U.S. economy may be stronger than economists thought. While that’s encouraging news for workers and for people looking for jobs, it could make the Federal Reserve less likely to cut interest rates several times in the coming months. The Fed just delivered its first cut of the year last week, and officials had penciled in more through the end of next year. That was critical for Wall Street after U.S. stocks shot to records since April in large part because of expectations for rate cuts. Easier rates can boost the economy and make investors more willing to pay high prices for stocks and other investments.If the Fed doesn’t cut rates as often as investors expect, it would empower criticism that the U.S. stock market is too expensive after rising so much, so quickly. Treasury yields ticked higher in the bond market as traders pared bets for the number of upcoming cuts to rates by the Fed. The yield on the 10-year Treasury rose to 4.17% from 4.16% late Wednesday.“For Asia today, it means traders wake up to a market where gravity has reasserted itself. The global $15 trillion rebound year-to-date now feels stretched against yields rising even for all the ‘right’ reasons( stronger growth),\" Stephen Innes of SPI Asset Management wrote in a commentary. “It doesn’t take much for enthusiasm to wobble, at lofty peaks, and in this tape, fatigue is dangerous.” In other dealings early Friday, benchmark U.S. crude added 30 cents to $65.28 per barrel. Brent crude, the international standard, climbed 25 cents to $69.67 per barrel.The U.S. dollar edged down to 149.73 Japanese yen, from 149.75 yen. The euro rose to $1.1676 from $1.667. ___AP Business Writer Stan Choe contributed.",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Asia - Latest News",
      "url": "https://www.breitbart.com/asia/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://media.breitbart.com/media/2025/09/GettyImages2233529211-640x480.jpg",
        "1": "https://media.breitbart.com/media/2025/09/AP25268608243517-420x315.jpg",
        "2": "https://media.breitbart.com/media/2025/09/Together-420x315.jpg",
        "3": "https://media.breitbart.com/media/2025/09/Screen-Shot-2025-09-25-at-5.28.17-AM-420x315.png",
        "4": "https://media.breitbart.com/media/2025/09/GettyImages-2236481369-420x315.png"
      },
      "content": "# Asia - Latest News\n\nReport: Chinese Drone Experts Worked with Sanctioned Russian Arms Company\n\nReuters reported on Thursday that Chinese drone experts have visited Russia to work on military drones for IEMZ Kupol, a weapons manufacturer owned by the Russian government that was placed under sanctions by the U.S. government in 2023.\n\nJohn Hayward\n\nAzerbaijan Thanks Trump for Brokering Peace with Armenia in U.N. Address\n\nJohn Hayward\n\n‘Together’ Pulled from Chinese Theaters After AI Used to Make a Gay Wedding a Heterosexual One\n\nPaul Bois\n\nIndonesian President Prabowo Subianto Calls for Peace with Israel at UN\n\nJoel B. Pollak\n\nCongressmen Led by Dem Adam Smith Meet with Chinese Defense Minister After Threat to Attack Taiwan\n\nFrances Martel\n\nLeftist South Korean President Cheers Demise of Impeached Conservative Predecessor at U.N.\n\nJohn Hayward\n\nChina-Friendly Canadian PM Mark Carney Uses U.N. Visit to Cozy Up to Beijing\n\nCanadian Prime Minister Mark Carney met with Chinese Premier Li Qiang on the sidelines of the U.N. General Assembly (UNGA) in New York City on Tuesday.\n\nJohn Hayward26 Sep 2025, 6:55 AM PDT\n\nReport: Chinese Drone Experts Worked with Sanctioned Russian Arms Company\n\nReuters reported on Thursday that Chinese drone experts have visited Russia to work on military drones for IEMZ Kupol, a weapons manufacturer owned by the Russian government that was placed under sanctions by the U.S. government in 2023.\n\nJohn Hayward25 Sep 2025, 4:18 PM PDT\n\nAzerbaijan Thanks Trump for Brokering Peace with Armenia in U.N. Address\n\nPresident Ilham Aliyev of Azerbaijan spent much of his address to the U.N. General Assembly (UNGA) in New York City on Thursday celebrating victory in a great “patriotic war” against Armenia, which he accused of illegally occupying territory which Azerbaijan had to retake by force.\n\nJohn Hayward25 Sep 2025, 12:50 PM PDT\n\n‘Together’ Pulled from Chinese Theaters After AI Used to Make a Gay Wedding a Heterosexual One\n\nNeon has pulled its body horror film “Together” from theaters in China after a local distributor censored a same-sex wedding scene.\n\nPaul Bois25 Sep 2025, 11:56 AM PDT\n\nIndonesian President Prabowo Subianto Calls for Peace with Israel at UN\n\nIndonesian President Prabowo Subianto, who leads the world’s most populous Muslim nation, surprised observers by calling for peace and security for the Jewish state of Israel in his speech Wednesday at the opening of the United Nations General Assembly in New York.\n\nJoel B. Pollak25 Sep 2025, 2:30 AM PDT\n\nXi Jinping Visits Uyghur Genocide Region to Celebrate 70th Anniversary of Conquest\n\nChinese dictator Xi Jinping made a rare visit to Xinjiang province to celebrate the 70th anniversary of Chinese conquest.\n\nJohn Hayward24 Sep 2025, 1:40 PM PDT\n\nCongressmen Led by Dem Adam Smith Meet with Chinese Defense Minister After Threat to Attack Taiwan\n\nA House of Representatives delegation led by Rep. Adam Smith (D-WA) arrived this weekend in Beijing, China, and held a rare in-person meeting with Chinese Defense Minister Dong Jun on Monday.\n\nFrances Martel24 Sep 2025, 6:11 AM PDT\n\nLeftist South Korean President Cheers Demise of Impeached Conservative Predecessor at U.N.\n\nSouth Korean President Lee Jae-myung told the U.N. General Assembly on Tuesday that the eighty-year history of the Republic of Korea was proof that the United Nations can bring positive change to the world.\n\nJohn Hayward23 Sep 2025, 1:08 PM PDT\n\nHayward: What BRICS Has to Lose at this Year’s U.N. General Assembly\n\nThe 2025 U.N. General Assembly (UNGA) will likely be dominated by the drama over European states unilaterally declaring Palestinian independence, but it will also be an important week for the BRICS economic collective, which has positioned itself as an alternative to the post-World War II international order led by the United States and Europe.\n\nJohn Hayward22 Sep 2025, 5:22 PM PDT\n\nPrime Minister Modi Urges Indians to ‘Get Rid’ of ‘Foreign-Made Products’\n\nIndian Prime Minister Narendra Modi gave an address to the nation on Sunday in which he told his citizens to stop using “foreign made” products.\n\nJohn Hayward22 Sep 2025, 1:02 PM PDT\n\nIndonesia ‘Free School Lunch’ Program Leads to Mass Poisoning\n\nHealth experts on Monday urged the Indonesian government to suspend its program of free school meals after hundreds of children became sick from eating tainted food.\n\nJohn Hayward22 Sep 2025, 10:22 AM PDT\n\nVladimir Putin Opens Russia’s Eurovision Knockoff, ‘Intervision,’ Declaring Music Has ‘No Borders’\n\nVietnamese performer Duc Phuc won the Moscow-hosted “Intervision Song Contest” this weekend, a revival of a Cold War-era alternative to the Eurovision Song Contest that strongman Vladimir Putin hailed as a display of “respect for traditional values” and “diversity.”\n\nFrances Martel22 Sep 2025, 8:53 AM PDT\n\nNorth Korea’s Kim Has ‘Good Memories’ of Trump, Is Ready to Discuss Everything Except Nukes\n\nNorth Korea’s Kim Jong-un says he has “good personal memories” of talks with President Trump, but will not discuss denuclearization.\n\nJohn Hayward22 Sep 2025, 8:42 AM PDT\n\nExclusive: The CEO Who Wants to Make Her Bank the U.S. Gateway to Central Asia\n\nWashington, D.C. –When Umut Abakirova graduated from the American University of Central Asia, she began her career as a loan officer. Two decades later, she is one of Central Asia’s most prominent women in finance: chief executive of Bakai Bank, one of the Kyrgyz Republic’s largest private lenders.\n\nJohn Carney22 Sep 2025, 6:22 AM PDT\n\nPakistan Says Defense Pact with Saudi Arabia May Include Nuclear Program\n\nPakistani Defense Minister Khawaja Mohammad Asif on Thursday answered a lingering question about the new defense pact between his country and Saudi Arabia by confirming that Pakistan’s nuclear arsenal is covered by the agreement.\n\nJohn Hayward19 Sep 2025, 4:33 PM PDT\n\nReport: Chinese Defense Universities Help Russia Evade Sanctions\n\nThe Australian Strategic Policy Institute finds Chinese and Russian defense universities are cooperating in a way that evades sanctions.\n\nJohn Hayward19 Sep 2025, 2:53 PM PDT\n\nTaliban Rejects Trump Call to Retake Bagram Air Base\n\nA senior Taliban terrorist responded to President Donald Trump announcing on Thursday that he was working to reclaim Afghanistan’s Bagram military base by rejecting the possibility of a renewed U.S. military presence in the country.\n\nFrances Martel19 Sep 2025, 2:41 PM PDT\n\nTaliban’s Friends Pressure U.N. to Accept Jihadis at Security Council\n\nAt a U.N. Security Council (UNSC) meeting on Wednesday, several countries that share ideological interests with the Taliban, or have financial interests in Afghanistan, urged the council to “engage” with the junta despite its absolute refusal to comply with U.N. human rights standards.\n\nJohn Hayward19 Sep 2025, 2:24 PM PDT\n\n‘We Oppose Spreading False Info,’ China Says After Blaming MAGA for Charlie Kirk Assassination\n\nChinese Foreign Ministry spokesman Lin Jian on Thursday testily denied that China is spreading disinformation about the assassination of American conservative Charlie Kirk, even though Chinese, Russian, and Iranian state media have been caught doing exactly that.\n\nJohn Hayward19 Sep 2025, 11:45 AM PDT\n\nTrump Announces State Visit to China in 2026 After Call with Xi\n\nAfter a phone call with Chinese President Xi Jinping, President Donald Trump said he will visit China early next year and Xi will visit the U.S. at “an appropriate time.”\n\nNick Gilbertson19 Sep 2025, 11:32 AM PDT\n\nTaliban Attacks U.N. Secretary-General for ‘Ignorance of Sharia’\n\nThe Taliban junta in Afghanistan on Thursday condemned U.N. Secretary-General Antonio Guterres for denouncing its brutish treatment of women, claiming Guterres lacks the required credentials in Islamic sharia law to comment on the Taliban’s conduct.\n\nJohn Hayward19 Sep 2025, 8:14 AM PDT\n\nExclusive— Ambassador Alexander Tah-Ray Yui: Taiwan Is an Invaluable Partner to the United States\n\nTaiwan is a steadfast friend of the United States that fully shares President Trump’s vision of reindustrializing the U.S. and ensuring stability in the Indo-Pacific.\n\nAlexander Tah-Ray Yui19 Sep 2025, 6:00 AM PDT\n\nSouth Korea Arrests Pastor Who Met Charlie Kirk Week Before Assassination for Prayer, Video Upload\n\nSouth Korean Pastor Son Hyun-bo, a conservative activist in addition to religious leader, was arrested on September 8 for allegedly violating election law with a YouTube video and unauthorized prayer service.\n\nFrances Martel18 Sep 2025, 3:46 PM PDT\n\nTrump Names Afghanistan, India, China, and 20 Other Nations Illegal Drug Threats\n\nPresident Donald Trump submitted a “Presidential Determination” document to Congress on Monday that identified 23 nations – including Afghanistan, India, China, Venezuela, and Pakistan – as major producers of illegal drugs, or important transit points on the drug supply pipeline.\n\nJohn Hayward18 Sep 2025, 3:20 PM PDT\n\nChinese Defense Minister: Beijing ‘Always Ready’ to Attack Taiwan\n\nChinese Defense Minister Dong Jun delivered his first high-profile public address in months on Thursday, emphasizing the Communist Party’s resolve to destroy Taiwanese sovereignty.\n\nFrances Martel18 Sep 2025, 8:42 AM PDT\n\nIndia Praises ‘Positive’ and ‘Forward-Looking’ Trade Talks with U.S.\n\nThe Indian Ministry of Commerce and Industry said on Tuesday that trade discussions with a U.S. delegation to New Delhi were “positive” and “forward-looking.”\n\nJohn Hayward18 Sep 2025, 8:21 AM PDT\n\nReps. Luna, Comer Urge Treasury to Freeze Assets of CCP-Linked Billionaire Neville Singham\n\nHouse Oversight Committee Chairman James Comer (R-KY) and Rep. Anna Paulina Luna (R-FL) called on Treasury Secretary Scott Bessent to freeze the assets of billionaire Neville Roy Singham, citing allegations that the U.S. citizen living in China has funneled millions into extremist groups with ties to the Chinese Communist Party (CCP) and foreign terrorist organizations.\n\nJasmyn Jordan17 Sep 2025, 7:00 PM PDT\n\nHayward: Chinese State Media Cites CNN, Calls Charlie Kirk ‘Radical Right Wing,’ Assassin Was ‘from a MAGA Family’\n\nChinese state media attempted to portray the “radical right wing” as the real threat looming in the wake of the assassination of conservative activist Charlie Kirk in a Tuesday editorial from the state-run Global Times, depicting alleged killer Tyler Robinson as a product of the right.\n\nJohn Hayward17 Sep 2025, 9:20 AM PDT\n\nU.S. Tennis Star Apologizes for Criticizing Chinese Food\n\nU.S. Tennis star Taylor Townsend has apologized to China after her social media joke about Chinese food backfired.\n\nWarner Todd Huston17 Sep 2025, 8:38 AM PDT\n\nEuropean Union Says No Closer Ties With India Because of Russian Oil Purchases\n\nIndia’s participation in military exercises with Moscow and its purchases of Russian oil “stand in the way of closer ties” with the EU.\n\nBreitbart London17 Sep 2025, 8:16 AM PDT\n\nRFK Jr. Targets China in Vape Crackdown: ‘The Chinese Are Getting Richer While Our Children Get Sicker’\n\nHealth and Human Services (HHS) Secretary Robert F. Kennedy Jr. announced that federal agents had carried out nationwide raids to seize Chinese-made vape products, warning that such operations mark the beginning of a broader crackdown.\n\nJasmyn Jordan16 Sep 2025, 3:26 PM PDT\n\nChina Attacks Philippine Ships with Water Cannons in South China Sea\n\nThe Chinese Coast Guard said on Tuesday that it fired water cannons at Filipino ships near the Scarborough Shoal, a feature China is attempting to seize by force in defiance of international law.\n\nJohn Hayward16 Sep 2025, 3:06 PM PDT\n\nBill O’Reilly to Peter Schweizer: I Told Beijing Officials to Their Faces ‘Get out of the Fentanyl Business’\n\n“Evil is on the rise in America, and overseas,” says author and talk show host Bill O’Reilly. “Evil is very simple: It’s when one human being hurts another human being on purpose with no remorse.”\n\nBreitbart News16 Sep 2025, 1:50 PM PDT\n\nChina Asks Europe to Join Forces Against Trump Tariffs\n\nChinese Foreign Minister Wang Yi said during a trip to Poland on Monday that European powers should join forces with his Communist dictatorship to “oppose the arbitrary tariffs” imposed by President Donald Trump, because they “violate international trade rules and harm the legitimate interests of all countries.”\n\nJohn Hayward16 Sep 2025, 9:38 AM PDT\n\nTaliban Try to Butter Up Trump: ‘No Serious Obstacles’ to Ties with U.S.\n\nSenior Taliban officials emphasized a desire for normal relations with the United States during a visit from a White House delegation.\n\nFrances Martel16 Sep 2025, 8:42 AM PDT\n\n‘Gen Z’ Protesters Storm Communist HQ in Nepal, Throw Down Hammer and Sickle Flag\n\nThe young protesters who overthrew the government of Communist Party leader K.P. Sharma Oli last week also made a point of storming the Communist Party headquarters and throwing down its infamous hammer and sickle flag.\n\nJohn Hayward15 Sep 2025, 6:40 PM PDT\n\nPhotos: Mourners Around the World Show Love for Charlie Kirk\n\nVigils were held around the world for slain free speech advocate and Turning Point USA cofounder Charlie Kirk.\n\nJohn Hayward15 Sep 2025, 12:22 PM PDT\n\nWoke Leftists Attempt to Cancel Christian K-Pop Megastar Siwon Choi for Mourning Charlie Kirk\n\nSouth Korean artist Choi Siwon of the boy band Super Junior faced a torrent of anger and calls for his firing over the weekend after publishing an Instagram story featuring an image mourning American conservative commentator and organizer Charlie Kirk.\n\nFrances Martel15 Sep 2025, 10:27 AM PDT\n\nExclusive: Treasury Secretary Bessent on How the U.S. Got China to Agree to the TikTok Deal\n\nFor Beijing, the decisive moment came when Trump’s threat proved real. “If there hadn’t been a deal,” Bessent said, “then TikTok would’ve gone dark in 48 hours.”\n\nJohn Carney15 Sep 2025, 9:03 AM PDT\n\nUK Drops Charges Against Men Accused of Spying For China\n\nTwo men accused of spying for China in Britain including a former researcher working in the U.K. Parliament will no longer face prosecution.\n\nBreitbart London15 Sep 2025, 8:42 AM PDT",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Asian markets drop as US data, new tariff threats dent sentiment - CNA",
      "url": "https://www.channelnewsasia.com/business/asian-markets-drop-us-data-new-tariff-threats-dent-sentiment-5370851?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dam.mediacorp.sg/image/upload/s--sfGhXHHz--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2025/04/30/2025-04-22t020028z_152856297_rc27qdaxkyho_rtrmadp_3_china-stocks-patriotism.jpg?itok=XcJxDPnF",
        "1": "https://dam.mediacorp.sg/image/upload/s--sfGhXHHz--/c_fill,g_auto,h_338,w_600/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2025/04/30/2025-04-22t020028z_152856297_rc27qdaxkyho_rtrmadp_3_china-stocks-patriotism.jpg?itok=XcJxDPnF",
        "2": "https://dam.mediacorp.sg/image/upload/s--FYvCgivL--/c_fill,g_auto,h_468,w_830/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2025/04/30/2025-04-22t020028z_152856297_rc27qdaxkyho_rtrmadp_3_china-stocks-patriotism.jpg?itok=XMuHqnZq",
        "3": "https://dam.mediacorp.sg/image/upload/s--yopjFdrX--/f_auto,q_auto/v1/mediacorp/cna/image/2025/02/05/week-in-review.png?itok=iJfu2WzP",
        "4": "https://dam.mediacorp.sg/image/upload/s--tFtkeWG---/c_fill,g_auto,h_128,w_188/f_auto,q_auto/v1/mediacorp/cna/image/2025/02/05/week-in-review.png?itok=yaLsroXW"
      },
      "content": "[Business](https://www.channelnewsasia.com/business)\n\n# Asian markets drop as US data, new tariff threats dent sentiment\n\nAn electronic board shows Shanghai and Shenzhen stock indices as people walk on a pedestrian bridge at the Lujiazui financial district in Shanghai, China on Apr 3, 2025. (File photo: Reuters/Go Nakamura)\n\n26 Sep 2025 01:39PM (Updated: 26 Sep 2025 05:41PM)\n\nRead a summary of this article on FAST. Get bite-sized news via a newcards interface. Give it a try. Click here to return to FAST Tap here to return to FAST FAST\n\nHONG KONG: Markets retreated on Friday (Sep 26) as nagging uncertainty about the US interest rate outlook was compounded by data showing the world's biggest economy faring much better than expected and fresh tariff warnings from President Donald Trump.\n\nAsian investors looked set to end a largely disappointing week on a negative note following the third loss in a row for Wall Street, with concerns that stocks are overvalued after a lengthy rally adding to the mix.\n\nTraders are also keeping a wary eye on Washington as lawmakers bicker over a funding package to keep the government running as a deadline approaches next week.\n\nEquity markets are seeing a pullback in buying after a months-long advance from April's lows. The Federal Reserve cut rates last week, citing a weakening labour market but warning that more reductions were not nailed on.\n\nOn top of that, the past week has seen top decision-makers at the bank offer varying views on the way forward, in light of stubbornly high inflation and soft jobs data, as well as concerns about the impact of Trump's tariffs.\n\nData on Thursday showed second-quarter US economic growth hit 3.8 per cent - instead of the 3.3 per cent first thought - as consumers spent more than expected. The reading marks the fastest quarterly expansion for nearly two years.\n\nThe figures came ahead of Friday's release of the Fed's preferred gauge of inflation - the personal consumption expenditure (PCE) index - and next week's nonfarm payrolls report.\n\nAll three main indexes on Wall Street ended in the red, falling each day since hitting record highs on Monday.\n\nTokyo, Hong Kong, Shanghai, Seoul, Wellington, Taipei, Mumbai, Singapore, Bangkok and Manila retreated, with Sydney and Jakarta edging up.\n\nThe dollar held gains after surging on the growth figures.\n\n## PHARMA TAKES A HIT\n\nSentiment was also weighed by Trump's new tariffs on pharmaceuticals, big-rig trucks, home renovation fixtures and furniture.\n\nFrom next Wednesday, \"we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product, unless a Company IS BUILDING their Pharmaceutical Manufacturing Plant in America\", Trump wrote on his Truth Social platform.\n\nHe also threatened 25 per cent levies on \"all 'Heavy (Big) Trucks' made in other parts of the world\", for reasons including \"National Security\".\n\nAsian pharma firms retreated, with Shanghai Fosun shedding around 6 per cent and South Korea's Daewoong off more than 3 per cent. Japan's Daiichi Sankyo and Astellas Pharma were also well in the red. Sydney-listed CSL shed nearly 2 per cent.\n\nSun Pharmaceutical Industries was a major loser in India's Nifty 50 index and was down 3 per cent, with other pharmaceutical stocks Cipla, Dr Reddy's Laboratories, Lupin and Biocon all lower.\n\nKey industry player India \"could be spared\" from the levies for now, according to MUFG analyst Michael Wan.\n\n\"It is still unclear how branded or patented pharmaceutical products will be defined, but our working assumption is that this will not incorporate generic drugs and pharmaceuticals shipped by the likes of India to the US,\" he wrote in a note.\n\nA lack of agreement in Washington on a bill to avert a government shutdown was also on traders' radar, with Democrats and Trump's Republicans at loggerheads over the spending plans.\n\n\"Republicans are seeking short-term extensions to funding at current levels, while Democrats have demanded more healthcare spending,\" National Australia Bank's Taylor Nugent said.\n\n\"There remains no obvious exit ramp as the Oct 1 deadline to avoid a US government shutdown approaches,\" he said.\n\nLondon, Paris and Frankfurt all rose.\n\nSource: AFP/fh\n\nNewsletter\n\n## Week in Review\n\nSubscribe to our Chief Editor’s Week in Review\n\nOur chief editor shares analysis and picks of the week's biggest news every Saturday.\n\nNewsletter\n\n## Morning Brief\n\nSubscribe to CNA’s Morning Brief\n\nAn automated curation of our top stories to start your day.\n\n## Sign up for our newsletters\n\nGet our pick of top stories and thought-provoking articles in your inbox\n\nSubscribe here\n\n## Get the CNA app\n\nStay updated with notifications for breaking news and our best stories\n\nDownload here\n\nGet WhatsApp alerts Join our channel for the top reads for the day on your preferred chat app Join here\n\n#### Related Topics\n\nstock market\n\n## Also worth reading\n\nContent is loading...\n\nExpand to read the full story\n\nGet bite-sized news via a newcards interface. Give it a try. Click here to return to FAST Tap here to return to FAST [FAST](https://www.channelnewsasia.com/fast)",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Asian markets drop as Trump unveils new tariffs: Pharmaceutical and Biotech stocks hit; oil, gold prices climb - The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/international-business/asian-markets-drop-as-trump-unveils-new-tariffs-pharmaceutical-and-biotech-stocks-hit-oil-gold-prices-climb/articleshow/124147209.cms?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124147596,width-1070,height-580,imgsize-1490165,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/msid-124147596,imgsize-1490165,width-400,resizemode-4/1-20.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-111036,msid-124144855,width-375,resizemode-4/124144855.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-32240,msid-124091702,width-375,resizemode-4/124091702.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-2584388,msid-124136338,width-375,resizemode-4/124136338.jpg"
      },
      "content": "# Asian markets drop as Trump unveils new tariffs: Pharmaceutical and Biotech stocks hit; oil, gold prices climb\n\nAsian markets opened cautiously on Friday after US President\n\nDonald Trump\n\nannounced a fresh set of tariffs, while investors lowered expectations for significant Federal Reserve interest rate cuts following stronger-than-anticipated economic data.\n\nTired of too many ads?go ad free now\n\nTrump revealed plans to levy a 100% tariff on imported branded pharmaceuticals, 25% on heavy-duty trucks, and 50% on kitchen cabinets. He also said that bathroom vanities would face a 50% duty and upholstered furniture a 30% tariff, all effective from October 1.\n\nJapan’s Topix pharmaceutical index (.IPHAM.T) declined 1.4%, while Australian biotech company CSL dropped over 3%. The Nikkei lost 0.5%, and the MSCI Asia-Pacific index outside Japan fell 0.45%.\n\n“R\n\nig\n\nht now, this adds to a somewhat fragile environment for risk assets,” said Tony Sycamore, a market analyst at IG, as quoted by Reuters.\n\nIn the US, futures reflected investor caution, with Nasdaq contracts down 0.08% and S&P 500 futures slipping 0.02%. Meanwhile, European futures posted modest gains, with EUROSTOXX 50 contracts up 0.37% and FTSE futures rising 0.25%.\n\nInvestor sentiment was further dampened as expectations of aggressive Fed easing were tempered by robust economic indicators.\n\nEconomists at Wells Fargo noted that recent GDP figures confirm the US economy’s resilience in the first half of the year despite unpredictable trade policy.\n\nTraders now anticipate roughly 39 basis points of rate reductions by December, slightly lower than the 40-plus basis points forecast earlier this week. “Markets had built in optimism for four to six cuts, but now it looks like four is the most likely scenario, and even that may be generous,” said Sycamore.\n\nTired of too many ads?go ad free now\n\nWhile most Fed officials remain cautious on future rate moves, newcomer Stephen Miran has advocated for sharp reductions to avoid a labor market downturn, reported Reuters.\n\n## Dollar strengthens, commodities rise\n\nThe dollar strengthened in response, hovering near 150 yen. The euro last traded at $1.1668, down 0.6% from the previous session, while sterling remained steady at $1.3344.\n\nCommodity prices saw modest gains, with Brent crude rising 0.24% to $69.59 per barrel and US crude climbing 0.43% to $65.26 per barrel. Trump also indicated confidence that Turkey would comply with US requests to reduce Russian oil imports, hinting at the potential lifting of sanctions to allow Ankara to acquire advanced American F-35 jets following talks with President Erdogan.\n\nSpot gold inched higher to $3,751.69 an ounce.\n\n##### About the Author\n\nTOI Business Desk\n\nThe TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "H Mart opens in Orlando, thrilling Asian cuisine lovers",
      "url": "https://www.clickorlando.com/video/news/2025/09/25/h-mart-opens-in-orlando-thrilling-asian-cuisine-lovers/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/1wv9gZkBYo495yCUKT0_/1758822557537_1920x1080_thumbnail.jpg?_a=DATAg1eAZAA0"
      },
      "content": "Close\n\n### NEWS\n\n# H Mart opens in Orlando, thrilling Asian cuisine lovers\n\nPublished: September 25, 2025 at 1:47 PM\n\nHundreds lined up in Orlando on Thursday for the grand opening of Florida’s first H Mart. The Asian supermarket has a significant “cult following,” and the location at 7501 W. Colonial Drive is one of H Mart’s largest.\n\n## MORE VIDEOS\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/u-s-to-impose-tariffs-on-some-imported-drugs-starting-oct-1/)\n\n[22 minutes ago](https://www.clickorlando.com/video/news/2025/09/26/u-s-to-impose-tariffs-on-some-imported-drugs-starting-oct-1/)\n\n## U.S. to impose tariffs on some imported drugs starting Oct. 1\n\nRead full article: U.S. to impose tariffs on some imported drugs starting Oct. 1\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/starbucks-to-close-stores-cut-hundreds-of-jobs-in-restructuring-plan/)\n\n[23 minutes ago](https://www.clickorlando.com/video/news/2025/09/26/starbucks-to-close-stores-cut-hundreds-of-jobs-in-restructuring-plan/)\n\n## Starbucks to close stores, cut hundreds of jobs in restructuring plan\n\nRead full article: Starbucks to close stores, cut hundreds of jobs in restructuring plan\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/kissimmee-fire-department-installs-new-alert-system-to-improve-response-times/)\n\n[1 hour ago](https://www.clickorlando.com/video/news/2025/09/26/kissimmee-fire-department-installs-new-alert-system-to-improve-response-times/)\n\n## Kissimmee Fire Department installs new alert system to improve response times\n\nRead full article: Kissimmee Fire Department installs new alert system to improve response times\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/amber-alert-issued-in-marion-county-linked-to-shooting/)\n\n[1 hour ago](https://www.clickorlando.com/video/news/2025/09/26/amber-alert-issued-in-marion-county-linked-to-shooting/)\n\n## Amber Alert issued in Marion County linked to shooting\n\nRead full article: Amber Alert issued in Marion County linked to shooting\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/justin-warmoth-breaks-down-friday-s-top-stories/)\n\n[1 hour ago](https://www.clickorlando.com/video/news/2025/09/26/justin-warmoth-breaks-down-friday-s-top-stories/)\n\n## Justin Warmoth breaks down Friday's top stories\n\nRead full article: Justin Warmoth breaks down Friday's top stories\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/second-harvest-food-bank-launches-24-hour-relief-marathon-to-fight-hunger-in-central-florida/)\n\n[2 hours ago](https://www.clickorlando.com/video/news/2025/09/26/second-harvest-food-bank-launches-24-hour-relief-marathon-to-fight-hunger-in-central-florida/)\n\n## Second Harvest Food Bank launches 24-hour relief marathon to fight hunger in Central Florida\n\nRead full article: Second Harvest Food Bank launches 24-hour relief marathon to fight hunger in Central Florida\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/6-things-to-do-sept-27-28/)\n\n[3 hours ago](https://www.clickorlando.com/video/news/2025/09/26/6-things-to-do-sept-27-28/)\n\n## 6 Things to Do: Sept. 27-28\n\nRead full article: 6 Things to Do: Sept. 27-28\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/guest-sues-universal-over-stardust-racers-injuries/)\n\n[4 hours ago](https://www.clickorlando.com/video/news/2025/09/26/guest-sues-universal-over-stardust-racers-injuries/)\n\n## Guest sues Universal over Stardust Racers injuries\n\nRead full article: Guest sues Universal over Stardust Racers injuries\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/amber-alert-issued-out-of-marion-county-for-17-year-old-boy-after-shooting/)\n\n[4 hours ago](https://www.clickorlando.com/video/news/2025/09/26/amber-alert-issued-out-of-marion-county-for-17-year-old-boy-after-shooting/)\n\n## Amber Alert issued out of Marion County for 17-year-old boy after shooting\n\nRead full article: Amber Alert issued out of Marion County for 17-year-old boy after shooting\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/charter-schools-can-use-public-classrooms-in-florida-under-new-rules/)\n\n[10 hours ago](https://www.clickorlando.com/video/news/2025/09/26/charter-schools-can-use-public-classrooms-in-florida-under-new-rules/)\n\n## Charter schools can use public classrooms in Florida under new rules\n\nRead full article: Charter schools can use public classrooms in Florida under new rules\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/26/eatonville-town-council-votes-to-oppose-hungerford-plan/)\n\n[10 hours ago](https://www.clickorlando.com/video/news/2025/09/26/eatonville-town-council-votes-to-oppose-hungerford-plan/)\n\n## Eatonville Town Council votes to oppose Hungerford plan\n\nRead full article: Eatonville Town Council votes to oppose Hungerford plan\n\n[No description available](https://www.clickorlando.com/video/news/2025/09/25/man-accused-of-illegally-3d-printing-guns-weapons-in-rockledge-home/)\n\n[14 hours ago](https://www.clickorlando.com/video/news/2025/09/25/man-accused-of-illegally-3d-printing-guns-weapons-in-rockledge-home/)\n\n## Man accused of illegally 3D printing guns, weapons in Rockledge home\n\nRead full article: Man accused of illegally 3D printing guns, weapons in Rockledge home",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "Global Markets Today: Nikkei 225, Kospi trade mixed for second day on Wall Street declines | Stock Market News",
      "url": "https://www.livemint.com/market/stock-market-news/global-markets-today-nikkei-225-kospi-trade-mixed-for-second-day-on-wall-street-declines/amp-11758761121449.html?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://www.livemint.com/lm-img/img/2025/09/25/600x338/Japan-Financial-Markets-1_1742401081310_1758761706856.jpg"
      },
      "content": "- Home\n\n- Latest News\n\n- Market\n\n- News\n\n- Premium\n\n- Companies\n\n- Money\n\n- Opinion\n\n- Industry\n\n- Politics\n\n- Videos\n\n- Gold Price Today\n\n- H1B Visa\n\n- Technology\n\n- In Charts\n\n- Web Stories\n\n- My Watchlist\n\n- Newsletters\n\n- My Vouchers\n\n- Notifications\n\n- My Reads\n\n- For You\n\n- Market Dashboard\n\n- BullionGoldSilver\n\n- Gold\n\n- Silver\n\n- FuelPetrolDiesel\n\n- Petrol\n\n- Diesel\n\n- CommoditiesGoldGoldMAluminiumMenthaoilSilverSilverMICGoldPetalNatural GasCopperZincSilverMCrudeOilGoldGinueaLead\n\n- Gold\n\n- GoldM\n\n- Aluminium\n\n- Menthaoil\n\n- Silver\n\n- SilverMIC\n\n- GoldPetal\n\n- Natural Gas\n\n- Copper\n\n- Zinc\n\n- SilverM\n\n- CrudeOil\n\n- GoldGinuea\n\n- Lead\n\n- Cryptocurrency\n\n- Smart Money\n\n- Today's NewsIndia NewsWorld NewsUS News Today\n\n- India News\n\n- World News\n\n- US News Today\n\n- Markets Stock MarketsIPO NewsIPO DashboardMark To MarketBondsCommodity NewsCryptocurrency\n\n- Stock Markets\n\n- IPO News\n\n- IPO Dashboard\n\n- Mark To Market\n\n- Bonds\n\n- Commodity News\n\n- Cryptocurrency\n\n- CompaniesIPO NewsStart-upsCompany ResultsTop Company Leader\n\n- IPO News\n\n- Start-ups\n\n- Company Results\n\n- Top Company Leader\n\n- Premium\n\n- Money NewsPersonal FinanceQ&AOpinion\n\n- Personal Finance\n\n- Q&A\n\n- Opinion\n\n- Economy\n\n- Technology NewsGadgetsTech ReviewsApp News\n\n- Gadgets\n\n- Tech Reviews\n\n- App News\n\n- Personal Loanpersonal loan emi calculatorPersonal Loan Interest RatePersonal Loan EligibilityBusiness LoanInstant Personal Loan\n\n- personal loan emi calculator\n\n- Personal Loan Interest Rate\n\n- Personal Loan Eligibility\n\n- Business Loan\n\n- Instant Personal Loan\n\n- e-paper\n\n- WSJ\n\n- Economist\n\n- Barron's\n\n- Mint Premium\n\n- IFSC Code Finder\n\n- Income Tax Calculator\n\n- SIP Calculator\n\n- EMI Calculator\n\n- Home Loan EMI Calculator\n\n- Car Loan EMI\n\n- NPS Calculator\n\n- Videos\n\n- WebStories\n\n- Photo Gallery\n\n- Podcasts\n\n- Mint Lounge\n\n- Mint Hindi\n\n- Livehindustan\n\n- Hindustan Times\n\n- About Us\n\n- Print Subscription\n\n- Mint Authors\n\n- Terms of Use\n\n- Disclaimer\n\n- Mint Code\n\n- Code of ethics\n\n- Privacy and cookie settings\n\n- SITEMAP\n\n- Contact Us\n\n- Mint Apps\n\n# Global Markets Today: Nikkei 225, Kospi trade mixed for second day on Wall Street declines\n\n## Global Markets Today: Japan’s Nikkei 225 opened near flat, while the broader Topix advanced 0.58 per cent. In South Korea, the Kospi slipped 0.28 per cent and the Kosdaq edged down 0.27 per cent.\n\nGlobal Markets Today: Asian markets fell for second day straight on Thursday, as Wall Street’s continued selloff in major tech firms like Nvidia and Oracle weighed on sentiment for a second consecutive day.\n\nJapan’s Nikkei 225 opened near flat, while the broader Topix advanced 0.58 per cent.\n\nIn South Korea, the Kospi slipped 0.28 per cent and the Kosdaq edged down 0.27 per cent. Meanwhile, defense stocks gained, with Hanwha Aerospace up 2.46 per cent and Poongsan climbing 3.28 per cent.\n\nAustralia’s S&P/ASX 200 dipped 0.23 per cent in early trading, while Hong Kong’s Hang Seng index futures traded at 26,394, below the previous close of 26,518.65. Hong Kong investors are set to keep a close eye on the listing of Chinese automaker Chery Automobile later today.\n\n## US stock market today\n\nU.S. equities declined for the second consecutive session on Wednesday, as investors locked in profits with indexes hovering near record highs. The drop came after Federal Reserve Chair Jerome Powell pointed to potentially overvalued stock prices and ahead of key inflation data due later this week.\n\nThe Dow Jones Industrial Average slipped 171.50 points, or 0.37 per cent, to 46,121.28. The S&P 500 fell 18.94 points, or 0.28 per cent, to 6,637.98, while the Nasdaq Composite shed 75.62 points, or 0.33 per cent, to 22,497.86.\n\nAfter all three major indexes closed at record highs simultaneously for the first time in years earlier this week, Powell remarked on Tuesday that asset prices seemed to be quite elevated.\n\nThe Fed’s rate cut last week boosted equities in September—a month usually considered weak for markets—with investors now counting on additional easing measures to sustain the rally.\n\n(With inputs from agencies)\n\nDisclaimer: This story is for educational purposes only. The views and recommendations above are those of individual analysts or broking companies, not Mint. We advise investors to check with certified experts before making any investment decisions.\n\n- HDFC Bank Share Price\n\n- Reliance Industries Share Price\n\n- TCS Share Price\n\n- Infosys Share Price\n\n- HUL Share Price",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "‘IKEA of grocery stores:’ H Mart opens in Orlando, thrilling Asian cuisine lovers",
      "url": "https://www.clickorlando.com/news/local/2025/09/25/ikea-of-grocery-stores-h-mart-opens-in-orlando-thrilling-asian-cuisine-lovers/?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/fstl-tf/1wv9gZkBYo495yCUKT0_/1758822557537_1920x1080_thumbnail.jpg?_a=DATAg1eAZAA0"
      },
      "content": "[What’s the latest with Invest 94L and any possible threats to Florida?](https://www.clickorlando.com/weather/2025/09/26/whats-the-latest-with-invest-94l-and-any-possible-threats-to-florida/)\n\nClose\n\n#### Local News\n\n# ‘IKEA of grocery stores:’ H Mart opens in Orlando, thrilling Asian cuisine lovers\n\n## 100,000-square-foot store takes over former Target Superstore\n\nMark Lehman, ReporterPublished: September 25, 2025 at 1:09 PMUpdated: September 25, 2025 at 7:25 PM\n\n**ORLANDO, Fla.** – Hundreds lined up in Orlando on Thursday for the grand opening of Florida’s first H Mart.\n\nThe Asian supermarket has a significant “cult following,” and the location at 7501 W. Colonial Drive is one of H Mart’s largest.\n\nSuzi Kroll drove from Deltona before sunrise to be among the first in the store when the doors officially opened.\n\n**[PHOTO GALLERY:**[Look inside the new H Mart Asian Supermarket in Orlando](https://www.clickorlando.com/gallery/news/local/2025/09/25/photos-inside-floridas-first-h-mart-asian-supermarket/)**]**\n\n“We like the food and all the experiences, so just coming to what I would say is the IKEA of grocery stores is pretty exciting,” Kroll said.\n\nSuzi Kroll and Tatiana Kroll are one of the first to enter H Mart supermarket in Orlando.(Copyright 2025 by WKMG ClickOrlando - All rights reserved.)\n\nH Mart describes itself as America’s premier Asian food destination that provides groceries and everyday essential needs, as well as upscale products.\n\n“Extensive produce, extensive seafood selections, but then also a whole food court like a shopping mall,” Kroll said. “It’s really exciting to have Orlando get their biggest location.”\n\nH Mart has been working for years to establish a location in Central Florida and opened at the site of a former Super Target that closed its doors in 2012.\n\n“It means jobs, it means food, and it means opportunity,” Orange County District 6 Commissioner Michael Scott said. “What H Mart is looking to do is not only just provide a grocery store, provide spaces for small businesses you see around, but also be a part of the community and invest in it.”\n\nAn aisle of instant noodles during the H Mart grand opening in Orlando.(Copyright 2025 by WKMG ClickOrlando - All rights reserved.)\n\nFor more than 30 years, H Mart has provided eateries in its stores and has become known for its food halls as well.\n\n“What they provide, you have a lot of different sections inside of there that you can check out. It’s not just a grocery store,” Orlando resident Isabel Cho said.\n\nH Mart is open 365 days a year. Current hours are from 9 a.m. to 10 p.m. daily.\n\nFor more details on the supermarket’s offerings and Orlando location, [visit H Mart’s website.](https://www.hmart.com/)\n\nThe food court inside H Mart in Orlando.(Copyright 2025 by WKMG ClickOrlando - All rights reserved.)\n\nH Mart is just the latest Asian grocery store to enter the Central Florida market.\n\nOther grocery stores include Mei’s Supermarket in Union Park, iFresh Supermarket at East Colonial Drive and Bumby Avenue, Lotte Market on West Colonial Drive and John Young Parkway, and Enson Market and New Golden Sparkling Market, both on West Colonial near Kirkman Road.\n\nBreaking News AlertsGet breaking news alerts delivered to your inbox.\n\nCopyright 2025 by WKMG ClickOrlando - All rights reserved.\n\n##### About the Author\n\nMark Lehman headshot\n\n##### Mark Lehman\n\nMark Lehman became a News 6 reporter in July 2014, but he's been a Central Florida journalist and part of the News 6 team for much longer. While most people are fast asleep in their bed, Mark starts his day overnight by searching for news on the streets of Central Florida.\n\n[email](mailto:mlehman@wkmg.com?subject=Re:‘IKEA of grocery stores:’ H Mart opens in Orlando, thrilling Asian cuisine lovers)[facebook](https://https://www.facebook.com/MarkLehman6)[twitter](https://www.twitter.com/MarkLehman6)\n\nLoading...\n\nRecommended Videos",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "East Asia Tonight - Thu 25 Sep 2025 - CNA",
      "url": "https://www.channelnewsasia.com/watch/east-asia-tonight/thu-25-sep-2025-5369206?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dam.mediacorp.sg/image/upload/s--K4DOGULr--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2025/09/25/1758802038-image.jpg?itok=Wdb10d1X",
        "1": "https://dam.mediacorp.sg/image/upload/s--K4DOGULr--/c_fill,g_auto,h_338,w_600/f_auto,q_auto/v1/mediacorp/cna/image/2025/09/25/1758802038-image.jpg?itok=Wdb10d1X",
        "2": "https://dam.mediacorp.sg/image/upload/s--YE9hsDhe--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/1758891440-image.jpg?itok=T1IvDtXe",
        "3": "https://dam.mediacorp.sg/image/upload/s--GlaVmOJD--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/ot-screengrab-end-frame-ep02.png?itok=ti7mX5-k",
        "4": "https://dam.mediacorp.sg/image/upload/s--ehv4m1GV--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/1758882141-image.jpg?itok=sqrAry7D"
      },
      "content": "East Asia Tonight - Thu 25 Sep 2025\n\n48:42 Min Spotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\nEast Asia Tonight\n\n## East Asia Tonight - Thu 25 Sep 2025\n\n26 Sep 2025 08:11am\n\nSpotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\n## East Asia Tonight\n\nAbout the show: 'East Asia Tonight' shines a spotlight on a region steeped in history and now helping to write the future of our world. Greater China, Japan, and the Korean Peninsula have economic and political might, and are major drivers of daily news and business. We'll break down the key stories and explain why they matter.\n\n[Show more](https://www.channelnewsasia.com/javascript:;)\n\n## Latest Episodes\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Thu 25 Sep 2025\n\n49 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Wed 24 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Tue 23 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Mon 22 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Fri 19 Sep 2025\n\n49 mins\n\n## You May Also Like\n\nContent is loading...\n\n## Popular Shows\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Trump slaps 100% tariff on branded pharmaceutical products\n\n26/09/2025 5 mins\n\n[Watch](https://www.channelnewsasia.com/watch)\n\n##### FutureChina Global Forum 2025 - China's Next Chapter\n\n26/09/2025 39 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Motion to appoint members of Committee of Selection\n\n26/09/2025 2 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Sharael Taha wraps up debate on President’s speech\n\n26/09/2025 22 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Chan Chun Sing on charting the path towards SG100 and beyond\n\n26/09/2025 49 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Hany Soh on transforming Singapore's North into ‘Uptown North’\n\n26/09/2025 20 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Vikram Nair on global, domestic and job security\n\n26/09/2025 16 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Desmond Tan on pairing human intelligence with technology\n\n26/09/2025 19 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Liang Eng Hwa on moderating cost increases and reducing job-matching friction\n\n26/09/2025 20 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Sun Xueling clarifies on prices of resale flats\n\n26/09/2025 1 mins",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    },
    {
      "title": "East Asia Tonight - Wed 24 Sep 2025 - CNA",
      "url": "https://www.channelnewsasia.com/watch/east-asia-tonight/wed-24-sep-2025-5367946?utm_source=valyu.network&utm_medium=referral&utm_campaign=ai_pilot&utm_content=ai_query",
      "image_url": {
        "0": "https://dam.mediacorp.sg/image/upload/s--UUBRuGJQ--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2025/09/25/1758766036-image.jpg?itok=c3KJOw7G",
        "1": "https://dam.mediacorp.sg/image/upload/s--UUBRuGJQ--/c_fill,g_auto,h_338,w_600/f_auto,q_auto/v1/mediacorp/cna/image/2025/09/25/1758766036-image.jpg?itok=c3KJOw7G",
        "2": "https://dam.mediacorp.sg/image/upload/s--YE9hsDhe--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/1758891440-image.jpg?itok=T1IvDtXe",
        "3": "https://dam.mediacorp.sg/image/upload/s--GlaVmOJD--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/ot-screengrab-end-frame-ep02.png?itok=ti7mX5-k",
        "4": "https://dam.mediacorp.sg/image/upload/s--ehv4m1GV--/f_auto,q_auto/c_fill,g_auto,h_181,w_313/v1/mediacorp/cna/image/2025/09/26/1758882141-image.jpg?itok=sqrAry7D"
      },
      "content": "East Asia Tonight - Wed 24 Sep 2025\n\n48:12 Min Spotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\nEast Asia Tonight\n\n## East Asia Tonight - Wed 24 Sep 2025\n\n25 Sep 2025 09:00am\n\nSpotlight on East Asia, a region steeped in history and now helping to write the future of our world. We'll break down the key stories and explain why they matter.\n\n## East Asia Tonight\n\nAbout the show: 'East Asia Tonight' shines a spotlight on a region steeped in history and now helping to write the future of our world. Greater China, Japan, and the Korean Peninsula have economic and political might, and are major drivers of daily news and business. We'll break down the key stories and explain why they matter.\n\n[Show more](https://www.channelnewsasia.com/javascript:;)\n\n## Latest Episodes\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Thu 25 Sep 2025\n\n49 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Wed 24 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Tue 23 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Mon 22 Sep 2025\n\n48 mins\n\n[East Asia Tonight](https://www.channelnewsasia.com/watch/east-asia-tonight-0)\n\n###### East Asia Tonight - Fri 19 Sep 2025\n\n49 mins\n\n## You May Also Like\n\nContent is loading...\n\n## Popular Shows\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Indonesia and Canada ink landmark comprehensive economic partnership agreement\n\n26/09/2025 3 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### ASEAN economic ministers wrap up week-long gathering focused on trade\n\n26/09/2025 4 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Trump slaps 100% tariff on branded pharmaceutical products\n\n26/09/2025 5 mins\n\n[Watch](https://www.channelnewsasia.com/watch)\n\n##### FutureChina Global Forum 2025 - China's Next Chapter\n\n26/09/2025 39 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Motion to appoint members of Committee of Selection\n\n26/09/2025 2 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Sharael Taha wraps up debate on President’s speech\n\n26/09/2025 22 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Chan Chun Sing on charting the path towards SG100 and beyond\n\n26/09/2025 49 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Hany Soh on transforming Singapore's North into ‘Uptown North’\n\n26/09/2025 20 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Vikram Nair on global, domestic and job security\n\n26/09/2025 16 mins\n\n[News Video Reports](https://www.channelnewsasia.com/watch)\n\n##### Debate on President’s speech: Desmond Tan on pairing human intelligence with technology\n\n26/09/2025 19 mins",
      "source": "News Source",
      "date": "2025-09-26T14:02:05.300Z"
    }
  ],
  "timestamp": 1758895325302
}