{
  "newsItems": [
    {
      "title": "Israel-Hamas ceasefire updates: Israeli Cabinet approves ‘outline’ of deal to release hostages held by Hamas - The Hindu",
      "url": "https://www.thehindu.com/news/international/israel-hamas-ceasefire-talks-deal-palestine-gaza-war-trump-live-october-9/article70142156.ece?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://th-i.thgim.com/public/incoming/gf21bc/article70142650.ece/alternates/LANDSCAPE_1200/2025-10-09T062844Z_653371596_RC268HAVDOKM_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA.JPG"
      },
      "content": "# Israel-Hamas ceasefire updates: Israeli Cabinet approves ‘outline’ of deal to release hostages held by Hamas\n\n## Israel and the Palestinian militant group Hamas signed an agreement on Thursday to cease fire and free Israeli hostages in exchange for Palestinian prisoners\n\nUpdated - October 10, 2025 07:16 am IST\n\nA truck carries a military tank, after U.S. President Donald Trump announced that Israel and Hamas agreed on the first phase of a Gaza ceasefire, on the Israeli side of the border with Gaza, October 9, 2025. | Photo Credit: Reuters\n\nThe office of Israeli Prime Minister Benjamin Netanyahu said on Thursday (October 9, 2025) that an agreement to secure the release of hostages in Gaza will take effect only after receiving cabinet approval.\n\nAlso Read | Israel’s tactical gains in a strategic labyrinth\n\nEarlier, Israel and Hamas agreed to the “first phase” of his peace plan to pause fighting and release at least some hostages and prisoners, U.S. President Donald Trump said on Wednesday (October 8, 2025) in announcing the outlines of the biggest breakthrough in months in the two-year-old war.\n\nHamas will exchange 20 living hostages for 2,000 Palestinian prisoners as part of the first phase of a deal to end the war in Gaza, a source within the militant group told AFP. The exchange will take place within 72 hours of the implementation of the agreement.\n\nThe hostages will be released in exchange for 250 Palestinians sentenced to life imprisonment and 1,700 others arrested by Israel since the war began on 7 October 2023, the source added.\n\nIsrael’s Cabinet early on Friday (October 10, 2025) approved President Donald Trump’s plan for a ceasefire in the Gaza Strip and the release of all the remaining hostages held by Hamas, a key step toward ending a ruinous two-year war that has destabilised the Middle East.\n\nA brief statement from Prime Minister Benjamin Netanyahu’s office said the Cabinet approved the “outline” of a deal to release the hostages, without mentioning other aspects of the plan that are more controversial.\n\n### Israeli Cabinet approves 'outline' of deal to release hostages held by Hamas\n\nIsraeli Cabinet approves Trump's ceasefire plan to release hostages held by Hamas, ending two-year war in Gaza.\n\n- October 10, 2025 05:36 U.S. is sending about 200 troops to Israel to help support and monitor the Gaza ceasefire dealThe United States is sending about 200 troops to Israel to help support and monitor the ceasefire deal in Gaza as part of a team that includes partner nations, nongovernmental organizations and private-sector players, U.S. officials said on Thursday.The officials, who spoke on condition of anonymity to discuss details that were not authorized for release, said U.S. Central Command is going to establish a “civil-military coordination center” in Israel that will help facilitate the flow of humanitarian aid as well as logistical and security assistance into the territory wracked by two years of war.AP\n\nThe United States is sending about 200 troops to Israel to help support and monitor the ceasefire deal in Gaza as part of a team that includes partner nations, nongovernmental organizations and private-sector players, U.S. officials said on Thursday.\n\nThe officials, who spoke on condition of anonymity to discuss details that were not authorized for release, said U.S. Central Command is going to establish a “civil-military coordination center” in Israel that will help facilitate the flow of humanitarian aid as well as logistical and security assistance into the territory wracked by two years of war.\n\nAP\n\n- October 10, 2025 04:14 Israeli Cabinet approves ‘outline’ of deal to release hostages held by Hamas, Netanyahu’s office saysIsrael’s Cabinet has approved the “outline” of a deal to release hostages held by Hamas, Prime Minister Benjamin Netanyahu’s office said early Friday.It’s a key step in implementing a ceasefire and the exchange of hostages for Palestinian prisoners brokered by U.S. President Donald Trump. The brief statement released focused on the hostage release and made no mention of the other parts of Mr. Trump’s plan for ending the war.AP\n\nIsrael’s Cabinet has approved the “outline” of a deal to release hostages held by Hamas, Prime Minister Benjamin Netanyahu’s office said early Friday.\n\nIt’s a key step in implementing a ceasefire and the exchange of hostages for Palestinian prisoners brokered by U.S. President Donald Trump. The brief statement released focused on the hostage release and made no mention of the other parts of Mr. Trump’s plan for ending the war.\n\n- October 10, 2025 04:04 U.S. sending about 200 troops to Israel to help support, monitor ceasefire deal in GazaThe United States is sending about 200 troops to Israel to help support and monitor the ceasefire deal in Gaza as part of a team that includes partner nations, nongovernmental organisations and private sector players, U.S. officials said Thursday.The officials, who spoke on condition of anonymity to discuss details not authorised for release, said U.S. Central Command is going to establish a “civil-military coordination centres” in Israel that will help facilitate the flow of humanitarian aid as well as logistical and security assistance into the territory wracked by two years of war. AP\n\nThe United States is sending about 200 troops to Israel to help support and monitor the ceasefire deal in Gaza as part of a team that includes partner nations, nongovernmental organisations and private sector players, U.S. officials said Thursday.\n\nThe officials, who spoke on condition of anonymity to discuss details not authorised for release, said U.S. Central Command is going to establish a “civil-military coordination centres” in Israel that will help facilitate the flow of humanitarian aid as well as logistical and security assistance into the territory wracked by two years of war.\n\n- October 10, 2025 03:09 Israel says ‘all parties’ signed phase one of Gaza dealIsrael said Thursday all parties have signed the first phase of a Gaza ceasefire and hostage release deal, adding that Hamas freeing the captives would “bring the end to this war”. The agreement in Egypt follows a 20-point peace plan for Gaza announced last month by US President Donald Trump, after more than two years of war sparked by Hamas’s October 2023 attack on Israel. AFP\n\nIsrael said Thursday all parties have signed the first phase of a Gaza ceasefire and hostage release deal, adding that Hamas freeing the captives would “bring the end to this war”.\n\nThe agreement in Egypt follows a 20-point peace plan for Gaza announced last month by US President Donald Trump, after more than two years of war sparked by Hamas’s October 2023 attack on Israel.\n\nAFP\n\n- October 10, 2025 01:19 Trump says he will head to the West Asia on Sunday after Israel-Hamas hostage dealU.S. President Donald Trump said on Thursday that he plans to leave for the West Asia sometime on Sunday, after Israel and Hamas reached a deal to release hostages held in Gaza.Israel and the Palestinian militant group Hamas signed an agreement on Thursday to cease fire and free Israeli hostages in exchange for Palestinian prisoners, in the first phase of Trump’s initiative to end the two-year war in Gaza that has upended the Middle East.Reuters\n\nU.S. President Donald Trump said on Thursday that he plans to leave for the West Asia sometime on Sunday, after Israel and Hamas reached a deal to release hostages held in Gaza.\n\nIsrael and the Palestinian militant group Hamas signed an agreement on Thursday to cease fire and free Israeli hostages in exchange for Palestinian prisoners, in the first phase of Trump’s initiative to end the two-year war in Gaza that has upended the Middle East.\n\nReuters\n\n- October 09, 2025 23:30 Senior Hamas official says no Palestinian accepts disarmingSenior Hamas official Osama Hamdan said on Thursday that no Palestinian accepts disarming and Palestinians were in need to weapons and resistance.Reuters\n\nSenior Hamas official Osama Hamdan said on Thursday that no Palestinian accepts disarming and Palestinians were in need to weapons and resistance.\n\n- October 09, 2025 22:55 In Focus podcast | Trump’s Gaza peace plan: Can it deliver a lasting ceasefire? In Focus podcast | Trump’s Gaza peace plan: Can it deliver a lasting ceasefire?In this episode, Stanly Johny speaks to us about the details of Trump’s Gaza peace plan, what it promises to achieve, and whether it can truly bring a lasting ceasefire.\n\n### In Focus podcast | Trump’s Gaza peace plan: Can it deliver a lasting ceasefire?\n\nIn this episode, Stanly Johny speaks to us about the details of Trump’s Gaza peace plan, what it promises to achieve, and whether it can truly bring a lasting ceasefire.\n\n- October 09, 2025 21:59 Palestinian President meets Israeli peace activists as Gaza deal announced Palestinian president Mahmud Abbas met with Israeli activists in Ramallah on Thursday (October 9, 2025) to discuss long-term peace after Israel and Hamas agreed a Gaza ceasefire and hostage release deal.“I welcome the agreement signed today, the end of the war, and the release of the hostages,” Mr. Abbas told dozens of representatives from Israeli peace organisations assembled at the presidential palace in Ramallah in the occupied West Bank.“A few months ago, (U.S. President Donald) Trump had a plan to expel the Palestinians, but later he forgot about it,” he added.“Nevertheless, we will remain in our homeland and establish a Palestinian state in Gaza, the West Bank, and east Jerusalem,” he said.- AFP\n\nPalestinian president Mahmud Abbas met with Israeli activists in Ramallah on Thursday (October 9, 2025) to discuss long-term peace after Israel and Hamas agreed a Gaza ceasefire and hostage release deal.\n\n“I welcome the agreement signed today, the end of the war, and the release of the hostages,” Mr. Abbas told dozens of representatives from Israeli peace organisations assembled at the presidential palace in Ramallah in the occupied West Bank.\n\n“A few months ago, (U.S. President Donald) Trump had a plan to expel the Palestinians, but later he forgot about it,” he added.\n\n“Nevertheless, we will remain in our homeland and establish a Palestinian state in Gaza, the West Bank, and east Jerusalem,” he said.\n\n- AFP\n\n- October 09, 2025 21:56 Macron says Israel settlement increase ‘existential threat’ to Palestinian state French President Emmanuel Macron said Thursday (October 9, 2025) that increasing Israeli settlements in the occupied West Bank were an “existential threat” to a Palestiniane.Ramped-up settlement construction “is not only unacceptable and contrary to international law. It fuels tensions, violence, and instability,” Mr. Macron said at a meeting of top diplomats from Arab and European states on Gaza in Paris.- AFP\n\nFrench President Emmanuel Macron said Thursday (October 9, 2025) that increasing Israeli settlements in the occupied West Bank were an “existential threat” to a Palestiniane.\n\nRamped-up settlement construction “is not only unacceptable and contrary to international law. It fuels tensions, violence, and instability,” Mr. Macron said at a meeting of top diplomats from Arab and European states on Gaza in Paris.\n\n- October 09, 2025 21:55 Release of all hostages should bring end to Gaza war: Israel Foreign Minister The release of all hostages held by Hamas, as stipulated under a newly signed first phase of a Gaza ceasefire deal, should bring about an end to the two-year war, Israel’s foreign minister said in an interview Thursday (October 9, 2025).“There will be a ceasefire and then the commitment within 72 hours of Hamas to release all the hostages. I believe that can — that should bring the end to this war,” Gideon Saar told Fox News Channel’s Jennifer Griffin.- AFP\n\nThe release of all hostages held by Hamas, as stipulated under a newly signed first phase of a Gaza ceasefire deal, should bring about an end to the two-year war, Israel’s foreign minister said in an interview Thursday (October 9, 2025).\n\n“There will be a ceasefire and then the commitment within 72 hours of Hamas to release all the hostages. I believe that can — that should bring the end to this war,” Gideon Saar told Fox News Channel’s Jennifer Griffin.\n\n- October 09, 2025 20:07 Trump expected to visit Jerusalem on October 12: presidencyU.S. President Donald Trump is expected in Jerusalem on Sunday (October 12, 2025), the office of Israel’s President said, after the U.S. leader announced Israel and Hamas had agreed to a Gaza ceasefire and hostage release deal.An event scheduled for Sunday (October 12, 2025) at the Israeli President’s residence in Jerusalem was cancelled “in light of the expected release of the hostages and... the upcoming visit of President of the United States Donald J. Trump to Israel,” the office of Israeli President Isaac Herzog said in a statement on Thursday (October 9, 2025).“The decision was made due to anticipated security closures in Jerusalem surrounding the visit and the historic developments unfolding in the coming days,” it said.- AFP\n\nU.S. President Donald Trump is expected in Jerusalem on Sunday (October 12, 2025), the office of Israel’s President said, after the U.S. leader announced Israel and Hamas had agreed to a Gaza ceasefire and hostage release deal.\n\nAn event scheduled for Sunday (October 12, 2025) at the Israeli President’s residence in Jerusalem was cancelled “in light of the expected release of the hostages and... the upcoming visit of President of the United States Donald J. Trump to Israel,” the office of Israeli President Isaac Herzog said in a statement on Thursday (October 9, 2025).\n\n“The decision was made due to anticipated security closures in Jerusalem surrounding the visit and the historic developments unfolding in the coming days,” it said.\n\n- October 09, 2025 20:04 Nepal welcomes Gaza ceasefire deal, calls for citizen’s release Nepal on Thursday (October 9, 2025) welcomed the ceasefire deal between Israel and Hamas, urging the release of all hostages, including the lone Nepali held in Gaza.“We call for the immediate release of all hostages, including Nepali national Bipin Joshi,” the Foreign Ministry said in a statement.“We urge all parties concerned to implement the plan in its true spirit, to ensure the smooth flow of humanitarian assistance to the people of Gaza, and to pave the way for lasting peace.”Joshi, an agriculture student who was 22 when kidnapped, had arrived in Israel just weeks before the October 7, 2023, Hamas attack, during which Palestinian militants took 251 hostages to Gaza.- AFP\n\nNepal on Thursday (October 9, 2025) welcomed the ceasefire deal between Israel and Hamas, urging the release of all hostages, including the lone Nepali held in Gaza.\n\n“We call for the immediate release of all hostages, including Nepali national Bipin Joshi,” the Foreign Ministry said in a statement.\n\n“We urge all parties concerned to implement the plan in its true spirit, to ensure the smooth flow of humanitarian assistance to the people of Gaza, and to pave the way for lasting peace.”\n\nJoshi, an agriculture student who was 22 when kidnapped, had arrived in Israel just weeks before the October 7, 2023, Hamas attack, during which Palestinian militants took 251 hostages to Gaza.\n\n- October 09, 2025 19:41 Iran welcomes Hamas-Israel ceasefire deal Iran on Thursday (October 9, 2025) welcomed the Gaza ceasefire agreement between Hamas, which it has supported for years, and Israel, its arch-nemesis.“Iran has always supported any action and initiative that includes stopping the genocidal war, withdrawal of the occupying forces, bringing in humanitarian aid, releasing Palestinian prisoners and realising the fundamental rights of the Palestinians,” the Foreign Ministry said in a statement.- AFP\n\nIran on Thursday (October 9, 2025) welcomed the Gaza ceasefire agreement between Hamas, which it has supported for years, and Israel, its arch-nemesis.\n\n“Iran has always supported any action and initiative that includes stopping the genocidal war, withdrawal of the occupying forces, bringing in humanitarian aid, releasing Palestinian prisoners and realising the fundamental rights of the Palestinians,” the Foreign Ministry said in a statement.\n\n- October 09, 2025 19:22 Jailed Palestinian leader Marwan Barghouti will not be exchanged for hostages: IsraelAn Israeli Government spokeswoman on Thursday (October 9, 2025) said high-profile Palestinian prisoner Marwan Barghouti would not be exchanged as part of the Gaza ceasefire and hostage release deal reached by Israel and Hamas.When asked by a journalist whether Israel had agreed to release Mr. Barghouti, government spokeswoman Shosh Bedrosian told a briefing that: “I can tell you at this point in time that he will not be part of this release.”Mr. Barghouti — from Hamas’s rival, the Fatah movement — was among the Palestinian prisoners Hamas wanted to see released as part of the Gaza deal, according to Egyptian state-linked media.- AFP\n\nAn Israeli Government spokeswoman on Thursday (October 9, 2025) said high-profile Palestinian prisoner Marwan Barghouti would not be exchanged as part of the Gaza ceasefire and hostage release deal reached by Israel and Hamas.\n\nWhen asked by a journalist whether Israel had agreed to release Mr. Barghouti, government spokeswoman Shosh Bedrosian told a briefing that: “I can tell you at this point in time that he will not be part of this release.”\n\nMr. Barghouti — from Hamas’s rival, the Fatah movement — was among the Palestinian prisoners Hamas wanted to see released as part of the Gaza deal, according to Egyptian state-linked media.\n\n- October 09, 2025 19:19 Israel says final draft of Gaza phase one deal signed in Egypt ‘by all parties’ Israel said Thursday (October 9, 2025) that the final draft of the first phase of a Gaza ceasefire and hostage release deal between Israel and Hamas had been signed by all parties in Egypt.“The final draft of phase one was signed this morning in Egypt by all parties to release all the hostages,” Israeli government spokeswoman Shosh Bedrosian told journalists.- AFP\n\nIsrael said Thursday (October 9, 2025) that the final draft of the first phase of a Gaza ceasefire and hostage release deal between Israel and Hamas had been signed by all parties in Egypt.\n\n“The final draft of phase one was signed this morning in Egypt by all parties to release all the hostages,” Israeli government spokeswoman Shosh Bedrosian told journalists.\n\n- October 09, 2025 18:19 Italy’s Giorgia Meloni hails Gaza peace accordItaly’s Premier Giorgia Meloni hailed the agreement, calling it “extraordinary news.”“This agreement and the broader path outlined by the Trump plan constitute a unique opportunity to end this conflict that must be seized,” Ms. Meloni said.“Therefore, I urge all parties to fully respect the measures already agreed upon and to work to swiftly implement the next steps envisaged in the peace plan.” Ms. Meloni said Italy will continue to support the mediators’ efforts, standing “ready to contribute to the stabilisation, reconstruction, and development of Gaza.”- AP\n\nItaly’s Premier Giorgia Meloni hailed the agreement, calling it “extraordinary news.”\n\n“This agreement and the broader path outlined by the Trump plan constitute a unique opportunity to end this conflict that must be seized,” Ms. Meloni said.\n\n“Therefore, I urge all parties to fully respect the measures already agreed upon and to work to swiftly implement the next steps envisaged in the peace plan.” Ms. Meloni said Italy will continue to support the mediators’ efforts, standing “ready to contribute to the stabilisation, reconstruction, and development of Gaza.”\n\n- AP\n\n- October 09, 2025 18:09 Initial agreement would “constitute first step toward permanent ceasefire”: Lebanon’s President Lebanon’s President Joseph Aoun said he hoped the initial agreement would “constitute a first step toward a permanent ceasefire and an end to the humanitarian suffering of the brotherly Palestinian people in Gaza.” Mr. Aoun called for “continued international and regional efforts to achieve a comprehensive and just peace in the region that guarantees the legitimate rights of the Palestinian people” and for Israel to “halt its aggressive policies in Palestine, Lebanon, and Syria.”- AP\n\nLebanon’s President Joseph Aoun said he hoped the initial agreement would “constitute a first step toward a permanent ceasefire and an end to the humanitarian suffering of the brotherly Palestinian people in Gaza.”\n\nMr. Aoun called for “continued international and regional efforts to achieve a comprehensive and just peace in the region that guarantees the legitimate rights of the Palestinian people” and for Israel to “halt its aggressive policies in Palestine, Lebanon, and Syria.”\n\n- October 09, 2025 16:58 Russia gives cautious welcome to Gaza ceasefireThe Kremlin on Thursday (October 9, 2025) welcomed a Gaza ceasefire agreement between Israel and Hamas but said the key would be to see how the deal was implemented.“We certainly support these efforts. It cannot but cause general satisfaction that a ceasefire in Gaza is already being established. All these efforts can be welcomed,” Kremlin spokesman Dmitry Peskov was quoted by Interfax as saying.“We hope that the signatures will be delivered today, and then actions will follow to implement the agreements reached,” Mr. Peskov said.- Reuters\n\nThe Kremlin on Thursday (October 9, 2025) welcomed a Gaza ceasefire agreement between Israel and Hamas but said the key would be to see how the deal was implemented.\n\n“We certainly support these efforts. It cannot but cause general satisfaction that a ceasefire in Gaza is already being established. All these efforts can be welcomed,” Kremlin spokesman Dmitry Peskov was quoted by Interfax as saying.\n\n“We hope that the signatures will be delivered today, and then actions will follow to implement the agreements reached,” Mr. Peskov said.\n\n- Reuters\n\n- October 09, 2025 16:56 Saudi Arabia welcomes Gaza ceasefire, hopes for ‘just and comprehensive peace’ Saudi Arabia on Thursday (October 9, 2025) welcomed the Gaza ceasefire deal between Israel and Hamas and said it hoped it would lead to peace after two years of devastating war.Saudi Arabia hopes “this important step will lead to urgent action to alleviate the humanitarian suffering... achieve a full Israeli withdrawal, restore security and stability, and initiate practical steps to achieve a just and comprehensive peace based on the two-state solution”, a Foreign Ministry statement said.- AFP\n\nSaudi Arabia on Thursday (October 9, 2025) welcomed the Gaza ceasefire deal between Israel and Hamas and said it hoped it would lead to peace after two years of devastating war.\n\nSaudi Arabia hopes “this important step will lead to urgent action to alleviate the humanitarian suffering... achieve a full Israeli withdrawal, restore security and stability, and initiate practical steps to achieve a just and comprehensive peace based on the two-state solution”, a Foreign Ministry statement said.\n\n- October 09, 2025 16:49 UN says has enough stocks to feed entire Gaza for 3 months The United Nations agency for Palestinian refugees welcomed on Thursday (October 9, 2025) the ceasefire deal between Israel and Hamas as a “huge relief” and said it was ready to flood Gaza with desperately needed food.“UNRWA has food, medicines and other basic supplies to go to Gaza. We have enough to provide food for the entire population for the coming three months,” the agency’s chief, Philippe Lazzarini, said on X.- AFP\n\nThe United Nations agency for Palestinian refugees welcomed on Thursday (October 9, 2025) the ceasefire deal between Israel and Hamas as a “huge relief” and said it was ready to flood Gaza with desperately needed food.\n\n“UNRWA has food, medicines and other basic supplies to go to Gaza. We have enough to provide food for the entire population for the coming three months,” the agency’s chief, Philippe Lazzarini, said on X.\n\n- October 09, 2025 16:46 UAE welcomes Gaza agreement, urges parties to abide by terms The United Arab Emirates welcomed on Thursday (October 9, 2025) the agreement on the first phase of a Gaza ceasefire framework, urging all parties to abide by its terms, the Foreign Ministry said.- Reuters\n\nThe United Arab Emirates welcomed on Thursday (October 9, 2025) the agreement on the first phase of a Gaza ceasefire framework, urging all parties to abide by its terms, the Foreign Ministry said.\n\n- October 09, 2025 16:42 Israel wants to expand circle of peace and normalisation in region: Foreign MinisterIsrael has an interest in expanding the circle of peace and normalisation in the Middle Eastern region, Israeli Foreign Minister Gideon Saar said on Thursday (October 9, 2025), following a U.S.-brokered deal between Israel and Hamas to end the war in Gaza.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Taliban foreign minister makes groundbreaking visit to India",
      "url": "https://www.bbc.com/news/articles/c8exzzz5dp5o?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/ad4b/live/76a564c0-a4d7-11f0-928c-71dbb8619e94.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20251007-082128-301112d266-web-2.31.2-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/27a6/live/28726e70-a4d6-11f0-8928-4fa68a78cbab.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/666a/live/422b1b30-a5aa-11f0-bce4-d9d16b79c0d6.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/a024/live/3aea9c50-a5ab-11f0-bce4-d9d16b79c0d6.jpg.webp"
      },
      "content": "# Why Taliban minister's visit to India is so groundbreaking\n\nAfghan Taliban Foreign Minister Amir Khan Muttaqi has arrived in India for a week of talks - a visit which had been previously unimaginable.\n\nIt is the Taliban's highest-level visit to the country since seizing power in 2021, and Muttaqi is due to discuss diplomatic, trade and economic ties with Indian officials during an eight-day stay.\n\nThe visit is being seen as a ramping up of India's Afghan policy. On Friday, after Muttaqi met Indian Foreign Minister S Jaishankar, Delhi said that it will reopen its embassy in Kabul which was shut four years ago when the Taliban returned to power.\n\nArch-rival Pakistan, which historically had close ties with the Taliban, will be watching closely.\n\nMuttaqi - who was granted a temporary exemption from UN sanctions allowing him to travel - flew into Delhi from Russia, the only country so far to fully recognise the Taliban government.\n\nThe astonishing fact is that neither Islamabad, Delhi or the Taliban could have anticipated that so soon after taking power, the Taliban's relations with Pakistan would deteriorate to such a degree, while India would establish a multilateral relationship with the new government in Kabul.\n\nDelhi used to support the Western-backed Afghan government, which the Taliban drove from power, and this visit illustrates pragmatism and realpolitik on both sides, indicating they are serious about upgrading diplomatic, political and trade links.\n\nMuttaqi, accompanied by Afghan trade and foreign ministry officials, held talks with India's Jaishankar in Delhi on Friday.\n\n\"Closer cooperation between us contributes to your national development as well as regional stability and resilience,\" Jaishankar said. He also affirmed India's \"full commitment to the sovereignty, territorial integrity and independence of Afghanistan\".\n\nMeanwhile, Muttaqi called India a \"close friend\" and added that his visit would improve relations between the two countries.\n\nThe Afghan delegation will also meet representatives of the Indian business community.\n\n## Building understanding between unlikely allies\n\nAlthough India has not formally recognised Afghanistan's de facto rulers, it is one of a number of countries that maintain some form of diplomatic or informal relations with the Taliban. India currently has a small mission in Kabul, and sends humanitarian aid to Afghanistan, one of the poorest countries in the world.\n\nThe growing engagement between India's right-wing Hindu nationalist government and the Islamist Taliban started not long after the group's return to power in Kabul.\n\nThis particular trip comes against a backdrop of worsening ties between both India and Pakistan, and Pakistan and the Taliban government.\n\n\"The deterioration in ties with Pakistan also allows them [Taliban] to hedge their bets and show how it is no longer dependent on Islamabad for its survival - carving out an identity separate from their over-dependence on Pakistan,\" Harsh V Pant and Shivam Shekhawat, of the Observer Research Foundation think tank, wrote in a piece for NDTV news channel.\n\nDeeper engagement with India also gives the group a chance to \"create a perception of legitimacy for their domestic constituents\", according to Mr Pant and Mr Shekhawat.\n\nThe visit \"represents a setback for Pakistan\" and marks a significant step towards the Taliban regime's de facto recognition, said Brahma Chellaney, a strategic affairs analyst on X.\n\nIt signals \"a cautious reset in India-Taliban relations, with both sides prioritising pragmatic engagement to advance their strategic interests\", Chellaney added, saying the visit also marks a possible shift in Afghanistan's regional power dynamics.\n\nJust more than four years ago, all this seemed unlikely.\n\nAfter a timeline was set for US-led forces to withdraw by mid-2021, panic prevailed in Indian policy circles. As the Taliban captured Kabul on 15 August 2021, India shut its embassy and four consulates in Afghanistan and stopped issuing visas to Afghans from all walks of life, including students, patients, traders and former government officials and politicians.\n\nWith just one click it cancelled nearly all the visas it had already issued to thousands of Afghans, allegedly due to security concerns.\n\nBut within a year India had re-established its diplomatic presence, sending a \"technical team\" to Afghanistan in June 2022, tasked with overseeing the distribution of humanitarian aid.\n\nDelhi also started issuing visas to influential Taliban figures, government officials and their family members. Such visits, though not announced officially, helped build trust and understanding.\n\nLast November, India allowed the Taliban to appoint an envoy in Delhi and to open consulates first in Mumbai, then a few months later in Hyderabad.\n\nOver the past three years, the two countries have been working on gradually rebuilding ties, with Indian officials and diplomats holding several high-level engagements abroad, including a meeting between Muttaqi and India's Foreign Secretary Vikram Misri in Dubai in January this year.\n\n## A battle for influence\n\nIndia and Pakistan have long been engaged in a zero-sum game in Afghanistan, with each vying to dominate its political landscape at the expense of the other.\n\nDue to the Taliban's close ties with Pakistan, the Indian military and political establishment had viewed the group since its foundation in 1994 as a Pakistani proxy aiming to evict India from Afghanistan.\n\nIndia, along with Russia and Iran, supported factions fighting against the Taliban in Afghanistan until the group was removed from power after the 2001 US invasion.\n\nFor the next 20 years, India remained a major supporter of the US-backed, internationally-recognised Afghan government as insurgents, mainly the Taliban, waged an increasingly bloody war.\n\nWhile Pakistan enjoyed good relations with the Taliban during the group's first rule (1996-2001) and the beginning of their second period in power, relations between the two have become increasingly strained.\n\nSo much so that various Pakistani officials including its defence minister have publicly called Afghanistan an \"enemy country\". Pakistan accuses the Taliban government of allowing the Pakistani Taliban (TTP) to use Afghan territory to launch attacks inside Pakistan, and has carried out air strikes inside Afghanistan against what it calls TTP sanctuaries.\n\nThese accusations have been repeatedly rejected by the Taliban, which in turn accuses elements within Pakistan of trying to destabilise Afghanistan.\n\nIndia's reasons for maintaining good relations with the Taliban are first and foremost about advancing its national interest.\n\nDelhi's biggest concern is security, and especially the activities of the Islamic State group, al-Qaeda and other India-focused militant outfits. The Taliban have assured Delhi they will not allow Afghan territory to be used for terrorist activity against India, a statement reiterated by Muttaqi on Friday.\n\nTies with the Taliban are also key to Delhi's desire to deepen connectivity with Iran and Central Asia to counter China and Pakistan's influence in the region.\n\nDespite deepening ties between India and the Taliban government, both sides are cautious. Their relationship remains tactical due to reservations over what happened in the past, as well as various domestic considerations and possible foreign repercussions.\n\n## Russia becomes first state to recognise Afghanistan's Taliban government\n\n## Why India is reaching out to the Taliban now\n\n## The new 'Great Game' in Afghanistan",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Almost 55,000 preschool children in Gaza acutely malnourished, Lancet study estimates | Gaza | The Guardian",
      "url": "https://www.theguardian.com/world/2025/oct/08/almost-55000-children-in-gaza-acutely-malnourished-lancet-study-estimates?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/0d2dcf6f1e65e55e56147b7fe678f124c5b4b3dc/98_0_2362_1890/master/2362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=21c209acd9c3932a0abd6d2521fc2be4",
        "1": "https://i.guim.co.uk/img/media/0d2dcf6f1e65e55e56147b7fe678f124c5b4b3dc/98_0_2362_1890/master/2362.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=413b778841983a0c108a4a313726b8e0",
        "2": "https://i.guim.co.uk/img/media/3cc6bb3520b00c52c7717029a3abe359b0207cca/0_0_1920_1280/master/1920.jpg?width=445&dpr=1&s=none&crop=none",
        "3": "https://i.guim.co.uk/img/media/f06d42deac44a86cabbe2a705439973960d9e1bb/0_0_2299_1839/master/2299.jpg?width=220&dpr=1&s=none&crop=5%3A4",
        "4": "https://i.guim.co.uk/img/media/2471218054af851ea58b7807f028216b848dfa2f/393_0_3204_2563/master/3204.jpg?width=220&dpr=1&s=none&crop=5%3A4"
      },
      "content": "The study found two years of war had led to ‘enormous nutritional consequences’ for tens of thousands of children across Gaza. Photograph: Anadolu/Getty ImagesView image in fullscreenThe study found two years of war had led to ‘enormous nutritional consequences’ for tens of thousands of children across Gaza. Photograph: Anadolu/Getty Images\n\n# Almost 55,000 preschool children in Gaza acutely malnourished, Lancet study estimates\n\nStudy shows clear link between Israeli aid restrictions and malnutrition among children aged between six months and five years\n\n- Gaza ceasefire plan live – latest updates\n\nAlmost 55,000 children under the age of six in Gaza are estimated to be acutely malnourished, far more than have so far been identified as victims of the potentially lethal condition, a study published in the Lancet, the respected international medical periodical, has revealed.The study, published on Wednesday, and led by the UN Relief and Works Agency for Palestine Refugees (Unrwa), offers a month-by-month breakdown through much of the two-year conflict, and shows for the first time a clear link between Israeli restrictions on supplies entering Gaza and levels of malnutrition among children.Almost 55,000 children could be malnourished in GazaIsrael has repeatedly denied blame for any hunger in Gaza, saying that it allows adequate food into the territory and claiming that the humanitarian agencies there are ineffective.The research comes amid cautious optimism that indirect talks between Hamas and Israel under way in Egypt could lead to an end to the war.Young lives cut short on an unimaginable scale: the 18,457 children on Gaza’s list of war deadRead moreThe 21-point plan under discussion in Sharm el-Sheik, the Red Sea resort, was announced last week by Donald Trump. It calls for a ceasefire, the return of hostages still held by Hamas and a surge of aid into Gaza “without interference … through the United Nations and its agencies, and the Red Crescent”.Dr Akihiro Seita, the Unrwa director of health and an author of the study, said more malnourished children would die unless there was an end to hostilities and “unimpeded, competent, international humanitarian nutritional, medical, economic and social services”.The study found two years of war had led to “enormous nutritional consequences” for tens of thousands of children across Gaza.Researchers used measurements of the circumference of the arms of 220,000 children aged between six months and five years old in Gaza between January 2024, and August 2025, when famine was declared in parts of Gaza by a UN-backed panel of independent experts.In January 2024, 5% of children screened showed evidence of wasting, rising to nearly 9% six months later, researchers found. After Israel imposed severe aid restrictions from the end of 2024, the prevalence of wasting had almost doubled by January 2025.When a six-week ceasefire allowed more aid to enter Gaza, wasting declined significantly before Israel imposed a tight 11-week blockade in March. Though these restrictions were eased in May 2025, levels of wasting among screened children soared to nearly 16%, with almost a quarter of these suffering severe acute malnutrition, the most dangerous form of the condition.Among the estimated total population of Gaza, this is equivalent to more than 54,600 children up to six years old who need emergency nutrition and medical care, including 12,800 severely wasted children, the researchers said.Israel has accused Hamas of looting much of the aid reaching Gaza, but has not provided evidence of any significant amount of theft by the Islamist militant organisation. Cogat, the Israeli agency that controls the entry of aid into Gaza, also accused Hamas of deliberately preventing civilians accessing aid by firing rockets at aid distribution sites.View image in fullscreenPalestinians, including children, wait with pots to receive hot meals distributed by charity organisations on 25 September. Photograph: Anadolu/Getty ImagesBetween May and July, more than 1,400 Palestinians were killed seeking humanitarian assistance in Gaza, 859 in the vicinity of sites run by the US- and Israel-backed Gaza Humanitarian Foundation and 514 along the routes of food convoys, according to the UN, which said that most of the killings were committed by the Israeli military.Aid agencies say Israeli restrictions prevent much of the aid getting into Gaza, and conditions created by the war and Israeli strategic decisions have made it almost impossible for them to operate.Dr Masako Horino, nutrition epidemiologist at Unrwa and lead scientist for the study, said that evidence from before the war indicated that children in Palestinian refugee families in the Gaza Strip were already “food insecure” but were only marginally underweight.“Following two years of war and severe restrictions in humanitarian aid, tens of thousands of preschool aged children in the Gaza Strip are now suffering from preventable acute malnutrition and face an increased risk of mortality,” Horino said.Leading child health experts and paediatricians said the study was particularly “notable and important” because it was the first major medical study to reveal the extent of malnutrition among children in Gaza after two years of war.Writing in a comment piece in the Lancet, Zulfiqar Bhutta, Jessica Fanzo, and Paul Wise, who were not involved in the research, said: “It is now well established that the children of Gaza are starving and require immediate and sustained humanitarian assistance. The study by Horino and colleagues provides some of the most definitive evidence to date of this effect.”Bhutta, of the Hospital for Sick Children in Canada, Fanzo, of Columbia University and Wise, of Stanford University, also praised the researchers for using scientific evidence “to show grievous, preventable harm to children”.“These temporal data strongly suggest that restrictions on food and assistance have resulted in severe malnutrition among children in the Gaza Strip, a reality that will undoubtedly impact their future health and development outcomes for generations.”Although attention has mostly focused on the short-term outcomes of starvation, there should also be “serious concern” over its long-term health effects, which included “inordinately high risks of non-communicable diseases”, they added.On Tuesday, Cogat said it “continues to support international organisations facilitating food delivery and production for Gaza’s civilian population”.The study found that in Rafah, the southern city in Gaza, there was a fourfold increase in wasting malnutrition after Israel launched a massive offensive into the city and levelled it. There was then a sharp decline in April 2025 after the short-lived ceasefire.In Gaza City, prevalence of wasting malnutrition rose more than fivefold from March 2025, reaching almost 30% in mid-August 2025.James Elder, a spokesperson for Unicef, said last week that there was “a lot of panic, a lot of very hungry people” in Gaza City.“It is very difficult to describe the levels of desperation there. There are tens of thousands of children. About two-thirds of people just can’t leave. There are pregnant women eating a meal a day. More aid trucks are coming in but it is a fraction of what we need,” Elder said.Unrwa, which was founded in 1949 to provide essential services for Palestinian refugees who had fled or been expelled during the wars surrounding the foundation of Israel, has been accused by Benjamin Netanyahu, Israel’s prime minister, of being “perforated by Hamas” and banned by Israel. Unrwa denied the allegations and was cleared by UN investigators.\n\nExplore more on these topics\n\n- [Gaza](https://www.theguardian.com/world/gaza) - [Palestine](https://www.theguardian.com/world/palestinian-territories) - [Middle East and north Africa](https://www.theguardian.com/world/middleeast) - [Malnutrition](https://www.theguardian.com/global-development/malnutrition) - [Israel-Gaza war](https://www.theguardian.com/world/israel-hamas-war) - [Children](https://www.theguardian.com/society/children) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMore on this story\n\n## More on this story\n\n- Hamas will be disarmed, Netanyahu vows after ceasefire begins - ‘Trump is like a juggernaut’: how the Gaza ceasefire deal was done - ‘Everyone is still afraid’: ceasefire deal brings relief to Gaza but fears remain over future - Israel’s government approves hostage and ceasefire deal – as it happened - Hamas and Israel prepare to implement ceasefire as Netanyahu says deal approved by government - First phase of ceasefire deal to end war in Gaza agreed by Israel and Hamas - Gaza ceasefire deal: what has been agreed for first phase and why now? - Two years of displacement and destruction in Gaza – photo essay - Tears of joy and celebratory gunfire: how Gaza and Israel reacted to news of ceasefire deal\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Colombia's president says boat struck by US was carrying Colombians",
      "url": "https://www.bbc.com/news/articles/c89dz920p0do?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/4f8e/live/a6b717d0-a527-11f0-92db-77261a15b9d2.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20251007-082128-301112d266-web-2.31.2-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/098e/live/cc8e97d0-a527-11f0-b741-177e3e2c2fc7.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/8280/live/2fa7e690-a5e2-11f0-92db-77261a15b9d2.jpg.webp",
        "4": "https://ichef.bbci.co.uk/news/480/cpsprodpb/47f0/live/ffaa27b0-a5f4-11f0-af09-bf7f0464c1dc.jpg.webp"
      },
      "content": "# Colombia's president says boat struck by US was carrying Colombians\n\nColombian President Gustavo Petro has said that a boat recently bombed by the US was \"Colombian with Colombian citizens inside\", an allegation the White House called \"baseless\".\n\nThe US has struck at least four vessels in the Caribbean in recent weeks, killing 21 people. The US government has said the strikes in international waters were targeting \"narco-traffickers\".\n\nBut it has not provided evidence or details about who or what is aboard, and the strikes have attracted condemnation in countries in the region amid concerns they breach international law.\n\nThe US Senate rejected a measure on Wednesday that would have barred President Donald Trump from using military force against the boats.\n\nPetro replied to a post on X by US Senator Adam Schiff, a Democrat, who said he would vote to block strikes against vessels in the Caribbean as some lawmakers sought to challenge the use of the armed forces in Congress.\n\nThe Colombian president said that a \"new war scenario has opened up: the Caribbean\".\n\nPetro added that \"indications show that the last boat bombed was Colombian with Colombian citizens inside it.\n\n\"I hope their families come forward and report it. There is no war against smuggling; there is a war for oil and it must be stopped by the world. The aggression is against all of Latin America and the Caribbean.\"\n\nPetro did not provide further details about the alleged identities of those on board. The US has not commented on the identities of the individuals killed in the strikes.\n\nThe White House said in a statement that it \"looks forward to President Petro publicly retracting his baseless and reprehensible statement\".\n\nIt said that while the two nations had \"policy differences\", the US remained \"committed to close co-operation on a range of shared priorities, including regional security and stability\".\n\nSpeaking on Thursday at the EU Global Gateway Forum in Brussels, Petro said he had asked for all Caribbean foreign ministers to meet over the strikes.\n\nThe US says its strikes, which began on 2 September, had targeted vessels off the coast of Venezuela that it alleges were carrying illegal drugs.\n\n- First US strike on 'Venezuela drug boat': Was it legal?\n\n- What is Trump's goal after bombing 'Venezuela drugs boat'?\n\nThe measure considered by the Senate on Wednesday, which would have required Trump to seek congressional approval for the strikes, was rejected in a 48-51 vote.\n\nIt had been introduced by Democratic Senators Schiff and Tim Kaine. The vote broke down mostly along partisan lines.\n\nEarlier this month, a leaked memo sent to Congress said that the US was now categorising itself as being in a \"non-international armed conflict\".\n\nFraming this as an active armed conflict is likely a way for the administration to justify the use of wartime powers, including killing \"enemy fighters\", even if they pose no violent threat.\n\nTrump has already designated many cartels, including in Mexico, Ecuador and Venezuela, as terrorist organisations – granting US authorities more powers in their response to them.\n\n## Four killed in latest US strike on alleged drug vessel near Venezuela\n\n## Colombia's president calls US attacks on alleged drug boats 'act of tyranny'\n\n## US forces strike third alleged drug vessel killing three, Trump says",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "‘He deserves it’: Israeli PM Netanyahu says Trump should get Nobel Peace Prize - The Hindu",
      "url": "https://www.thehindu.com/news/international/israel-netanyahu-trump-nobel-peace-prize-gaza-hamas-ceasefire-talks/article70144446.ece?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://th-i.thgim.com/public/incoming/dzkzbl/article67957079.ece/alternates/LANDSCAPE_1200/2024-03-10T225922Z_428463299_RC2656AFAEQN_RTRMADP_3_ISRAEL-PALESTINIANS-NETANYAHU.JPG"
      },
      "content": "# ‘He deserves it’: Israeli PM Netanyahu says Trump should get Nobel Peace Prize\n\n## In July this year, Mr. Netanyahu had handed the U.S. President a nomination letter during a meeting at the White House.\n\nUpdated - October 09, 2025 08:11 pm IST - Jerusalem\n\nIsraeli Prime Minister Benjamin Netanyahu. File | Photo Credit: Reuters\n\nIsraeli Prime Minister Benjamin Netanyahu on Thursday (October 9, 2025) said Donald Trump should be awarded the Nobel Peace Prize, hours after the U.S. president announced a ceasefire and hostage release deal between Israel and Hamas.\n\nGive @realDonaldTrump the Nobel Peace Prize - he deserves it! 🏅 pic.twitter.com/Hbuc7kmPt1\n\n\"Give @realDonaldTrump the Nobel Peace Prize — he deserves it!\" said a post on the official X account of the Office of the Prime Minister of Israel.\n\nIn July this year, Mr. Netanyahu told Mr. Trump that he had nominated him for the Nobel Peace Prize, handing him a nomination letter during a meeting at the White House.\n\nPublished - October 09, 2025 07:45 pm IST\n\nWorld / USA / Donald Trump / Israel / Israel-Palestine Conflict / award and prize / diplomacy\n\n- Access 10 free stories every month\n\n- Save stories to read later\n\n- Access to comment on every story\n\n- Sign-up/manage your newsletter subscriptions with a single click\n\n- Get notified by email for early access to discounts & offers on our products",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Global News Podcast - Podcast - Apple Podcasts",
      "url": "https://podcasts.apple.com/us/podcast/global-news-podcast/id135067274?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://is1-ssl.mzstatic.com/image/thumb/Podcasts221/v4/84/57/09/8457093f-677a-d6de-5666-6514cc588a7e/mza_17083078915388787537.jpg/1200x1200bf-60.jpg",
        "1": "https://podcasts.apple.com/assets/app-icons/podcasts-icon_512.png"
      },
      "content": "Global News Podcast\n\nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight. Get the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment. Get in touch: globalpodcast@bbc.co.uk\n\nGazans return to ruined homes after ceasefire\n\nIsrael approves Gaza ceasefire plan\n\nIsraeli cabinet voting on landmark Gaza deal\n\nGaza ceasefire and hostage release agreed\n\nTrump: Gaza ceasefire deal has been reached\n\nHopes of progress in Gaza peace talks\n\nUS National Guard troops arrive in Illinois\n\nPeace talks continue two years after October 7th attacks\n\n- Channel BBC - Creator BBC World Service - Years Active 2006 - 2025 - Episodes 2.2K - Rating Clean - Copyright © (C) BBC 2025 - Show Website Global News Podcast - Provider BBC Studios Distribution Limited",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Israel’s government approves hostage and ceasefire deal – as it happened | Gaza | The Guardian",
      "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/cdda159ceb1a4254cd568d6834fcad6c544c5282/481_0_4797_3838/master/4797.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=143441e5c6594ce75c3aa8b6fb28f8ec",
        "1": "https://i.guim.co.uk/img/media/cdda159ceb1a4254cd568d6834fcad6c544c5282/481_0_4797_3838/master/4797.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&s=27320315acac94267c77acc9ff8a495a"
      },
      "content": "Middle East crisis liveGaza\n\n# Israel’s government approves hostage and ceasefire deal – as it happened\n\nThis live blog is now closed, you can read our latest report here. Updated 16h agoNick Visser (now); Adam Fulton ,Lucy Campbell, Fran Lawther, Tom Ambrose and Amy Sedghi (earlier)Thu 9 Oct 2025 20.42 EDTFirst published on Thu 9 Oct 2025 00.17 EDTShare",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win? | Donald Trump News | Al Jazeera",
      "url": "https://www.aljazeera.com/news/2025/10/9/nobel-peace-prize-2025-what-are-trumps-credentials-and-can-he-win?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T142411Z_1284592287_RC2G2HAJR6AR_RTRMADP_3_EUROPE-STOCKS-HEALTHCARE-1759485521.jpg?resize=1920%2C1440",
        "1": "https://www.aljazeera.com/wp-content/uploads/2025/10/2025-10-01T142411Z_1284592287_RC2G2HAJR6AR_RTRMADP_3_EUROPE-STOCKS-HEALTHCARE-1759485521.jpg?resize=770%2C513&quality=80",
        "2": "https://www.aljazeera.com/wp-content/uploads/2024/11/Priyanka-Shankar-1730834495.jpeg?resize=96%2C96&quality=80"
      },
      "content": "Nobel Peace Prize 2025: What are Trump’s credentials, and can he win? | Donald Trump News | Al Jazeera\n\nSince beginning his second term, US President Donald Trump has made it clear that he believes he should win the Nobel Peace Prize [File: Ken Cedeno/Reuters]\n\nBy Priyanka ShankarPublished On 9 Oct 20259 Oct 2025Click here to share on social mediashare2SharefacebooktwitterwhatsappcopylinkSave\n\nAs the Norwegian Nobel Committee prepares to announce this year’s winner of the [Nobel Peace Prize](https://www.aljazeera.com/news/2025/10/6/nobel-prize-2025-what-they-are-when-will-the-awards-be-announced), one name, one persona hovers over its decision – the United States president, Donald Trump.\n\nSince stepping into office in January, Trump has made it clear that he believes he should win the coveted prize since he has, he claims, ended at least “seven wars”.\n\n## Recommended Stories\n\nlist of 3 items\n\n- list 1 of 3[Does a Trump-brokered deal squeeze Russia, Iran out of the South Caucasus?](https://www.aljazeera.com/news/2025/8/13/how-does-trumps-tripp-deal-squeezes-russia-iran-out-of-south-caucasus) - list 2 of 3[Trump’s Diplomacy: Peacemaker or Political Prestige?](https://www.aljazeera.com/video/fact-check/2025/8/27/trumps-diplomacy-peacemaker-or-political-prestige) - list 3 of 3[Trump urges Gaza war to end ‘immediately’ in UN General Assembly speech](https://www.aljazeera.com/news/2025/9/23/trump-calls-for-gaza-war-to-stop-immediately-in-unga-speech)\n\nend of list\n\nOn Wednesday, he put himself in the front seat to claim credit for the possible end to an eighth war, after Israel and Hamas agreed to the first stage of a ceasefire deal that is rooted in Trump’s 20-point peace plan, which he had unveiled last week.\n\nThis year’s award announcement also comes amid Russia’s ongoing war in Ukraine and conflicts in many other countries.\n\nThere are 338 nominees for the prize, and the Nobel Committee — a group of five people selected by the Storting, the Norwegian parliament— picks the winner.\n\nIs Trump qualified to win the prize? Here’s what we know:\n\n## Why does Trump say he deserves the Nobel Peace Prize?\n\nSpeaking at the United Nations General Assembly (UNGA) in New York in September, Trump said, “Everyone says I should get the Nobel Peace Prize.”\n\n“I ended seven wars. No president or prime minister has ever done anything close to that,” he added.\n\nTrump noted that the wars he ended include Cambodia and Thailand; Kosovo and Serbia; the Democratic Republic of the Congo (DRC) and Rwanda; Pakistan and India; Israel and Iran; Egypt and Ethiopia; and Armenia and Azerbaijan.\n\n## What are Trump’s credentials?\n\nSome of the wars Trump claims to have ended are ones he participated in himself. His role in some other ceasefires is disputed. Still, there are other conflicts where the involved parties do credit him with playing a key role as mediator.\n\nAdvertisement\n\n- In September, Trump said he “deserved” to win the prize for the possibility of ending **Israel’s two-year-long war on Gaza**. While US weapons and the country’s ironclad diplomatic support for Israel have been critical in allowing the war to continue, Trump is also widely believed to have pressured Israeli Prime Minister Benjamin Netanyahu more than his predecessor, Joe Biden, to end the fighting. Last week, Trump unveiled his 20-point peace plan. Now, with the announcement of a ceasefire deal between Israel and Hamas, the war is the closest it has been to its conclusion. - The war between **Iran and Israel** in June ended with a ceasefire brokered by Trump. But the bout of fighting, which started with Israel striking Iranian nuclear facilities, killing scientists and bombing residential neighbourhoods, also included the US as an active participant. Trump [took part](https://www.aljazeera.com/news/2025/6/22/us-joins-israel-in-attacks-against-iran-strikes-key-nuclear-sites) in it by ordering his military to strike three Iranian nuclear sites. Iran struck back by hitting the largest US military base in the Middle East, in Qatar, before the ceasefire was announced. - In May, **India and Pakistan** waged an aerial war, bombing each other’s military bases. India said it also hit “terrorist” bases in Pakistan and Pakistan-administered Kashmir, while Pakistan claimed India killed dozens of civilians. Ultimately, Trump announced a ceasefire after four days of fighting. But while Pakistan credits the US president for helping halt the fighting, [India insists he had no role](https://www.aljazeera.com/video/the-bottom-line/2025/9/7/how-did-india-us-relations-decline-so-suddenly). - **Cambodia and Thailand** saw five days of hostilities in August, and a [truce](https://www.aljazeera.com/news/2025/8/7/cambodia-nominates-trump-for-nobel-prize-after-thai-border-truce) began after phone calls from not only Trump, but also mediation from Malaysian Prime Minister Anwar Ibrahim and a delegation of Chinese negotiators. So far, only Cambodia has thanked Trump for his role. - Relations between **Serbia and Kosovo** have been tense since the early 2000s. The European Union and NATO have always been key mediators in this region. Kosovo and Serbia signed a deal in 2020 under Trump during his first term. While relations remain tense, the two have not been involved in a full-blown war since Trump’s return to power. - Trump says he ended a war between **Egypt and Ethiopia.** But while the two nations have had tense relations, especially over a hydroelectric dam which opened on a tributary of the Nile River, they have not been in any war. - **Rwanda and the DRC** signed a peace deal in June, brokered by Trump. The ceasefire is fragile and tensions between the two countries remain high, but the deal is holding for now. - In August, Trump oversaw a peace agreement between **Armenia and Azerbaijan** at the White House, which promises to end a simmering conflict that often exploded into open war since the dissolution of the Soviet Union in 1991. But in a subsequent interview with Fox & Friends, Trump appeared confused about the countries he had mediated between. He told his hosts that he had ended a war between Azerbaijan and Albania.\n\nAdvertisement\n\n“I would be surprised if President Trump will be awarded this year’s peace prize as he has not yet made a substantial enough contribution to peace to win the prize,” Nina Graeger, director of the Peace Research Institute Oslo, told Al Jazeera.\n\n“While he deserves credit for his efforts to end the war in Gaza, it is too early to tell whether the peace proposal will be implemented and lead to lasting peace,” she said.\n\n## Why does Trump want the Nobel Prize?\n\nTrump says he deserves it — and many of his supporters agree. But the US president has also often compared his foreign policy initiatives with the global recognition that former US President Barack Obama received during his stint in power.\n\nObama [won](https://www.nobelprize.org/prizes/peace/2009/obama/facts/) the Nobel Peace Prize in 2009 “for his extraordinary efforts to strengthen international diplomacy and cooperation between peoples” — even though he had been in power for only a few months at that point. Obama’s win has long been criticised, given his role in expanding the use of drone attacks overseas, including against US citizens, and his continuation of multiple wars around the world.\n\n“If I were named Obama, I would have had the Nobel Prize given to me in 10 seconds,” Trump said last year.\n\nAccording to Norwegian newspaper Dagens Naeringsliv, in July, Trump also called Norway’s Finance Minister Jens Stoltenberg — the former NATO chief — to discuss tariffs and lobby for the Nobel Peace Prize.\n\n## But hasn’t Trump also been an aggressor?\n\nGraeger said when it comes to selecting a winner, the Nobel Committee may want to look at the sum of a candidate’s efforts towards peace.\n\n“Trump’s retreat from international institutions, wish to take over Greenland from the Kingdom of Denmark, a NATO ally, as well as infringements on basic democratic rights within his own country, do not align well with the will of Alfred Nobel,” she said.\n\nBesides participating in bombing Iran together with Israel in June, Trump also ordered US forces to attack [Somalia](https://www.aljazeera.com/news/2025/6/24/under-trump-us-strikes-on-somalia-have-doubled-since-last-year-why) in February, claiming he was targeting senior ISIL (ISIS) leadership in that country.\n\nIn March, he launched large-scale strikes on [Yemen’s Houthis](https://www.aljazeera.com/news/2025/4/20/houthis-say-us-bombs-yemen-again-targeting-capital-sanaa) over the group’s Red Sea attacks, and in September, he ordered US forces to [strike boats](https://www.aljazeera.com/news/2025/10/8/activists-warn-trumps-caribbean-boat-strikes-risk-regional-war) in the Caribbean, including at least three originating from Venezuela, claiming they were ferrying drug smugglers and narcotics to the US.\n\nThe US president has also threatened to annex Greenland, Canada and the Panama Canal.\n\n## Is violence a no-no for Nobel Peace Prize winners?\n\nThe Nobel Peace Prize, established under the will of Sweden’s Alfred Nobel, is given to “the person who shall have done the most or the best work for fraternity between nations, the abolition or reduction of standing armies and for the holding and promotion of peace congresses”.\n\nBut in reality, the prize is shrouded in controversy.\n\nIn 1973, US Secretary of State Henry Kissinger was one of its winners, for negotiating a ceasefire and ending the US’s Vietnam War. But Kissinger had wrecked earlier ceasefire efforts, prolonging the war. The carpet bombing campaign he oversaw in Cambodia under President Richard Nixon killed hundreds of thousands of people. Nixon also backed Pakistan’s massacres in present-day Bangladesh as the latter’s independence movement reached its crescendo in 1971. Kissinger and Nixon also funnelled millions of dollars into enabling a military coup against the democratically elected president of Chile, Salvador Allende. And after he won the Nobel, Kissinger in 1975 also greenlit Indonesian President Soeharto’s invasion of East Timor. Soeharto was a critical Cold War ally of the US.\n\nAdvertisement\n\nIn 1994, then-Israeli Foreign Minister Shimon Peres won the Nobel alongside his Prime Minister Yitzhak Rabin and then-Palestinian President Yasser Arafat for the signing of the 1993 Oslo Accords. Peres had been prime minister previously, would become PM again in 1995, and was later also Israel’s president.\n\nBut four decades earlier, as deputy director general of Israel’s Defence Ministry, Peres had helped plan the Suez War. During his premiership in the 1980s, Israel also launched a long-range missile attack on the office of the Palestinian Liberation Organization (PLO) in Tunisia.\n\nMyanmar’s pro-democracy icon Aung San Suu Kyi won the prize in 1991. But decades later, calls grew for the award to be withdrawn over her role overseeing massacres against the Rohingya, when she was the country’s de facto leader between 2016 and 2021.\n\nAnd then there is Obama. “When Barack Obama received the prize in 2009, critics argued that it was premature, as he had been in office for less than a year and had not yet shown concrete results in promoting peace,” Graeger said.\n\n“When awarding the prize to Obama, they emphasised his visions regarding the importance of multilateral diplomacy and disarmament, and one could argue that he represented a reset of international relations and cooperation,” she added.\n\nAll of these choices, Graeger said, do shed light on the boundaries the Nobel Committee is willing to push in choosing the winner of the prize.\n\n“While the Nobel Committee does not set out to cause controversy, they do not shy away from it if they feel they have a laureate who is deserving of the Prize,” she said.\n\n## So can Trump still win — and who has endorsed him?\n\nNominations for the 2025 Nobel Peace Prize closed on January 31, just days after Trump returned to the White House.\n\nIn July, Netanyahu said he nominated Trump for the prize, followed by Cambodia’s Prime Minister Hun Manet in August. Armenian Prime Minister Nikol Pashinyan and Azerbaijani President Ilham Aliyev also jointly endorsed Trump for the prize in August.\n\nWithin the president’s cabinet, Steve Witkoff, his chief envoy to the Middle East, has said Trump was “the single finest candidate” for the prize. US Representative Buddy Carter, a Republican, also sent a letter to the Norwegian Nobel Committee in September. US pharmaceutical company Pfizer’s CEO, Albert Bourla, also said Trump deserves the prize.\n\nBut nominations made after July 31 will count for the 2026 Nobel Peace Prize, according to the rules of the Nobel Committee. The government of Pakistan has already nominated Trump for the prize for next year.\n\nAl Jazeera asked the Norwegian organisers of the prize whether Trump’s candidacy was under consideration, but there has been no response as yet.\n\n## What could happen if Trump does not win?\n\nSpeaking at a US military meeting in Virginia in September, Trump said it would be “a big insult to America” if he were not given the award.\n\n“They’ll give it to some guy that didn’t do a damn thing … they’ll give it to the guy who wrote a book about the mind of Donald Trump,” he said.\n\nWithin Norway, questions have arisen over how Trump might respond if he does not win. The US has already imposed 15 percent tariffs on the country’s exports.\n\nThe Trump administration also told CNBC last month that the US is “very troubled” after Norway — which has an approximately $2 trillion sovereign fund — announced it would divest from US company Caterpillar over its links to Israel’s war on Gaza.\n\nBut in an interview with Bloomberg on October 3, Foreign Minister Espen Barth Eid said Norway’s government is not involved in the Nobel Peace Prize decisions.\n\nAdvertisement\n\n“It’s simply up to the Nobel Committee. It’s important to remember it’s an independent committee,” he said.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Gaza ceasefire deal: US deploys 200 troops to Israel; sets up coordination center for humanitarian aid - The Times of India",
      "url": "https://timesofindia.indiatimes.com/world/us/gaza-ceasefire-deal-us-deploys-200-troops-to-israel-sets-up-coordination-center-for-humanitarian-aid/articleshow/124440310.cms?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124440585,width-1070,height-580,imgsize-1721588,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/msid-124440585,imgsize-1721588,width-400,resizemode-4/pic-18.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-42920,msid-124441796,width-375,resizemode-4/124441796.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-28812,msid-124441996,width-375,resizemode-4/124441996.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-107272,msid-124411720,width-375,resizemode-4/124411720.jpg"
      },
      "content": "# Gaza ceasefire deal: US deploys 200 troops to Israel; sets up coordination center for humanitarian aid\n\nThe United States is sending about 200 troops to Israel to help monitor and support the Gaza ceasefire deal, officials said Thursday. The mission will be part of a wider team that includes partner nations, nongovernmental organisations, and private sector participants.Tired of too many ads?go ad free nowAccording to officials who spoke to AP on condition of anonymity to discuss details not yet authorised for release, US Central Command will establish a “civil-military coordination center” in Israel. The center will facilitate the flow of humanitarian aid and coordinate logistical and security assistance for Gaza, which has been devastated by two years of war.Hamas Surprises Israel Army During ‘Escape’; IDF Caught In Trap, Hit By Deadly AmbushThe coordination center will include around 200 US service members with expertise in transportation, planning, security, logistics, and engineering, one official said.The official emphasised that no American troops will be sent into Gaza.A second official said the troops will come from US Central Command and other global locations. Some personnel have already begun arriving and will continue to travel to the region over the weekend to begin planning and setting up the new center.The announcement provides some of the first details on how the ceasefire deal will be monitored and outlines the US military’s role in that effort. After Israel and Hamas agreed this week to the first phase of a Trump administration plan to end the fighting, questions remain about Hamas disarmament, the withdrawal of Israeli forces, and the establishment of a future civilian government in Gaza.One of the officials said the new team will help oversee implementation of the ceasefire agreement and support the transition to a civilian government in the territory, reported AP.\n\n##### About the Author\n\nTOI World Desk\n\nAt TOI World Desk, our dedicated team of seasoned journalists and passionate writers tirelessly sifts through the vast tapestry of global events to bring you the latest news and diverse perspectives round the clock. With an unwavering commitment to accuracy, depth, and timeliness, we strive to keep you informed about the ever-evolving world, delivering a nuanced understanding of international affairs to our readers. Join us on a journey across continents as we unravel the stories that shape our interconnected world.Read More",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "‘Trump is like a juggernaut’: how the Gaza ceasefire deal was done | Gaza | The Guardian",
      "url": "https://www.theguardian.com/world/2025/oct/09/how-the-gaza-ceasefire-deal-was-done-donald-trump?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/2471218054af851ea58b7807f028216b848dfa2f/393_0_3204_2563/master/3204.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9399eb4be7ca99f078ac567301c74f1",
        "1": "https://i.guim.co.uk/img/media/2471218054af851ea58b7807f028216b848dfa2f/393_0_3204_2563/master/3204.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=25bd80ef88e3c38b3a030d31aa51ccc6",
        "2": "https://i.guim.co.uk/img/media/2471218054af851ea58b7807f028216b848dfa2f/393_0_3204_2563/master/3204.jpg?width=465&dpr=1&s=none&crop=none",
        "3": "https://i.guim.co.uk/img/uploads/2017/10/09/Patrick-Wintour,-R.png?width=75&dpr=1&s=none&crop=none",
        "4": "https://i.guim.co.uk/img/media/ed72ea0448f755409df6428d6c021dd5a7c47db2/346_0_5307_4245/master/5307.jpg?width=445&dpr=1&s=none&crop=none"
      },
      "content": "Trump with Benjamin Netanyahu in Washington last week. The US president’s mood towards Israel shifted after the IDF launched an attack in Doha. Photograph: Jim Lo Scalzo/EPAView image in fullscreenTrump with Benjamin Netanyahu in Washington last week. The US president’s mood towards Israel shifted after the IDF launched an attack in Doha. Photograph: Jim Lo Scalzo/EPA\n\n# ‘Trump is like a juggernaut’: how the Gaza ceasefire deal was done\n\nSidelines chat at UN was turning point for US president, but others also have right to claim role in end of two-year war\n\nIt is a well-known adage in politics that success has many parents, but failure is an orphan. Except when Donald Trump is involved, in which case there is only one parent.Nevertheless, many countries and individuals have a right to step forward to claim an authorial role in the deal that it is hoped will bring an end to the two-year war in Gaza.But it is a sign of the collective nature of the effort of the past few months that so many can credibly claim a role, including the US president, who after many false starts was finally persuaded to focus, end the fantasy of driving tens of thousands of Palestinians from their homeland and instead spell out to Benjamin Netanyahu the versions of victory the Israeli prime minister could and could not have.The turning point was a meeting in New York on the sidelines of the UN general assembly chaired by Trump, soon after his baroque speech to the gathering. Trump described the sidelines chat as his most important meeting at the UN. In the encounter organised by the United Arab Emirates, he set out for the first time his then 20-point plan for peace in front of a group of Arab and Muslim states that could form the backbone of any stabilisation force that entered Gaza in the event of a ceasefire.By then Trump, with the help of his son-in-law Jared Kushner and the former British prime minister Tony Blair, had been convinced to change his mind on two critical issues. First, Palestinians should not be driven from Gaza and Israel should not rule the territory. “Gaza should be for Gazans,” one said.That meant Trump dropping the displacement rhetoric he deployed earlier in the year, when he triggered widespread alarm by speaking of plans to develop a “Gaza Riviera”.View image in fullscreenPalestinians celebrate in Khan Younis after Donald Trump announced Israel and Hamas had agreed on the first phase of a Gaza ceasefire. Photograph: Ramadan Abed/ReutersSecondly, Trump was persuaded a “day after” plan for the future of Gaza would not complicate the negotiations on a ceasefire-hostage release agreement by adding new contested ingredients, but was the precondition for success. A UK diplomat explained Blair’s thinking: “Hamas was not going to give up unless it knew the Israelis were going to get out and the Israelis were not going to get out and stop occupying Gaza unless they knew Hamas were not going to be in government. Unless you resolved the question of who governs Gaza you cannot bring the thing to an end.”That in turn made it easier for the Arab states to put political pressure on Hamas to negotiate since they could point to a route towards Palestinian statehood, something that has always been their precondition for reconciliation with Israel. The Arab states had also put their names to demands that Hamas stand aside and disarm.One of those involved in persuading the US president said: “People don’t want to hear this but the advantage of Trump is that once he decides to do something he is like a juggernaut. And he really did put pressure on the Israelis.”Trump’s mood towards Israel was clouded by Netanyahu’s unilateral decision to bomb Doha on 9 September in the hope of wiping out Hamas negotiators. Trump had not been consulted, but the US assurances were met with scepticism. As a result Netanyahu, not a man prone to contrition, was ordered to apologise and say he would respect Qatar’s sovereignty in future.View image in fullscreenSmoke billowing in Doha after Israel carried out airstrikes there last month. Photograph: Jacqueline Penney/AFPTV/AFP/Getty ImagesTo repair relations fully with Qatar, the host of main US airbase in the Middle East, Trump issued an extraordinary executive order saying any future attack on the emirate would be treated as an attack on the US. All this meant the US leader was better disposed to the Gulf states’ vision of a new Middle East. In a sign he was prepared to push the Israeli government hard, in a way Joe Biden had not, Trump told Israel there would be no further annexations in the West Bank.From the very start of the sidelines meeting at the UN in September, the aim of the Arab states was to bind Trump personally into the process. Qatar’s emir, Sheikh Tamim bin Hamad Al Thani, said: “We count on you and your leadership … to end this war and to help the people of Gaza.” He said Israel’s real objective was “to destroy Gaza, to render housing, livelihoods, education, and medical care impossible, stripping away the very foundations of human life”.The concept that Trump personally was central to a solution – indeed its guarantor – flattered the US president who offered himself up as the chair of the peace board, the body that would oversee the reconstruction of Gaza.In one sense, he would be just a name plate, but to the extent he has a hinterland, it is construction. That means there is a possibility he will remain engaged, for the moment at least.Those observing him said Trump began to feel he had a serious opportunity to solve a conflict he variously said had lasted 3,000 or 600 years, in contrast to his failed attempt in Ukraine. The prospect of winning the Nobel peace prize, Trump’s obsession, hovered once more into view.View image in fullscreenPeople celebrate after a peace deal is announced at hostages square in Tel Aviv, Israel, on Thursday. Photograph: Abir Sultan/EPAThat meant that once his plan was published Trump did not let go, but kept the pressure up on Hamas, warning of the group’s annihilation if it did not release the hostages in return for 250 Palestinians. But neither did Trump let Israel backtrack. Speed and momentum became of the essence.It was the seniority of the negotiators who went to the talks in Egypt that revealed the stars were finally aligning and Hamas would be forced into releasing all the hostages it held, even though Israel would not immediately leave all of Gaza. The scenes were extraordinary enough in that the Hamas negotiators were – albeit through mediators – holding talks with a government that had tried to assassinate them a month earlier. By the time they started the participants sensed a deal was unavoidable.The arrival of Kushner, the head of the intelligence office of the Turkish president Recep Tayyip Erdoğan, İbrahim Kalın, and the prime minister of Qatar, Mohammed bin Abdulrahman Al Thani, confirmed a breakthrough was imminent.During the talks, Hamas negotiators led by its leader Khalil al-Hayya, Mohammad al-Hindi, the deputy secretary general of Islamic Jihad, and Jamil Mezher, the deputy secretary general of the Popular Front for the Liberation of Palestine, sought to clarify the names of the Palestinians to be released, the mechanism of the release of the Israeli hostages and the “day after” aspects of the agreement, poring over the maps showing a withdrawal of Israel’s forces.A map of Gaza showing details of the initial area of the IDF withdrawBut Hamas was told while the critical “day after” principles stood, the details would have to wait for a second linked negotiation. The risk for Hamas now is that it loses its leverage upon handing over the hostages – and that fears Israel will then refuse to engage with the plans for Gaza’s future or find a pretext to restart the fighting will be realised. The domestic brake on Netanyahu resuming the fighting – the demand to save the hostages – would have gone.Here Trump’s continued willingness to keep up the pressure on Netanyahu was critical, and is acknowledged by Hamas in its statements referring to the US president as guarantor of the plan. On Fox News, Trump said he had told Netanyahu that “Israel cannot fight the world”, adding: “And he understands that very well.” He said: “You will see people coexisting and Gaza will be rebuilt.”By contrast Amit Segal, a journalist close to Netanyahu, said: “There’s no phase two. That’s clear to everyone, right? Phase two might happen someday, but it’s unrelated to what’s just been signed.”Many elements of Trump’s 20-point plan are being addressed by diplomats from the US, Europe and Arab states at a separate gathering in Paris on Wednesday.View image in fullscreenTrump’s willingness to keep up the pressure on Benjamin Netanyahu was critical. Photograph: Andrew Caballero-Reynolds/AFP/Getty ImagesOn the agenda are issues such as the Hamas handover of weapons; its exclusion from future administrations; the mandate of an international peacekeeping force; the delivery of resumed aid flows; and the future relationship between Gaza and the West Bank as the nucleus of a future Palestinian state. On almost all these, there have been deep differences between Israel on the one hand, and Europe and the Arab states on the other.But in a promising sign, US officials will attend this meeting, suggesting Washington does not favour an armed status quo.At the centre of these discussions is Blair, who is to sit on the peace board or interim government that will oversee the Palestinian technocrats that help implement reconstruction plans. Blair will have to convince the Palestinian Authority that he is not offering a colonial-esque arrangement, as the former prime minister says it fears. But he is unlikely to do the job unless he has real powers, something he feels was not given when he was Middle East special envoy to the quartet.Arab leaders are seeking assurances that the international stabilisation force that eventually enters Gaza has a UN security council mandate, and that there is a clear plan to treat Gaza and the West Bank as one political entity.1:10Marco Rubio passes Trump handwritten note on Gaza peace plan – videoOne of the most difficult issues unresolved in the rushed talks in Egypt is the timing of the Hamas weapons handover. The group may be willing to deliver its arms to an Arab-run authority, or a Palestinian civil police force, but not to Israel. Some diplomats even believe Hamas may feel the need to take a new political course, something it has been close to doing before. “Gazans are going to demand to know what the past two years were about,” one diplomat said.One diplomat involved in the talks said: “The tragedy is that this could have all been agreed 20 months ago, all the elements were there. The key Israeli objective – which is why it is a tragedy this war has gone on so long – was the removal of Hamas from future rule, and that was obtainable a long time ago.”\n\nExplore more on these topics\n\n- [Gaza](https://www.theguardian.com/world/gaza) - [Donald Trump](https://www.theguardian.com/us-news/donaldtrump) - [Israel](https://www.theguardian.com/world/israel) - [Qatar](https://www.theguardian.com/world/qatar) - [United Arab Emirates](https://www.theguardian.com/world/united-arab-emirates) - [US foreign policy](https://www.theguardian.com/us-news/us-foreign-policy) - [Palestine](https://www.theguardian.com/world/palestinian-territories) - [features](https://www.theguardian.com/tone/features)\n\nShareReuse this content\n\nMore on this story\n\n## More on this story\n\n- Hamas will be disarmed, Netanyahu vows after ceasefire begins - ‘Everyone is still afraid’: ceasefire deal brings relief to Gaza but fears remain over future - Israel’s government approves hostage and ceasefire deal – as it happened - Hamas and Israel prepare to implement ceasefire as Netanyahu says deal approved by government - First phase of ceasefire deal to end war in Gaza agreed by Israel and Hamas - Gaza ceasefire deal: what has been agreed for first phase and why now? - Two years of displacement and destruction in Gaza – photo essay - Tears of joy and celebratory gunfire: how Gaza and Israel reacted to news of ceasefire deal\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Man who appealed Pelicot rape conviction handed longer jail term",
      "url": "https://www.bbc.com/news/articles/cq65e2jdd3lo?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://ichef.bbci.co.uk/news/1024/branded_news/caa8/live/2d0a49a0-a524-11f0-adbe-83a1eb509ffb.jpg",
        "1": "https://static.files.bbci.co.uk/bbcdotcom/web/20251007-082128-301112d266-web-2.31.2-2/grey-placeholder.png",
        "2": "https://ichef.bbci.co.uk/news/480/cpsprodpb/caa8/live/2d0a49a0-a524-11f0-adbe-83a1eb509ffb.jpg.webp",
        "3": "https://ichef.bbci.co.uk/news/480/cpsprodpb/75bc/live/71ccfab0-a524-11f0-928c-71dbb8619e94.jpg.webp"
      },
      "content": "# Man who appealed Pelicot rape conviction handed longer jail term\n\nA court in southern France has increased by a year the jail term of the only man who challenged his conviction for raping Gisèle Pelicot.\n\nThe 72-year-old retired grandmother was drugged unconscious by her then-husband Dominique for over a decade and raped by dozens of men he recruited on the internet.\n\nHusamettin Dogan, 44, had argued he was innocent, despite graphic video footage shown in court of him penetrating a motionless Gisèle Pelicot.\n\nBut the court of appeal in Nîmes rejected his argument and extended his original nine-year jail term to 10 years. He was convicted of aggravated rape last December, during a trial in which 50 other men were convicted.\n\nPublic prosecutor Dominique Sié had asked the court to impose a 12-year term on Dogan, who said he himself had been a victim, \"trapped\" by Dominique Pelicot. The prosecutor told the court Dogan had been \"unwilling to take responsibility\" for a \"massive act of destruction of a woman\" that had denied her humanity.\n\nAlthough Dogan was held in pre-trial detention ahead of last year's trial, he has not spent time in jail since.\n\nPolice were able to track down the men who raped Gisèle because of the videos that Dominique Pelicot filmed during the rapes.\n\nOf the 51 men handed jail terms, 17 initially lodged appeals only to withdraw them soon after.\n\nHusamettin Dogan - a Turkish-born married father - was the only one who decided to take his appeal to court.\n\nLike many of the other men convicted last December, Dogan's defence was he could not be guilty of raping Gisèle because he did not realise she had been drugged by her husband against her will.\n\nProceedings in Nîmes were effectively a retrial but, unlike the initial trial last December, this case was judged by a jury made up of nine members of the public and three professional judges.\n\n- Pelicot case returns to court as French women fear nothing has changed\n\n- Gisèle Pelicot and the trial that tore her family apart\n\nEvidence from the first trial was shown again, including videos of the rapes in which an unconscious Gisèle could be heard snoring and having no reaction despite the abuse she was subjected to.\n\nNevertheless, Dogan again denied any intention to rape her even though he acknowledged she was clearly a victim of her husband.\n\n\"I performed a sexual act, I never raped anyone,\" he said. \"For me, rape means forcing someone, tying them up, I don't know… I am a victim.\"\n\nGisèle Pelicot told the court this week \"I am the only victim\", denying she had ever given her consent.\n\nIn an attempt to shift the blame on to Dominique Pelicot, Dogan also said that while at one point he had \"suspicions\" that something about the situation was not quite right, Pelicot had put him at ease. \"This guy is a manipulator,\" he said.\n\nPelicot - who was present in court as a witness - denied he had ever pretended his wife would be anything but unconscious.\n\nAll the men he recruited on chatrooms \"were told she would be drugged\", Pelicot said, adding he had explicitly told Dogan he was looking for \"someone to abuse my sleeping wife without her knowledge\".\n\nGisèle Pelicot's decision to open up the original trial to the public and the media attracted worldwide attention on her story - but as soon as the verdicts came in she retreated back to private life.\n\nThis week was the first time she had been seen in public since then.\n\nWhen she took the stand on Wednesday she recalled the unexplained neurological symptoms and memory loss she had suffered for months, without realising they were the side effects of the drugs Pelicot had plied her with.\n\nShe again stressed she had no knowledge of what her husband subjected her to.\n\n\"The first time I saw [Dogan's] face was when I saw the videos of him raping me,\" she stated. \"They are forever etched in my memory.\"\n\n\"The first time around, this man never accepted to recognise that he had raped me. But I thought that over the course of a year he had gained some introspection,\" she said.\n\nTurning to Dogan, she added: \"You don't understand that this was rape. When will you admit that it's a crime? I am ashamed for you.\"\n\nShe also addressed the devastation that had engulfed her family since the trial.\n\nHer daughter, Caroline Darian, maintains she too was drugged and abused by her father after photos showing her unconscious were found on Pelicot's computer.\n\nMs Darian has since spoken about feeling unsupported by her mother. The two are reportedly no longer in contact and Ms Darian was not in court with Gisèle this week.\n\n\"My family is trying to rebuild itself however it can,\" Gisèle said. \"I hope [Caroline] finds the answers she is looking for. I hope one day we can find each other again.\"\n\nShe also asked to stop being referred to as an icon. \"I am an ordinary woman who dared to open up her trial,\" she said. \"I have become an icon against my will.\"\n\nAs in the original trial, Gisèle ended her statement with a thought for other victims of rape – the majority of whom did not have the wealth of evidence that she had to bring her abusers to court.\n\n\"I want to say to them to never be ashamed of what was inflicted upon us, because it is not their fault,\" she said.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "How Trump pushed through a deal to pause the war in Gaza | AP News",
      "url": "https://apnews.com/article/trump-gaza-war-ceasefire-israel-hamas-819c9999cc4f3157c729fdc5a02f4df5?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://dims.apnews.com/dims4/default/f2cc643/2147483647/strip/true/crop/2072x1166+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F43%2F87d69af753f02741aaa3684e23ed%2F05a178642b6f4fdc9fc2d1c4485e91fb"
      },
      "content": "- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies Two powerful quakes strike off southern Philippines, killing at least 7 people Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize\n\n- Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies\n\n- Two powerful quakes strike off southern Philippines, killing at least 7 people\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm Antifa expert at Rutgers University says he is moving to Spain because of death threats Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment\n\n- The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm\n\n- Antifa expert at Rutgers University says he is moving to Spain because of death threats\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations US Senate unanimously endorses repeal of 2002 Iraq war resolution Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump\n\n- Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations\n\n- US Senate unanimously endorses repeal of 2002 Iraq war resolution\n\n- Sports SECTIONS AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing TOP STORIES Bill Belichick's 1st season at North Carolina has run into problems on and off the field Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- Bill Belichick's 1st season at North Carolina has run into problems on and off the field\n\n- Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta\n\n- Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Kiss rocker Gene Simmons recovering after crashing SUV Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time John Lodge, singer and bassist of Moody Blues during classic era, dies at 82 Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Kiss rocker Gene Simmons recovering after crashing SUV\n\n- Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time\n\n- John Lodge, singer and bassist of Moody Blues during classic era, dies at 82\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about\n\n- Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela\n\n- Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Science\n\n- Fact Check\n\n- Oddities TOP STORIES Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Giant trolls have a message for humans about protecting the planet Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Be Well TOP STORIES How 'The Great Lock In' can help achieve your financial and wellness goals Is spending all day on your feet at work an occupational hazard? A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving Eating the wrong foods can keep you up at night. A new cookbook offers a better plan Cold-water immersion may offer health benefits — and also presents risks\n\n- How 'The Great Lock In' can help achieve your financial and wellness goals\n\n- Is spending all day on your feet at work an occupational hazard?\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Eating the wrong foods can keep you up at night. A new cookbook offers a better plan\n\n- Cold-water immersion may offer health benefits — and also presents risks\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss Democrats are becoming a force in traditionally conservative The Villages 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- Democrats are becoming a force in traditionally conservative The Villages\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem New California law aims to stabilize insurance for people who can't get private coverage\n\n- What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk\n\n- Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem\n\n- New California law aims to stabilize insurance for people who can't get private coverage\n\n- Health TOP STORIES Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it' California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak Western Montana city losing labor and delivery services at one of its two hospitals Senegal records 17 deaths in rare major outbreak of Rift Valley Fever A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it'\n\n- California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak\n\n- Western Montana city losing labor and delivery services at one of its two hospitals\n\n- Senegal records 17 deaths in rare major outbreak of Rift Valley Fever\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature\n\n- California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket\n\n- One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- Lifestyle SECTIONS Food & Recipes Gardening Homes Travel Fashion Pets TOP STORIES The Dubai chocolate craze is now about much more than bars As the garden winds down, it's time to care for winter-prepping birds India's Lakme Fashion Week, in photos\n\n- The Dubai chocolate craze is now about much more than bars\n\n- As the garden winds down, it's time to care for winter-prepping birds\n\n- India's Lakme Fashion Week, in photos\n\n- Religion TOP STORIES Pope Leo condemns economies that marginalize the poor while the wealthy live in a bubble of luxury Pope urges news agencies to stand as bulwark against lies, manipulation and post-truths Pope meets with Chicago union leaders, urges migrant welcome as crackdown underway in hometown Newsletters World of Faith Comprehensive global coverage of how religion shapes our world. See All Newsletters\n\n- Pope Leo condemns economies that marginalize the poor while the wealthy live in a bubble of luxury\n\n- Pope urges news agencies to stand as bulwark against lies, manipulation and post-truths\n\n- Pope meets with Chicago union leaders, urges migrant welcome as crackdown underway in hometown\n\n- Español TOP STORIES Líder opositora venezolana María Corina Machado gana el Premio Nobel de la Paz El papa León critica una economía que margina a los pobres mientras los ricos viven en el lujo Deloitte reembolsará parcialmente al gobierno australiano por reporte con errores generados por IA Despiden a diplomático de EEUU por relación con mujer ligada al Partido Comunista de China El escritor húngaro László Krasznahorkai gana el Premio Nobel de Literatura Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Líder opositora venezolana María Corina Machado gana el Premio Nobel de la Paz\n\n- El papa León critica una economía que margina a los pobres mientras los ricos viven en el lujo\n\n- Deloitte reembolsará parcialmente al gobierno australiano por reporte con errores generados por IA\n\n- Despiden a diplomático de EEUU por relación con mujer ligada al Partido Comunista de China\n\n- El escritor húngaro László Krasznahorkai gana el Premio Nobel de Literatura\n\n- Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- MORE World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game Sports AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing Tennis Tennis Entertainment Movies What to Stream Television Celebrity Interviews Music Books Business Tariffs Inflation Financial Markets Financial Wellness Technology Science Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus Health Tech Artificial Intelligence Social Media Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Most watched videos Standards Quizzes Press Releases My Account AP News Code of Conduct\n\n- World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East\n\n- Israel-Hamas war\n\n- Russia-Ukraine war\n\n- Español\n\n- China\n\n- Asia Pacific\n\n- Latin America\n\n- Europe\n\n- Africa\n\n- Middle East\n\n- U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths\n\n- Immigration\n\n- Weather\n\n- Education\n\n- Transportation\n\n- Abortion\n\n- LGBTQ+\n\n- Notable Deaths\n\n- Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game\n\n- White House\n\n- Congress\n\n- U.S. Supreme Court\n\n- 2025 Election Calendar\n\n- The latest AP-NORC polls\n\n- Ground Game\n\n- Sports AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing Tennis Tennis\n\n- AP Top 25\n\n- NFL\n\n- MLB\n\n- WNBA\n\n- Soccer\n\n- NBA\n\n- NHL\n\n- Auto Racing\n\n- Tennis Tennis\n\n- Entertainment Movies What to Stream Television Celebrity Interviews Music Books\n\n- Movies\n\n- What to Stream\n\n- Television\n\n- Celebrity Interviews\n\n- Music\n\n- Books\n\n- Business Tariffs Inflation Financial Markets Financial Wellness Technology\n\n- Tariffs\n\n- Inflation\n\n- Financial Markets\n\n- Financial Wellness\n\n- Technology\n\n- Science Space Animals The Ancient World Climate Medicine\n\n- Space\n\n- Animals\n\n- The Ancient World\n\n- Climate\n\n- Medicine\n\n- Fact Check\n\n- Oddities\n\n- Be Well\n\n- Newsletters\n\n- Photography 2024 YEAR END PHOTOS Photo Essays Photography\n\n- 2024 YEAR END PHOTOS\n\n- Photo Essays\n\n- Photography\n\n- AP Investigations\n\n- Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus\n\n- Indigenous peoples and climate\n\n- Climate Questions\n\n- Climate Migration\n\n- India Focus\n\n- Health\n\n- Tech Artificial Intelligence Social Media\n\n- Artificial Intelligence\n\n- Social Media\n\n- Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets\n\n- Food & Recipes\n\n- Gardening\n\n- Homes\n\n- Travel\n\n- Fashion\n\n- Pets\n\n- Religion\n\n- Español\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies Two powerful quakes strike off southern Philippines, killing at least 7 people Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize\n\n- Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies\n\n- Two powerful quakes strike off southern Philippines, killing at least 7 people\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm Antifa expert at Rutgers University says he is moving to Spain because of death threats Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment\n\n- The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm\n\n- Antifa expert at Rutgers University says he is moving to Spain because of death threats\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations US Senate unanimously endorses repeal of 2002 Iraq war resolution Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump\n\n- Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations\n\n- US Senate unanimously endorses repeal of 2002 Iraq war resolution\n\n- Sports SECTIONS AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing TOP STORIES Bill Belichick's 1st season at North Carolina has run into problems on and off the field Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- Bill Belichick's 1st season at North Carolina has run into problems on and off the field\n\n- Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta\n\n- Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Kiss rocker Gene Simmons recovering after crashing SUV Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time John Lodge, singer and bassist of Moody Blues during classic era, dies at 82 Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Kiss rocker Gene Simmons recovering after crashing SUV\n\n- Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time\n\n- John Lodge, singer and bassist of Moody Blues during classic era, dies at 82\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about\n\n- Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela\n\n- Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Science\n\n- Fact Check\n\n- Oddities TOP STORIES Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Giant trolls have a message for humans about protecting the planet Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Be Well TOP STORIES How 'The Great Lock In' can help achieve your financial and wellness goals Is spending all day on your feet at work an occupational hazard? A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving Eating the wrong foods can keep you up at night. A new cookbook offers a better plan Cold-water immersion may offer health benefits — and also presents risks\n\n- How 'The Great Lock In' can help achieve your financial and wellness goals\n\n- Is spending all day on your feet at work an occupational hazard?\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Eating the wrong foods can keep you up at night. A new cookbook offers a better plan\n\n- Cold-water immersion may offer health benefits — and also presents risks\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss Democrats are becoming a force in traditionally conservative The Villages 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- Democrats are becoming a force in traditionally conservative The Villages\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem New California law aims to stabilize insurance for people who can't get private coverage\n\n- What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk\n\n- Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem\n\n- New California law aims to stabilize insurance for people who can't get private coverage\n\n- Health TOP STORIES Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it' California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak Western Montana city losing labor and delivery services at one of its two hospitals Senegal records 17 deaths in rare major outbreak of Rift Valley Fever A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it'\n\n- California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak\n\n- Western Montana city losing labor and delivery services at one of its two hospitals\n\n- Senegal records 17 deaths in rare major outbreak of Rift Valley Fever\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature\n\n- California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket\n\n- One Tech Tip: Don't use rice for your device.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Norway braces for Trump’s reaction if he does not win Nobel peace prize | Nobel peace prize | The Guardian",
      "url": "https://www.theguardian.com/world/2025/oct/09/norway-braces-for-trumps-reaction-if-he-does-not-win-nobel-peace-prize?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/b2fbd979b23f35f77b2dbfaa9a76dcbd59d17644/451_0_4491_3592/master/4491.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42c7fec7cd93c88a6bd3ae3b040d7dd8",
        "1": "https://i.guim.co.uk/img/media/b2fbd979b23f35f77b2dbfaa9a76dcbd59d17644/451_0_4491_3592/master/4491.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=f27a00d303ca67fee49796550b44b15f",
        "2": "https://i.guim.co.uk/img/media/b2fbd979b23f35f77b2dbfaa9a76dcbd59d17644/451_0_4491_3592/master/4491.jpg?width=465&dpr=1&s=none&crop=none",
        "3": "https://i.guim.co.uk/img/media/477cadaa4a14029fec60a8d39535fe86fb0129a0/350_0_3500_2800/master/3500.jpg?width=220&dpr=1&s=none&crop=5%3A4",
        "4": "https://i.guim.co.uk/img/media/164c72748acc7193543a6da03f391856a199bd7f/0_0_1920_1536/master/1920.jpg?width=220&dpr=1&s=none&crop=5%3A4"
      },
      "content": "Oslo must be ‘prepared for anything’ if Trump is not awarded the prize, said Kirsti Bergstø, leader of Norway’s Socialist Left party. Photograph: Jim Watson/AFP/Getty ImagesView image in fullscreenOslo must be ‘prepared for anything’ if Trump is not awarded the prize, said Kirsti Bergstø, leader of Norway’s Socialist Left party. Photograph: Jim Watson/AFP/Getty Images\n\n# Norway braces for Trump’s reaction if he does not win Nobel peace prize\n\nUS president may impose tariffs, demand higher Nato contributions or even declare Norway an enemy, analyst says\n\n- Why is Donald Trump so obsessed with winning the peace prize?\n\nWith hours to go until the announcement of this year’s Nobel peace prize, Norwegian politicians were steeling themselves for potential repercussions to US-Norway relations if it is not awarded to Donald Trump.The Norwegian Nobel Committee pointedly said on Thursday that it had reached a decision about who would be named 2025 peace prize laureate on Monday, several days before Israel and Hamas agreed to a ceasefire under the US president’s Gaza plan.Taking into account the timeframe and the composition of the independent five-person committee, most Nobel experts and Norwegian observers believe it is highly unlikely that Trump will be awarded the prize, leading to fears in the country over how he will react to being overlooked so publicly.Need I list all the reasons why Trump shouldn’t get a Nobel peace prize? | Sidney BlumenthalRead moreKirsti Bergstø, the leader of Norway’s Socialist Left party and its foreign policy spokesperson, said Oslo must be “prepared for anything.”“Donald Trump is taking the US in an extreme direction, attacking freedom of speech, having masked secret police kidnapping people in broad daylight and cracking down on institutions and the courts. When the president is this volatile and authoritarian, of course we have to be prepared for anything,” Bergstø told the Guardian.“The Nobel Committee is an independent body and the Norwegian government has no involvement in determining the prizes. But I’m not sure Trump knows that. We have to be prepared for anything from him.”Trump has long been outspoken about his belief that he should be awarded the peace prize, an honour previously bestowed on one of his presidential predecessors, Barack Obama, in 2009 for his “extraordinary efforts to strengthen international diplomacy and cooperation between peoples”.In July, Trump reportedly called Jens Stoltenberg, Norway’s finance minister and the former Nato secretary general, to ask about the Nobel prize. At the UN last month, Trump falsely claimed that he had halted seven “unendable wars”, telling world leaders: “Everyone says I should get the Nobel peace prize.”6:07Fact-checking Donald Trump’s false and misleading claims during his UN address – video Arild Hermstad, the leader of the Green party of Norway, said the Nobel committee’s independence is what gives the prize its credibility.“Peace prizes are earned through sustained commitment, not through social media tantrums and not from intimidation,” he said. “It’s good that Trump supported the recent ceasefire deal between Israel and Hamas. Any step toward ending the suffering in Gaza is welcome. But one late contribution does not erase years of enabling violence and division.”Kristian Berg Harpviken, the director of the Norwegian Nobel Institute, said the decision was finalised at the most recent meeting of the Nobel committee on Monday.Harpviken said decisions were apolitical, although the appointing of committee members by the Norwegian parliament in accordance with the will of Alfred Nobel, who bequeathed the money to fund the prizes that bear his name, may complicate that impression.skip past newsletter promotionafter newsletter promotion“I know first-hand the committee acts completely independently. But Alfred Nobel made it somewhat difficult for us by writing in his will that it must be appointed by the parliament. That, unfortunately, is non-negotiable,” he said.The newspaper columnist and analyst Harald Stanghelle speculated that retribution from Trump – if it were to come – could take the form of tariffs, demands for higher Nato contributions or even declaring Norway an enemy.“He [Trump] is so unpredictable. I don’t want to use the word ‘fear’ but there is a feeling that it could be a challenging situation,” he said. “It’s very very difficult to explain to Donald Trump or to many other countries in the world that it is a totally independent committee because they do not respect this kind of independence.”He said if Trump were to win, it would be the “biggest surprise in the history of the Nobel peace prize”.Nina Græger, the director of the Peace Research Institute Oslo , believes the most likely candidates to win this year’s peace prize include Sudan’s Emergency Response Rooms, the Committee to Protect Journalists and the Women’s International League for Peace and Freedom.“While he [Trump] clearly deserves credit for his efforts to end the war in Gaza, it is still too early to tell whether the peace proposal will be implemented and lead to lasting peace,” Græger said.“Trump’s retreat from international institutions, and his wish to take over Greenland from The Kingdom of Denmark, a Nato ally, as well as infringements on basic democratic rights within his own country, do not align well with Nobel’s will.”\n\nExplore more on these topics\n\n- [Nobel peace prize](https://www.theguardian.com/world/nobelpeaceprize) - [Norway](https://www.theguardian.com/world/norway) - [Donald Trump](https://www.theguardian.com/us-news/donaldtrump) - [Europe](https://www.theguardian.com/world/europe-news) - [news](https://www.theguardian.com/tone/news)\n\nShareReuse this content\n\nMore on this story\n\n## More on this story\n\n- Gulf leaders call on Trump to rein in Israel after Qatar emergency summit - Rescuers in Norway resume search for journalist missing in wilderness - Saudis may stall on Trump's Middle East peace plan now he’s on the way out - Norway launches scheme to lure top researchers away from US universities - Will Trump's major foreign policy legacy be Israel and Palestine? - Norwegian firm lobbying to open Rosebank oilfield halves green investments - Southern Water considers shipping supplies from Norwegian fjords to UK - Israeli zeal for second Trump term matched by Palestinian enmity - Trump could label Oxfam and Amnesty antisemitic over criticism of Israel - Whale alleged to be Russian ‘spy’ died after stick became lodged in its mouth, say police\n\nMost viewed\n\n## Most viewed",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "AP photos capture moment that anticipated Gaza agreement | AP News",
      "url": "https://apnews.com/article/trump-rubio-note-middle-east-peace-f570658c65daefab6d0af9b29e851dd7?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://dims.apnews.com/dims4/default/862bc47/2147483647/strip/true/crop/3165x1780+0+165/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F20%2Fa0%2Fd153b1ccd7c053d1c19eca38d6ef%2F5bc9b2b8f2344a4b85f6bac006060ce5"
      },
      "content": "- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies Two powerful quakes strike off southern Philippines, killing at least 7 people Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize\n\n- Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies\n\n- Two powerful quakes strike off southern Philippines, killing at least 7 people\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm Antifa expert at Rutgers University says he is moving to Spain because of death threats Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment\n\n- The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm\n\n- Antifa expert at Rutgers University says he is moving to Spain because of death threats\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations US Senate unanimously endorses repeal of 2002 Iraq war resolution Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump\n\n- Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations\n\n- US Senate unanimously endorses repeal of 2002 Iraq war resolution\n\n- Sports SECTIONS AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing TOP STORIES Bill Belichick's 1st season at North Carolina has run into problems on and off the field Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- Bill Belichick's 1st season at North Carolina has run into problems on and off the field\n\n- Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta\n\n- Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Kiss rocker Gene Simmons recovering after crashing SUV Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time John Lodge, singer and bassist of Moody Blues during classic era, dies at 82 Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Kiss rocker Gene Simmons recovering after crashing SUV\n\n- Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time\n\n- John Lodge, singer and bassist of Moody Blues during classic era, dies at 82\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about\n\n- Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela\n\n- Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Science\n\n- Fact Check\n\n- Oddities TOP STORIES Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Giant trolls have a message for humans about protecting the planet Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Be Well TOP STORIES How 'The Great Lock In' can help achieve your financial and wellness goals Is spending all day on your feet at work an occupational hazard? A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving Eating the wrong foods can keep you up at night. A new cookbook offers a better plan Cold-water immersion may offer health benefits — and also presents risks\n\n- How 'The Great Lock In' can help achieve your financial and wellness goals\n\n- Is spending all day on your feet at work an occupational hazard?\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Eating the wrong foods can keep you up at night. A new cookbook offers a better plan\n\n- Cold-water immersion may offer health benefits — and also presents risks\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss Democrats are becoming a force in traditionally conservative The Villages 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- Democrats are becoming a force in traditionally conservative The Villages\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem New California law aims to stabilize insurance for people who can't get private coverage\n\n- What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk\n\n- Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem\n\n- New California law aims to stabilize insurance for people who can't get private coverage\n\n- Health TOP STORIES Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it' California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak Western Montana city losing labor and delivery services at one of its two hospitals Senegal records 17 deaths in rare major outbreak of Rift Valley Fever A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it'\n\n- California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak\n\n- Western Montana city losing labor and delivery services at one of its two hospitals\n\n- Senegal records 17 deaths in rare major outbreak of Rift Valley Fever\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature\n\n- California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket\n\n- One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- Lifestyle SECTIONS Food & Recipes Gardening Homes Travel Fashion Pets TOP STORIES The Dubai chocolate craze is now about much more than bars As the garden winds down, it's time to care for winter-prepping birds India's Lakme Fashion Week, in photos\n\n- The Dubai chocolate craze is now about much more than bars\n\n- As the garden winds down, it's time to care for winter-prepping birds\n\n- India's Lakme Fashion Week, in photos\n\n- Religion TOP STORIES Pope Leo condemns economies that marginalize the poor while the wealthy live in a bubble of luxury Pope urges news agencies to stand as bulwark against lies, manipulation and post-truths Pope meets with Chicago union leaders, urges migrant welcome as crackdown underway in hometown Newsletters World of Faith Comprehensive global coverage of how religion shapes our world. See All Newsletters\n\n- Pope Leo condemns economies that marginalize the poor while the wealthy live in a bubble of luxury\n\n- Pope urges news agencies to stand as bulwark against lies, manipulation and post-truths\n\n- Pope meets with Chicago union leaders, urges migrant welcome as crackdown underway in hometown\n\n- Español TOP STORIES Líder opositora venezolana María Corina Machado gana el Premio Nobel de la Paz El papa León critica una economía que margina a los pobres mientras los ricos viven en el lujo Deloitte reembolsará parcialmente al gobierno australiano por reporte con errores generados por IA Despiden a diplomático de EEUU por relación con mujer ligada al Partido Comunista de China El escritor húngaro László Krasznahorkai gana el Premio Nobel de Literatura Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Líder opositora venezolana María Corina Machado gana el Premio Nobel de la Paz\n\n- El papa León critica una economía que margina a los pobres mientras los ricos viven en el lujo\n\n- Deloitte reembolsará parcialmente al gobierno australiano por reporte con errores generados por IA\n\n- Despiden a diplomático de EEUU por relación con mujer ligada al Partido Comunista de China\n\n- El escritor húngaro László Krasznahorkai gana el Premio Nobel de Literatura\n\n- Defensa en el “juicio del siglo” en el Vaticano pide recusación del fiscal por conducta cuestionable\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- MORE World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game Sports AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing Tennis Tennis Entertainment Movies What to Stream Television Celebrity Interviews Music Books Business Tariffs Inflation Financial Markets Financial Wellness Technology Science Space Animals The Ancient World Climate Medicine Fact Check Oddities Be Well Newsletters Photography 2024 YEAR END PHOTOS Photo Essays Photography AP Investigations Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus Health Tech Artificial Intelligence Social Media Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets Religion Español Most watched videos Standards Quizzes Press Releases My Account AP News Code of Conduct\n\n- World Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa Middle East\n\n- Israel-Hamas war\n\n- Russia-Ukraine war\n\n- Español\n\n- China\n\n- Asia Pacific\n\n- Latin America\n\n- Europe\n\n- Africa\n\n- Middle East\n\n- U.S. Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths\n\n- Immigration\n\n- Weather\n\n- Education\n\n- Transportation\n\n- Abortion\n\n- LGBTQ+\n\n- Notable Deaths\n\n- Politics White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game\n\n- White House\n\n- Congress\n\n- U.S. Supreme Court\n\n- 2025 Election Calendar\n\n- The latest AP-NORC polls\n\n- Ground Game\n\n- Sports AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing Tennis Tennis\n\n- AP Top 25\n\n- NFL\n\n- MLB\n\n- WNBA\n\n- Soccer\n\n- NBA\n\n- NHL\n\n- Auto Racing\n\n- Tennis Tennis\n\n- Entertainment Movies What to Stream Television Celebrity Interviews Music Books\n\n- Movies\n\n- What to Stream\n\n- Television\n\n- Celebrity Interviews\n\n- Music\n\n- Books\n\n- Business Tariffs Inflation Financial Markets Financial Wellness Technology\n\n- Tariffs\n\n- Inflation\n\n- Financial Markets\n\n- Financial Wellness\n\n- Technology\n\n- Science Space Animals The Ancient World Climate Medicine\n\n- Space\n\n- Animals\n\n- The Ancient World\n\n- Climate\n\n- Medicine\n\n- Fact Check\n\n- Oddities\n\n- Be Well\n\n- Newsletters\n\n- Photography 2024 YEAR END PHOTOS Photo Essays Photography\n\n- 2024 YEAR END PHOTOS\n\n- Photo Essays\n\n- Photography\n\n- AP Investigations\n\n- Climate Indigenous peoples and climate Climate Questions Climate Migration India Focus\n\n- Indigenous peoples and climate\n\n- Climate Questions\n\n- Climate Migration\n\n- India Focus\n\n- Health\n\n- Tech Artificial Intelligence Social Media\n\n- Artificial Intelligence\n\n- Social Media\n\n- Lifestyle Food & Recipes Gardening Homes Travel Fashion Pets\n\n- Food & Recipes\n\n- Gardening\n\n- Homes\n\n- Travel\n\n- Fashion\n\n- Pets\n\n- Religion\n\n- Español\n\n- Most watched videos\n\n- Standards\n\n- Quizzes\n\n- Press Releases\n\n- My Account\n\n- AP News Code of Conduct\n\n- World SECTIONS Israel-Hamas war Russia-Ukraine war Español China Asia Pacific Latin America Europe Africa TOP STORIES Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies Two powerful quakes strike off southern Philippines, killing at least 7 people Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. The Afternoon Wire Get caught up on what you may have missed throughout the day. See All Newsletters\n\n- Venezuelan opposition leader María Corina Machado wins the Nobel Peace Prize\n\n- Trump gets long-sought Gaza hostage deal with a whole lot of help from Arab and Muslim allies\n\n- Two powerful quakes strike off southern Philippines, killing at least 7 people\n\n- U.S. SECTIONS Immigration Weather Education Transportation Abortion LGBTQ+ Notable Deaths TOP STORIES She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm Antifa expert at Rutgers University says he is moving to Spain because of death threats Newsletters The Morning Wire Our flagship newsletter breaks down the biggest headlines of the day. See All Newsletters AP QUIZZES Test Your News I.Q. — take today’s quiz\n\n- She saw a car-sized object above a Texas farm and found a wayward hunk of NASA equipment\n\n- The superintendent arrested by ICE had a consulting gig. His districts repeatedly hired the firm\n\n- Antifa expert at Rutgers University says he is moving to Spain because of death threats\n\n- Politics SECTIONS White House Congress U.S. Supreme Court 2025 Election Calendar The latest AP-NORC polls Ground Game TOP STORIES New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations US Senate unanimously endorses repeal of 2002 Iraq war resolution Newsletters Ground Game Exclusive insights and key stories from the world of politics. See All Newsletters\n\n- New York Attorney General Letitia James charged in fraud case after pressure campaign by Trump\n\n- Trump's quest for the Nobel Peace Prize falls short again despite high-profile nominations\n\n- US Senate unanimously endorses repeal of 2002 Iraq war resolution\n\n- Sports SECTIONS AP Top 25 NFL MLB WNBA Soccer NBA NHL Auto Racing TOP STORIES Bill Belichick's 1st season at North Carolina has run into problems on and off the field Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies Newsletters AP Top 25 Poll Alerts Get email alerts for every college football Top 25 Poll release. The Sports Wire Your home base for in-depth reporting from the world of sports. See All Newsletters\n\n- Bill Belichick's 1st season at North Carolina has run into problems on and off the field\n\n- Indonesia to block Israeli team from competing at gymnastics world championships in Jakarta\n\n- Sister Jean, who became a beloved international celebrity during Loyola Chicago Final Four run, dies\n\n- Entertainment SECTIONS Movies What to Stream Television Celebrity Interviews Music Books TOP STORIES Kiss rocker Gene Simmons recovering after crashing SUV Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time John Lodge, singer and bassist of Moody Blues during classic era, dies at 82 Newsletters AP Entertainment Wire Get AP's first personalized newsletter delivering you entertainment news twice a week. See All Newsletters\n\n- Kiss rocker Gene Simmons recovering after crashing SUV\n\n- Once-secret Emperor Commodus' passage to Rome Colosseum opens to public for the first time\n\n- John Lodge, singer and bassist of Moody Blues during classic era, dies at 82\n\n- Business SECTIONS Tariffs Inflation Financial Markets Financial Wellness Technology TOP STORIES Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Tesla hit with probe after crashes involving a self-driving feature that Musk has boasted about\n\n- Trinidad and Tobago secures US permission to negotiate gas deal with neighboring Venezuela\n\n- Prince Harry and Meghan Markle ask families to join fight against predatory social media policies\n\n- Science\n\n- Fact Check\n\n- Oddities TOP STORIES Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats Ground squirrels are taking over a North Dakota city and officials are not amused Photos show Ghana's fantasy coffins as a stylish final rest Giant trolls have a message for humans about protecting the planet Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Photos of Egypt’s ‘strongman’ pulling ships, trains and cars in jaw-dropping feats\n\n- Ground squirrels are taking over a North Dakota city and officials are not amused\n\n- Photos show Ghana's fantasy coffins as a stylish final rest\n\n- Giant trolls have a message for humans about protecting the planet\n\n- Half a house for half a million dollars: Home crushed by tree hits market near Los Angeles\n\n- Whale surfaces, capsizes fishing boat off New Hampshire coast\n\n- Be Well TOP STORIES How 'The Great Lock In' can help achieve your financial and wellness goals Is spending all day on your feet at work an occupational hazard? A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving Eating the wrong foods can keep you up at night. A new cookbook offers a better plan Cold-water immersion may offer health benefits — and also presents risks\n\n- How 'The Great Lock In' can help achieve your financial and wellness goals\n\n- Is spending all day on your feet at work an occupational hazard?\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Eating the wrong foods can keep you up at night. A new cookbook offers a better plan\n\n- Cold-water immersion may offer health benefits — and also presents risks\n\n- Newsletters\n\n- Photography SECTIONS 2024 YEAR END PHOTOS Photo Essays Photography TOP STORIES How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss Democrats are becoming a force in traditionally conservative The Villages 'Why? Why? Why?' Ukraine's Mariupol descends into despair Newsletters The World in Pictures Get The AP’s most compelling photographs sent directly to your inbox. See All Newsletters\n\n- How this AP photographer captured Taylor Swift and Travis Kelce's iconic kiss\n\n- Democrats are becoming a force in traditionally conservative The Villages\n\n- 'Why? Why? Why?' Ukraine's Mariupol descends into despair\n\n- AP Investigations\n\n- Climate SECTIONS Indigenous peoples and climate Climate Questions Climate Migration India Focus TOP STORIES What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem New California law aims to stabilize insurance for people who can't get private coverage\n\n- What to know: Tropical Storm Priscilla to drench Southwest US, raising deadly flash flood risk\n\n- Women in Mexico step up to protect ancient Aztec farms and save a vanishing ecosystem\n\n- New California law aims to stabilize insurance for people who can't get private coverage\n\n- Health TOP STORIES Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it' California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak Western Montana city losing labor and delivery services at one of its two hospitals Senegal records 17 deaths in rare major outbreak of Rift Valley Fever A good shower is a simple shower, no matter what influencers recommend Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Kennedy reups unproven Tylenol-autism link during Cabinet meeting as Trump repeats 'don't take it'\n\n- California company recalls nearly 245,000 pounds of pasta tied to listeria outbreak\n\n- Western Montana city losing labor and delivery services at one of its two hospitals\n\n- Senegal records 17 deaths in rare major outbreak of Rift Valley Fever\n\n- A good shower is a simple shower, no matter what influencers recommend\n\n- Losing a family pet gives parents a chance to teach children about death and grieving\n\n- Tech SECTIONS Artificial Intelligence Social Media TOP STORIES One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket One Tech Tip: Don't use rice for your device. Here's how to dry out your smartphone\n\n- One Tech Tip: Annoyed by junk calls to your iPhone? Try the new iOS 26 call screen feature\n\n- California police pull over a self-driving Waymo for an illegal U-turn, but they can't ticket\n\n- One Tech Tip: Don't use rice for your device.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Norway on Edge Over Trump Ahead of Nobel Peace Prize Verdict - Bloomberg",
      "url": "https://www.bloomberg.com/news/articles/2025-10-09/norway-on-edge-over-trump-ahead-of-nobel-peace-prize-verdict?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i8Ximqmxe8EY/v1/1200x798.jpg",
        "1": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i8Ximqmxe8EY/v1/-1x-1.webp"
      },
      "content": "Trump’s Second Term:\n\nDonald Trump\n\nPhotographer: Andrew Caballero-Reynolds/AFP/Getty Images\n\nNorway is bracing for the aftermath of the Nobel Peace Prize announcement on Friday as the Nordic nation has faced increasing pressure from Donald Trump and his administration to award it to the US leader.\n\nTrump’s aggressive push to secure the prize, including public declarations he deserves it and calls to Norwegian officials, has intensified with a ceasefire between Israel and Hamas and a possible peace deal. At the same time, the decisionmakers at the Norwegian Nobel Committee have signaled that this pressure has been futile.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "'They're coming back': Israelis await return of Gaza hostages",
      "url": "https://uk.news.yahoo.com/theyre-coming-back-israelis-await-103531886.html?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://s.yimg.com/rz/p/yahoo_frontpage_en-US_s_f_p_bestfit_frontpage.png",
        "1": "https://s.yimg.com/rz/p/yahoo_frontpage_en-US_s_f_w_bestfit_frontpage.png",
        "2": "https://uk.news.yahoo.com/beacon?tag=TCF2&step=Layer1-View&brandDomain=uk.news.yahoo.com&brandBid=&userType=nonreg&sdk=false&tos=en-GB&country=US&x=&sessionId=1_cc-session_da54c773-9386-462a-9dd8-500d33ac0c88"
      },
      "content": "# guce\n\nYahoo is part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo, AOL, Engadget, In The Know and Makers.Yahoo family of brands.\n\n- provide our sites and apps to you\n\n- authenticate users, apply security measures, and prevent spam and abuse, and\n\n- MeasurementWe count the number of visitors to our pages, the type of device they use (iOS or Android), the browser they use and the duration of their visit to our websites and apps. This data is collected in aggregate and is not tied to specific users.measure your use of our sites and apps\n\nIf you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\nIf you would like to customise your choices, click 'Manage privacy settings'.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Zelenskyy says he will nominate Trump for Nobel peace prize if he secures Ukraine ceasefire – as it happened | Europe | The Guardian",
      "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i.guim.co.uk/img/media/48b7710afa6452197dd48cf020c807d6d9609e04/670_294_1776_1420/master/1776.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c896252c48c98ae393f49b99f37dbd3e",
        "1": "https://i.guim.co.uk/img/media/48b7710afa6452197dd48cf020c807d6d9609e04/670_294_1776_1420/master/1776.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&s=2455a8eddf94817f6081a6405e2e70b1",
        "2": "https://i.guim.co.uk/img/media/48b7710afa6452197dd48cf020c807d6d9609e04/670_294_1776_1420/master/1776.jpg?width=465&dpr=1&s=none&crop=none"
      },
      "content": "Europe liveEurope\n\n# Zelenskyy says he will nominate Trump for Nobel peace prize if he secures Ukraine ceasefire – as it happened\n\nThis blog is now closed, you can read more of our European news coverage here Updated 1d agoJoe CoughlanThu 9 Oct 2025 10.30 EDTFirst published on Thu 9 Oct 2025 04.11 EDTShare\n\nKey events\n\n- [1d agoClosing summary](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e7c61a8f08563c9da75b9c#block-68e7c61a8f08563c9da75b9c) - [1d agoZelenskyy says he will nominate Trump for peace prize if he secures Ukraine ceasefire](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e7ac598f08a99f04926f40#block-68e7ac598f08a99f04926f40) - [1d agoAfternoon summary](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e7abed8f08a99f04926f38#block-68e7abed8f08a99f04926f38) - [1d agoUkrainian counteroffensive derails Russia's plans to capture Donetsk cities, Zelenskyy says](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e78fc58f08a99f04926d04#block-68e78fc58f08a99f04926d04) - [1d agoRussia strikes port facilities and energy infrastructure in Ukraine's Odesa region](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e783cd8f08e1d65d2a5d2b#block-68e783cd8f08e1d65d2a5d2b) - [1d agoUkraine hits Russian gas plant overnight](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e779de8f0871610d006ff9#block-68e779de8f0871610d006ff9) - [1d agoRussian strikes causing 'chaos' in Ukrainian energy and railway infrastructure](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e76ed48f0871610d006f88#block-68e76ed48f0871610d006f88) - [1d agoOpening summary](https://www.theguardian.com/?filterKeyEvents=false&page=with%3Ablock-68e769a48f08a99f04926b64#block-68e769a48f08a99f04926b64)\n\nDonald Trump with Volodymyr Zelenskyy in August at the White House. Photograph: White House/ZUMA Press Wire/ShutterstockView image in fullscreenDonald Trump with Volodymyr Zelenskyy in August at the White House. Photograph: White House/ZUMA Press Wire/Shutterstock\n\nShow key events onlyPlease turn on JavaScript to use this feature\n\n## Live feed\n\nFrom 1d ago\n\n**The Ukrainian president, Volodymyr Zelenskyy, floated the idea of nominating the US president, Donald Trump, for the Nobel****peace****prize in a briefing to reporters,** two days ahead of the announcement of this year’s winner, who would have been selected earlier in the autumn, Reuters reports.\n\nZelenskyy said in comments released on Thursday:\n\n> If Trump gives the world – above all, the Ukrainian people – the chance for such a ceasefire, then yes, he should be nominated for the Nobel peace prize. > We will nominate him on behalf of Ukraine.\n\nZelenskyy has worked hard to win Trump’s support, and appears to be making some headway.\n\nTomahawk missiles top Kyiv’s wishlist of US weapons it believes can inflict serious damage on [Russia](https://www.theguardian.com/world/russia) and force it to the table.\n\nTrump, who has expressed frustration with Russia’s Vladimir Putin, has signalled he is open to providing them.\n\nThe US president has said he deserved the Nobel award, given to four of his White House predecessors, for what he has described as his efforts in securing numerous peace deals.",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Europe Daily News, 09 October 2025 | Insights | Mayer Brown",
      "url": "https://www.mayerbrown.com/en/insights/publications/2025/10/europe-daily-news/europe-daily-news-oct0925?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.mayerbrown.com/cdn-cgi/image/width=400,quality=90,format=jpeg/-/media/images/tile-images-for-insights-and-news/tile_bucket-300x400_67.jpg?rev=806caa50c6c8477196112f597a4c8fca",
        "1": "https://www.mayerbrown.com/-/media/images/tile-images-for-insights-and-news/tile_bucket-300x400_67.jpg?rev=806caa50c6c8477196112f597a4c8fca",
        "2": "https://www.mayerbrown.com/cdn-cgi/image/width=3840,quality=90,format=auto//-/jssmedia/images/cta-banners/light-background.jpg?h=4001&iar=0&w=6001&rev=40badaab2b4f45c19387c5e6961e15e0&hash=D3CAAA1B94D4488910E8EE2B4BD18910"
      },
      "content": "# Europe Daily News, 09 October 2025\n\n#### COMPETITION\n\n- Non-opposition to a notified concentration (Case M.12068 - Philips / Ambulanzzentrum Des Uke / JV)\n\n- Prior notification of a concentration (Case M.12063 - Sunstone / Platinum Globe / Digitalbridge / Skyline JV)\n\n- Prior notification of a concentration (Case M.12179 - Temasek / Brookfield / Luminace)\n\n- Commission clears acquisition of Kereis by Advent (M.12045) - Midday Express\n\n- Commission clears acquisition of Bavarian Nordic by Nordic Capital and Permira (M.12123) - Midday Express\n\n- Commission clears acquisition of the Essential Home Business of Reckitt by Advent (M.12091) - Midday Express\n\n- Belgium - The Competition Authority approves the acquisition of joint control over Doktr by Proximus, AG Insurance and Nationaal Hulpfonds\n\n- Cyprus - Notification of a concentration concerning the acquisition of the share capital of Explomin Imports-Exports Limited by K. Kythreotis Holdings Public Limited and Extraco Explosives and Chemical Products, Commercial Industrial and Technical Societe Anonyme, via Efexter Limited\n\n- Germany - The Bundeskartellamt has initiated proceedings against Whaleco Technology Limited (Temu), based in Dublin, Ireland\n\n- France - Organic food retail sector: the Autorité de la concurrence clears the takeover of 7 Bio&Co stores by Marcel & Fils, subject to the sale of one of these stores to a competitor\n\n- Portugal - Oxy Capital, Rubrikesvoaçante and Túlipesvoaçante notify the acquisition of joint control directly and indirectly over Costa Almeida and António Costa AlmeidaPortugal - AdC adopted a non-opposition decision in concentration operation 73/2025 - Portobello / Dualparts II\n\n- Romania - The Competition Council has authorized the transaction whereby Alpha Medical S.R.L. intends to acquire Sante International S.A. and Intermedica International S.A.\n\n- Slovakia - The PMÚ imposed a fine for failure to submit the requested information within the specified deadline\n\n- Slovakia - The PMÚ Council confirmed decisions on abuse of dominant position by bus station operators\n\n- Spain - The CNMC investigates possible anti-competitive practices in the public road passenger transport sector\n\n- UK - The CMA is investigating the completed acquisition by SMFL LCI Helicopters Ltd (SMFLH) of Macquarie Rotorcraft Ltd (MRL)\n\n#### STATE AID\n\n- Judgment of the Court of 09 October 2025 in Joined Cases C‑416/24 and C‑417/24, On Air Media Professionals SRL (C‑416/24) Vs. Agenţia pentru Întreprinderi Mici şi MijlociiIaşi, and Different Media SRL (C‑417/24) Vs. Ministerul Antreprenoriatului şi Turismului – Agenţia pentru Întreprinderi Mici şi Mijlocii, Atragere de Investiţii şi Promovare a Exportului Iaşi Re: Reference for a preliminary ruling - State aid - Regulation (EU) No 651/2014 - Exemption of certain categories of aid compatible with the internal market - Translation error in the Romanian version of that regulation - Legal effects of the regulation correcting that error - Possibility of recovery of aid granted before the correction in accordance with the conditions set out in the version of the regulation containing the translation error - Protection of legitimate expectations - Legal certainty\n\n- Authorisation for State aid pursuant to Articles 107 and 108 of the TFEU - Cases where the Commission raises no objections – SA.105337 & SA.118542\n\n- ESA adopts new State aid guidelines linked to the Clean Industrial Deal\n\n#### TRADE & CUSTOMS\n\n- Agenda for: Customs 2027 Programme - 38th meeting Prohibitions & Restrictions Expert Group -18 November 2025\n\n- Agenda for: Working Party on European Free Trade Association (EFTA) - 14 October 2025\n\n- Agenda for: Meeting of the Market Access Advisory Committee - 15 October 2025\n\n- Minutes of: Meeting of the Market Access Advisory Committee - 17 September 2025\n\n- Commission Implementing Regulation (EU) 2025/2013 of 8 October 2025 making imports of terephthalic acid originating in the Republic of Korea and Mexico subject to registration\n\n- Recommendation on the draft Council decision concerning the withdrawal of the European Union from the International Rubber Study Group (IRSG)\n\n- Greenland's Prime Minister stresses importance of trade relations with EU - Speech by Jens-Frederik Nielsen Prime minister of Greenland at the EP plenary\n\n- Answer given by Mr Šefčovič to a MEP written question - Commission action to address the impact of US tariffs on European agri-food products\n\n- New trade measure is major leap forward to save EU steel and hundreds of thousands of jobs; now fast-track adoption is crucial, says EUROFER\n\n- UK-EU reset leaves sour taste for South African citrus exporters - Importers of citrus fruit seek exemption from EU rules that would apply under Brexit deal - Politico.eu\n\n- EU warns UK must improve NI border checks before veterinary deal is signed - Officials say London must comply before it can start serious talks on a sweeping agrifood agreement - Financial Times\n\n- US demands EU dismantle green regulations in threat to trade deal - Washington wants American companies to be exempted from rules such as having to draw up climate transition plans - Financial Times\n\n- China unveils sweeping rare-earth export controls to protect ‘national security’ - Rules come ahead of expected meeting this month between Donald Trump and Xi Jinping - Financial Times\n\n#### INTERNAL MARKET & INDUSTRY\n\n- Council agrees position on modernised rules for measuring instruments to support green and digital transition - Mandate for negotiations with the European Parliament as adopted at the Coreper meeting on 8 October 2025\n\n- Answer given by Mr Hansen to a MEP written question - Competitiveness challenges in the agri-food sector\n\nCHEMICAL\n\n- European Commission consults on its \"proposal for a regulation\" on European Chemicals Agency - Feedback period: 07 October 2025 - 02 December 2025\n\n#### FINANCE\n\n- EU pressure builds on Belgium to allow use of Russia’s frozen assets - Belgian Prime Minister Bart De Wever insists other capitals should cover financial and legal risks of €140bn loan -Financial Times\n\n#### AGRICULTURE & FISHERIES\n\n- Parliament ready to start talks about simplifying EU agriculture laws - See the EP Resolution\n\n- MEPs back changes to strengthen farmers’ position in the food supply chain - See the EP Resolution\n\n#### EMPLOYMENT & SOCIAL AFFAIRS\n\n- Answer given by EVP Virkkunen to a MEP written question - Safeguarding jobs in the face of artificial intelligence\n\n- MEPs approved EU aid (€3 million) for 915 former Goodyear employees in Hanau and Fulda, Germany - See the EP Resolution\n\n- MEPs approved EU aid (€900,000) for 417 laid-off workers following the closure of chip manufacturer BelGaN - See the EP Resolution\n\n- ESA asks Norway to fully implement EEA rules on posting of workers\n\n#### ENVIRONMENT & CLIMATE CHANGE\n\n- Agenda for: Meeting of the Climate Change Committee - 24 October 2025\n\n- Agenda for: Working Party on International Environment Issues (Biodiversity) - 13 October 2025\n\n- Agenda for: Working Party on International Environment Issues (Biodiversity) - 14 October 2025\n\n- Agenda for: Working Party on International Environment Issues (WPIEI Desertification) - 14 October 2025\n\n- Agenda for: Working Party on International Environment Issues (UNECE and other regional issues) - 15 October 2025\n\n- Minutes of: Meeting of the Committee on the Directive on Empowering Consumers for the Green Transition - 02 September 2025\n\n- Commission provides new guidance to Member States on implementing Social Climate Fund and fulfilling Social Climate Plans\n\n- EU Ecolabel hits record numbers, offering new opportunities for businesses and more sustainable choices for consumers - Midday Express\n\n- Europeans risk cold showers in EU red tape snafu - Materials needed for enamelling of hot water tanks is excluded from bloc’s list of authorised substances - Financial Times\n\nDEFORESTATION\n\n- Answer given by Ms Roswall to a MEP written question - Information on the EU Deforestation Regulation’s benchmarking system\n\n- Companies warn EU anti-deforestation law delays are endangering forests, and other climate and nature news\n\n- Potential delay of the EU Deforestation Regulation - Joint letter\n\n#### HEALTH, FOOD & PRODUCT SAFETY\n\n- Judgment of the Court of 09 October 2025 in 09 October 2025 in Case C‑315/24, Nestlé Sverige AB Vs. Miljönämnden i Helsingborgs kommun Re: Preliminary ruling - Food safety - Regulation (EU) No 1169/2011 - Provision of food information to consumers - Delegated Regulation (EU) 2016/128 - Foods for special medical purposes - Specific information requirements - Mandatory nutrition declaration - Article 5(2)(g) - Additional mandatory particulars - Article 6(2) - Prohibition on repeating on the labelling the information contained in the mandatory nutrition declaration\n\n#### DATA PRIVACY, DIGITAL & INFORMATION SOCIETY\n\n- Commission Delegated Regulation (EU) 2025/2050 of 1 July 2025 supplementing Regulation (EU) 2022/2065 of the European Parliament and of the Council by laying down the technical conditions and procedures under which providers of very large online platforms and of very large online search engines are to share data with vetted researchers\n\n- Commission and EDPB gather feedback on draft guidelines on interplay between DMA and GDPR - see the Joint Guidelines\n\n- Answer given by EVP Virkkunen to a MEP written question - Protecting European minors from reported cases of online grooming and sexual exploitation on digital game platform Roblox\n\n- Meta and Apple close to settling EU cases - US Big Tech groups in final stages of agreeing deal with Brussels to avoid series of escalating fines - Financial Times\n\n- EU tech chief urges ‘stay calm’ in face of US pressure on digital rules - Henna Virkkunen cites “different personal styles” amid criticism of her leadership on digital rulebook - Politico.eu\n\n#### TRANSPORT & MOBILITY\n\n- ESA asks Norway to comply with EFTA Court judgement on EEA rules for air-traffic management\n\n- Answer given by Mr Tzitzikostas to a MEP written question - Need for control of Turkish Airlines by the DG for Competition\n\n- A role for renewable fuels: European ethanol producers reply to EU public consultation on Revision of CO2 emission standards for cars and vans\n\n#### AREA OF FREEDOM, SECURITY & JUSTICE\n\n- Failure of a Member State to fulfil its obligations: Greece is ordered to pay financial penalties for failing to comply with a 2014 judgment of the Court of Justice (See CPR No.131/ 2025 - Judgment of the Court in Case C-368/24, Commission Vs. Greece (Enforcement of the judgment C-600/12 on the Zakynthos landfill)\n\n#### ECB, EURO & ECONOMY\n\n- Agenda for: Meeting of the EP ECON Committee - 13 October 2025\n\n- A resilient EU budget supporting Europe's priorities in 2024\n\n- Faster and safer instant euro payments become a reality\n\n#### EXTERNAL RELATIONS\n\n- Statement by President von der Leyen on the announcement of an agreement on a ceasefire in Gaza and the release of hostages\n\n- EU Political and Security Committee – African Union Peace and Security Council: 16th Annual Joint Consultative Meeting on Peace and Security in Africa\n\n- European Commission and World Bank Group deepen partnership for infrastructure and jobs at the Global Gateway Forum - Team Europe reaches €300 billion target for Global Gateway investments ahead of time - Keynote speech by President von der Leyen - Statement by President von der Leyen with Ajay Banga, President of the World Bank Group\n\n- Answer given by HR/VP Kallas to a MEP written question - The EU must condemn the holding of a conference of the Organisation of Turkic States in the occupied territories and any attempt to upgrade the pseudo-state\n\n## Related Content\n\n- PublicationsEurope Daily News, 29 July 2025July 29, 2025Learn More\n\n### Europe Daily News, 29 July 2025\n\n- PublicationsEurope Daily News, 22 January 2025January 22, 2025Learn More\n\n### Europe Daily News, 22 January 2025\n\n- PublicationsEurope Daily News, 30 July 2025July 30, 2025Learn More\n\n### Europe Daily News, 30 July 2025\n\n## Stay Up To Date With Our Insights",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "EP TODAY | News | European Parliament",
      "url": "https://www.europarl.europa.eu/news/en/press-room/20250903IPR30126/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.europarl.europa.eu/news/img/meta-facebook.jpg"
      },
      "content": "European Parliament\n\nEND OF REFACTORING\n\n# EP TODAY\n\nPress Releases Plenary session 10-09-2025 - 08:00\n\n## Share this page:\n\n- Facebook - X - LinkedIn - WhatsApp\n\nWednesday 10 September\n\nText content\n\n**State of the European Union debate**\n\nFilling the morning’s agenda, the annual parliamentary State of the European Union debate is a key opportunity for MEPs to hold the European Commission to account. In her opening statement, European Commission President Ursula von der Leyen will detail both the Commission’s achievements over the past year and current challenges. The political group leaders will then steer the debate, with members assessing the Commission’s work and its plans, while also presenting their own priorities. You can [follow President von der Leyen’s speech and the debate with MEPs](https://multimedia.europarl.europa.eu/en/webstreaming/debate-on-state-of-european-union-2025-with-nametags-of-speakers_20250910-0900-SPECIAL-OTHER) from 09.00.\n\nAhead of the debate, at 08.45, European Parliament President Roberta Metsola will give a doorstep statement in the media stand-up area by the hemicycle in Strasbourg. You can follow this live via [EP webstreaming](https://multimedia.europarl.europa.eu/en/webstreaming/doorstep-by-roberta-metsola-ep-president-prior-to-debate-on-state-of-european-union_20250910-0845-SPECIAL-OTHER) and the [European Broadcasting Service](https://audiovisual.ec.europa.eu/en/ebs/grid?ebs=yes&ebsplus=yes&date=20250910).\n\n**Andreas KLEINER****(+32) 498 98 33 22****Estefania NARRILLOS****(+32) 498 98 39 85****@EuroParlPress**\n\n**EU-US trade relations**\n\nIn a debate starting at about 14.30 with Trade Commissioner Maroš Šefčovič and Danish European Affairs Minister Marie Bjerre for the Council, MEPs will assess the implementation of the EU-US trade deal and the prospect of wider EU trade agreements.\n\n**Lieven COSIJN(+32) 473 864 141 @EP_Trade**\n\n**Updated rules on package holidays**\n\nMembers will discuss changes to the Package Travel Directive with Consumer Protection Commissioner Michael McGrath from around 17.00. The updated directive will refine travellers’ information and trip cancellation rights, as well as their rights to a refund and repatriation help, if their travel organiser should go bankrupt or unforeseen circumstances disrupt their holiday plans. The vote on Parliament’s negotiating position is scheduled for Thursday.\n\n**Maris KURME****(+32) 477 99 06 65****@EP_SingleMarket**\n\n**In brief**\n\n**Migration.**This month’s topical debate, on migration, will begin at 13.30, after the votes.\n\n**Global satellite navigation system interference.**In a debate with Commissioner for Defence and Space Andrius Kubilius, starting at around 17.30, Parliament will debate threats to aviation and maritime transport and the urgent need to build resilience against spoofing and jamming.\n\n**Slovakia.**MEPs will discuss the rule of law situation and possible misuse of EU funds in Slovakia, in a debate with Commissioner Michael McGrath and Marie Bjerre, Danish Minister for European Affairs, from about 18.30.\n\n**Taxation of large digital platforms**. In an evening debate, Commissioner McGrath will respond to an oral question on the implications of international developments for EU policy on taxing the digital economy.\n\n**Human rights.** In evening debates with Commissioner Jozef Síkela, MEPs will discuss the cases of EU citizens detained in the occupied areas of Cyprus, political prisoner Victoire Ingabire in Rwanda, and Irish national Abdoul Aziz Goma, arbitrarily detained in Togo. Three separate resolutions will be put to a vote in plenary on Thursday.\n\n**Votes**\n\nAt noon, MEPs will vote, among others, on:\n\n- simplifying and strengthening the carbon border adjustment mechanism; - cohesion policy, including the mid-term review; - facilitating investments and reforms to boost European competitiveness and on creating a capital markets union, one year after the Draghi Report; - the future of agriculture and the post-2027 common agricultural policy, and - a motion for a resolution on strengthening Moldova’s resilience against Russian hybrid threats and malign interference.\n\nLive coverage of the plenary session can be found on [Parliament’s webstreaming site](https://multimedia.europarl.europa.eu/en/webstreaming/plenary-session_20250910-0900-PLENARY) and on [EbS+](https://audiovisual.ec.europa.eu/en/ebs/grid?ebs=no&ebsplus=yes&date=20250910).\n\nFor detailed information on the session, please also see our [newsletter](https://www.europarl.europa.eu/news/en/agenda/briefing/2025-09-08) and the [detailed agenda](https://www.europarl.europa.eu/doceo/document/OJQ-10-2025-09-10_EN.html).\n\nFind more [information regarding plenary](https://www.europarl.europa.eu/plenary/en/home.html).\n\nContact\n\n## Contacts:\n\n- Press room Contact data: Phone number: (+33) 3 881 74 005 (STR)\n\nADDITIONAL LINKS COLUMN\n\nProduct reference\n\n## Product information\n\nRef.: 20250903IPR30126\n\n## Share this page:\n\n- Facebook - X - LinkedIn - WhatsApp\n\nSign up for mail updates PDF version",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "FTSE 100 today: Index slips as pound weakens, European markets trade in green",
      "url": "https://www.investing.com/news/stock-market-news/ftse-100-today-index-slips-from-record-high-pound-falls-below-134-4278755?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i-invdn-com.investing.com/news/LYNXMPEA5G0BF_L.jpg"
      },
      "content": "# FTSE 100 today: Index declines as pound weakens\n\nInvesting.com -- British stocks traded lower on Thursday following a record close in the previous session, while the broader European market traded mostly lower and the pound weakened, slipping below $1.34 once again.\n\nThe blue-chip index FTSE 100 dropped 0.3% and the British GBP/USD fell 0.7% against the dollar to just above 1.33.\n\nDAX index in Germany gained 0.2%, the CAC 40 in France fell 0.1%.\n\nUK round up: Volution tops forecasts; Lloyds warns on provisions; SSP misses estimates\n\n- Lloyds Banking Group PLC (LON:LLOY) stock dropped 3.3% after the British lender warned it may need to set aside a \"material\" provision related to motor finance regulations. The bank said it continues to analyze the impact of the Financial Conduct Authority’s recently published consultation paper on motor finance. Lloyds noted that \"uncertainties remain outstanding on the interpretation and implementation of the proposals\" from the FCA. The warning comes as the British financial regulator reviews practices in the motor finance sector, which could potentially lead to significant costs for lenders involved in this market.\n\nLloyds Banking Group PLC (LON:LLOY) stock dropped 3.3% after the British lender warned it may need to set aside a \"material\" provision related to motor finance regulations. The bank said it continues to analyze the impact of the Financial Conduct Authority’s recently published consultation paper on motor finance. Lloyds noted that \"uncertainties remain outstanding on the interpretation and implementation of the proposals\" from the FCA. The warning comes as the British financial regulator reviews practices in the motor finance sector, which could potentially lead to significant costs for lenders involved in this market.\n\n- Volution Group plc (LON:FAN) reported fiscal year 2025 results that exceeded analyst expectations, driven by strong second-half organic revenue growth of 7.2%, which surpassed the company’s target range of 3% to 5%. The UK-based company posted total revenue of £419 million for FY25, representing a 21% increase from the previous year. Organic revenue from ongoing operations rose 5.7%, slightly above Jefferies’ estimate of 5.1%.\n\n- In other corporate news, Lloyds Banking Group PLC (LON:LLOY) announced it may need to set aside an additional provision related to the Financial Conduct Authority’s proposed scheme addressing motor finance mis-selling. The British bank indicated this potential provision could materially impact its financial position.\n\n- Meanwhile, Grainger PLC (LON:GRI) reported strong operational metrics in its trading update ahead of full-year 2025 results due November 20. The residential landlord achieved portfolio occupancy of 98.1%, up from 96% at the March half-year mark, and delivered total like-for-like growth of 3.6%, aligning with its medium-term guidance of 3%-3.5%.\n\n- SSP Group PLC’s (LON:SSPG) fourth-quarter group sales grew 4% year-over-year in constant currency, below the 6% consensus expectation. Like-for-like sales increased 2% versus the expected 4%. For fiscal year 2025, SSP reported constant currency revenue of £3.7 billion and expects pre-IFRS 16 constant currency operating profit of £230 million, at the lower end of its guidance range.\n\n- Johnson Matthey PLC (LON:JMAT) said Thursday it expects full-year underlying operating profit to reach the upper end of its growth guidance, with performance weighted toward the second half of the fiscal year. The company’s outlook is supported by a £10 million boost from current platinum group metal prices and foreign exchange rates.\n\n- In regulatory news, the UK’s Competition and Markets Authority provisionally rejected nearly 80% of water price increases sought by five water companies. The CMA’s provisional redeterminations will allow only £556 million of the total £2.7 billion in additional revenue requested.\n\n- On the political front, British Prime Minister Keir Starmer welcomed the agreement on the first stage of U.S. President Donald Trump’s peace plan for Gaza, calling for \"its full and immediate implementation.\"\n\n## Latest comments",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Ukraine-Russia war latest: Russian fighter jet crashes before drone ...",
      "url": "https://www.independent.co.uk/news/world/europe/ukraine-russia-war-trump-putin-tomahawk-missiles-map-latest-b2842169.html?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.independent.co.uk/2025/09/23/5/06/SWEDEN-ESTONIA-RUSSIA-NATO-teqvx0xw.jpeg?trim=497,796,636,902&width=1200&height=800&crop=1200:800",
        "1": "https://static.independent.co.uk/2025/10/09/10/Russia_Ukraine_War_00708.jpg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "2": "https://static.independent.co.uk/2025/10/07/5/18/UKRAINE-RUSSIA-CONFLICT-k4c70r24.jpeg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "3": "https://static.independent.co.uk/2025/10/09/08/Japan_Ukrainian_Sumo_Star_78073.jpg?quality=75&width=230&crop=3%3A2%2Csmart&auto=webp",
        "4": "https://static.independent.co.uk/2025/10/10/15/43/2025-10-10T150909Z_1367150823_RC239HAXS8JS_RTRMADP_3_USA-TRUMP.jpeg?trim=0,0,0,0&width=1200&height=800&crop=1200:800"
      },
      "content": "Fires break out in Kyiv apartments after major Russian attack\n\nA [Russian](https://www.independent.co.uk/topic/russia)MiG-31 fighter jet crashed while attempting to land in the western Lipetsk region near the border with [Ukraine](https://www.independent.co.uk/topic/ukraine), the Russian defence ministry said.\n\nThe aircraft reportedly crashed in an uninhabited area in Lipetsk, which is about 300km (190 miles) from Ukraine's eastern border.\n\n“A MiG-31 aircraft crashed during its landing approach after completing a scheduled training flight,” the Russian defence ministry said on Thursday, according to Russia’s Tass news agency.\n\n“The aircraft’s crew ejected, there is no threat to the pilots’ lives.”\n\nThe cause of the crash remains unclear. It occurred shortly before Russia launched a large-scale overnight drone and missile attack against Ukraine on Friday.\n\nA seven-year-old boy was killed when his home was hit in the southeast and at least 20 people were injured, Reuters reported.\n\nUkrainian officials said much of the capital, [Kyiv](https://www.independent.co.uk/topic/kyiv), experienced power outages as a result of the attack.\n\nRussian forces have focused on Ukraine's energy infrastructure in recent weeks as winter again approaches in the more than three-and-a-half-year-old war. A massive missile and drone attack last week hit several of Ukraine's main gas production facilities, causing considerable damage.\n\nRecommended\n\n- [India is now lead supplier of fuel additives for Russia’s fighter jets, Ukrainian think tank warns](https://www.independent.co.uk/news/world/europe/india-russia-ukraine-war-fuel-additives-b2842191.html) - [Ukraine's new missiles and drones cause gas shortages in Russia, Zelenskyy says](https://www.independent.co.uk/news/russia-donetsk-moscow-donald-trump-kyiv-b2842317.html) - [Indian man fighting with Russian forces surrenders to Ukrainian Army, Kyiv says](https://www.independent.co.uk/news/world/europe/russia-ukraine-army-india-gujarat-soldier-video-b2841384.html) - [Ukrainian refugee who fled war-torn home is now sumo’s rising star](https://www.independent.co.uk/sport/general/danilo-yavhushyshyn-sumo-wrestling-japan-b2842418.html)\n\n### Zelensky says he discussed frozen Russian assets with ECB president\n\nUkraine's President Volodymyr Zelensky says he discussed \"fair use\" of frozen Russian assets with European Central Bank President Christine Lagarde.\n\nHis comments come after a large overnight Russian air attack across Ukraine.\n\n\"We discussed how to ensure the fair use of frozen Russian assets to protect against Russia’s war and to help rebuild life in Ukraine. There are solutions for how this can be done,\" Zelensky said.\n\nIn a later post, Zelensky said he had discussed the use of frozen Russian assets for Ukraine's defence needs and rebuilding after Russian airstrikes.\n\n\"We are getting closer to a decision on the assets, and I thank everyone who is helping,\" he wrote.\n\nDaniel Keane10 October 2025 18:00\n\n### More than one million consumers in Ukraine faced temporary power cuts after Russian strike, data shows\n\nThe Russian massive attack on Ukraine's energy system on Friday caused temporary power cuts to more than one million consumers across the country, Reuters calculations based on local authorities data showed.\n\nAt least 420,000 families in the capital of Kyiv were affected, Ukrainian private energy firm DTEK said, announcing that power was restored.\n\nDaniel Keane10 October 2025 17:30\n\n### Watch: Fires break out in Kyiv apartments after major Russian attack\n\nFires break out in Kyiv apartments after major Russian attack\n\nDaniel Keane10 October 2025 17:00\n\n### Melania Trump reveals she has been talking to Putin through ‘back’ channels about kidnapped Ukrainian children\n\nEight Ukrainian children who were kidnapped from their families and held captive in Russia have been returned to Ukraine after back-channel negotiations between First Lady Melania Trump and Russian representatives, the First Lady said on Friday.\n\nMs Trump, a former model who was born in what is now Slovenia when that country was part of the former Yugoslavia, made the stunning announcement in the Grand Foyer of the White House.\n\nShe told reporters “much [had] unfolded” since she sent a letter in August to Russian President Vladimir Putin regarding the fate of the thousands of children who’ve been taken to Russia after being seized by Russian forces during the attempted invasion of Ukraine.\n\nRead our full story below.\n\n### Melania Trump reveals talks with Putin over kidnapped Ukraine children\n\nThe Slovenian-born First Lady sent Putin a letter in August regarding the fates of Ukrainian children held captive by Moscow\n\nDaniel Keane10 October 2025 16:44\n\n### Poland says cyberattacks on critical infrastructure rising, blames Russia\n\nPoland's critical infrastructure has been subject to a growing number of cyberattacks by Russia, the country's digital affairs minister told Reuters.\n\nOf the 170,000 cyber incidents that have been identified in the first three quarters of this year, a significant portion has been attributed to Russian actors, Krzysztof Gawkowski said.\n\nHe said Poland is a subject to between 2,000 and 4,000 incidents a day and that 700 to 1,000 are \"taken up by us, meaning they posed a real threat or had the potential to cause serious problems\", he said.\n\nDaniel Keane10 October 2025 16:30\n\n### Trump suggests throwing ‘laggard’ Spain out of NATO\n\nUS president Donald Trump has reportedly suggested that Spain’s membership in the Nato alliance should be reconsidered due to its insufficient military spending.\n\nThe intervention follows an agreement in June where members of the US-backed security pact committed to significantly boosting their defence budgets to 5 per cent of gross domestic product.\n\nhe move aligns with President Trump’s long-standing demand for European nations to contribute more substantially to their own defence.\n\nBut Spanish prime minister Pedro Sanchez said at the time that he would not commit to the 5 per cent target, calling it “incompatible with our welfare state and our world vision”.\n\nRead our full story below.\n\n### Trump suggests throwing ‘laggard’ Spain out of NATO\n\nThe US president said Spain ‘has no excuse’ after criticising the country’s military spending\n\nDaniel Keane10 October 2025 16:00\n\n### Putin says Russia is developing 'weapons of deterrence'\n\nRussian President Vladimir Putin has said that the country is in the process of developing new “weapons of deterrence”, according to Reuters.\n\nPutin said that this would mean that if the US did not want to voluntarily extend a key arms control treaty then it would not be a critical issue for Russia.\n\nHe added that the world was already engaged in a global nuclear arms race involving Russia and the US.\n\nDaniel Keane10 October 2025 15:30\n\n### In pictures: Clean-up operation after buildings damaged in Russian drone and missile strike in Brovary, near Kyiv\n\n(Reuters)\n\n(Reuters)\n\n(Reuters)\n\n(Reuters)\n\n(Reuters)\n\nTaz Ali10 October 2025 15:00\n\n### Hungary’s Orban accuses Ukraine of aiding opposition and spying on citizens\n\nHungarian prime minister Viktor Orban has accused Ukrainian intelligence of meddling in his country's internal affairs and supporting the opposition.\n\nHe warned Hungarian citizens that Ukrainian intelligence may be monitoring them through their phones.\n\n“The Ukrainian intelligence service is not just watching Hungary; it has wormed its way in through the pro-Ukrainian Tisza Party. They have infiltrated public life and politics, providing technological assistance to their allies to help them gain power here,” he wrote on X on Friday.\n\n“Once we said “the Russians are already in the pantry”, now we must say: the Ukrainians are already in your smartphone. We will not let this slide!”\n\nOrban, Europe's most pro-Russian leader, has previously claimed that Ukraine, the EU and some opposition parties are working to bring about a change of government in Hungary.\n\nHungarian prime minister Viktor Orban (PA)\n\nTaz Ali10 October 2025 14:30\n\nNato will hold its major annual nuclear exercise next week, the alliance’s chief announced on Friday, with an important part of the drill to focus on protecting the weapons before they're ever used.\n\nThe long-planned “Steadfast Noon” exercise, which starts on Monday, is taking place amid heightened security around military facilities in Europe due to a series of mysterious drone incidents, some of them blamed on Russia.\n\nRead more here:\n\n### NATO begins a big nuclear exercise next week. Protecting the weapons is a key part of the drill\n\nNATO has announced that its major annual nuclear exercise, \"Steadfast Noon,\" is starting next week\n\nTaz Ali10 October 2025 14:00\n\n[Newer](https://www.independent.co.uk/?page=1)[Older](https://www.independent.co.uk/?page=2)",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "European Parliament",
      "url": "https://www.europarl.europa.eu/portal/en?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.europarl.europa.eu/portal/img/meta-facebook.jpg"
      },
      "content": "Stay informed\n\nStay updated on what Parliament is doing. Check out the latest news, watch our meetings live and follow MEPs on social media.\n\n- [Go to the page Topics](https://www.europarl.europa.eu/topics/en) - [Go to the page Today in Parliament](https://www.europarl.europa.eu/news/en/agenda/weekly-agenda) - [Go to the page Latest news](https://www.europarl.europa.eu/news/en) - [Go to the page Videos and live streamings](https://multimedia.europarl.europa.eu/en)\n\nDemocracy in action\n\n## Members, bodies and activities\n\n### 720    MEPs\n\nThe European Parliament is made up of 720 Members, who are directly elected.\n\nGo to the website : MEPs\n\n### President Roberta Metsola\n\nThe President is elected for a renewable two and a half years, meaning half a Parliamentary term.\n\nGo to the Presidency website : President\n\n### 8    Political groups\n\nMEPs sit in political groups. They are not organised by nationality, but by political affiliation.\n\ntodo\n\nGo to the website : Political groups\n\n### Plenary\n\nDuring plenary sessions MEPs vote on European laws and take position on issues through debates.\n\nGo to the website : Plenary\n\n### 26    Committees\n\nMEPs participate in committees to prepare the work for Parliament's plenary sessions.\n\nGo to the website : Committees\n\n### 48    Delegations\n\nParliament's delegations maintain relations and exchange information with parliaments in non-EU countries.\n\nGo to the website : Delegations\n\n### Secretariat-general\n\nThe secretariat-general supports the work of MEPs and the parliamentary bodies.\n\nGo to the website : Secretariat-general\n\n## What is the European Parliament?\n\nThe European Parliament is the EU's only directly-elected institution.Its 720 Members are there to represent you. Go to the page Learn more about the European Parliament\n\n## Legislative tools\n\n- Monitoring EU decision-making process [Go to the page Legislative Observatory](https://www.europarl.europa.eu/oeil/home/home.do) - [Go to the page Legislative Train](https://www.europarl.europa.eu/legislative-train/) - In-depth analysis of EU policies [Go to the page Think tank](https://www.europarl.europa.eu/thinktank/en)\n\n## Stay in touch with us\n\nInterested in the Parliament? Discover the various ways to stay in touch with us.\n\n- [Go to the page Visit us](https://www.europarl.europa.eu/visiting/en) - [Go to the page The Parliament on social media](https://www.europarl.europa.eu/at-your-service/en/stay-informed/social-media) - [Go to the page The Parliament in your country](https://liaison-offices.europarl.europa.eu/en) - [Go to the page Another request? We are here to help.](https://www.europarl.europa.eu/at-your-service/en) - [Go to the page Contact us](https://www.europarl.europa.eu/portal/en/contact)",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Eurostoxx futures flat in early European trading | investingLive",
      "url": "https://investinglive.com/stocks/eurostoxx-futures-flat-in-early-european-trading-20251009/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://images.investinglive.com/images/DE%20FRANKFURT%20BORSE_id_aef3ecfc-53d6-4473-b105-614872e6bb1b_size975.jpg",
        "1": "https://imagesdirectory.investinglive.com/images/Vantage_id_b85e6cf4-6a39-41f0-890e-11e536635464_size50.jpg",
        "2": "https://images.investinglive.com/fl-static/premium-banner-il-v2.jpg"
      },
      "content": "- Live Charts\n\n- Live Quotes\n\n- Economic Calendar\n\n- Join investingLive News Updates\n\nJoin investingLive News Updates\n\n- Join investingLive FX & Crypto\n\nJoin investingLive FX & Crypto\n\n- Live Feed\n\n- Brokers\n\n- Livebytes\n\n- More\n\n# Eurostoxx futures flat in early European trading\n\n- Light changes today as the optimism cools after the solid gains yesterday\n\n- German DAX futures flat\n\n- French CAC 40 futures +0.1%\n\n- UK FTSE futures +0.1%\n\nThe changes are light as the overall market mood remains more tentative today. It's still early in the day though but so far this week, equities have been holding up modestly well with Wall Street continuing the positive momentum and that's certainly helping. US futures are only marginally higher today with S&P 500 futures up 0.1% currently.\n\n- Stocks\n\nMost Popular\n\n- USDJPY Technical Analysis – Japanese upper-house election in focus\n\n- S&P moves to new lows and is back down testing the 200 hour MA\n\n- OMB Director says the layoffs have begun\n\n- European indices close lower on the day. Declines led by the Italy's FTSE MIB\n\n- EURUSD moves up to the 100 hour/day MAs, and finds sellers\n\n- The BLS will release the September CPI report on Friday, October 24 at 8:30 AM ET\n\n- Stocks are tumbling with the NASDAQ down over 2.2%. The S&P is down 1.6%.\n\n## Top Brokers\n\nSponsored\n\nVantage\n\nODFL, QRHC, RHI tumble -7.7% to -24.3% MoM. High P/E ratios signal caution. Traders eye potential fire sales.\n\nSHW & ICUI face soft demand & falling margins; TSCO shows growth potential. Traders eye P/E ratios.\n\nLEN's 19.2% backlog decline & 11.9% FCF margin drop raise red flags. BOH's 2.2% NIM & falling EPS signal caution. HOMB shines with 4.3% NIM & 8.4% TBVPS growth.\n\nCWST's 82.5x P/E and falling margins raise red flags despite analyst targets. PANL's EPS drop & weak FCF signal caution. SFM's 18.4x P/E shows strong growth.\n\nDG's 4.4% FCF margin & 15.4x P/E raise red flags; PKG's 7.2% FCF & 19.4x P/E show slow growth; DT shines with 26.2% FCF & 7.3x P/S.\n\nQCOM's 16.6% revenue growth & 30.1% FCF margin at 13.9x P/E. CAH's $222.6B revenue & 8.6% EPS growth at 16.7x P/E. PGR's 20.3% premium growth & 3.8x P/B.\n\nAOS, NOC, GLW face growth woes & diminishing returns. Traders eye P/E ratios: 17.5x, 23.2x, 32.6x. Avoid these S&P 500 stocks.\n\n## Top Brokers\n\nMust Read\n\n- Every stock investor and trader should join our new, free Telegram channel\n\n- Should I Buy Ethereum close to $4300?\n\n- Is Palladium a Buy?\n\n- Gold recovers losses on the day, silver looks to seal a break above $50\n\n- What are the main events for today?\n\n- Japan may intervene if yen slides toward 160 per dollar, ex-BOJ official warns\n\n- Gold cools on profit-taking but still poised to end the week higher",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Home | Euractiv",
      "url": "https://www.euractiv.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-855381962-1.jpg",
        "1": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-2234053350.jpg",
        "2": "https://www.euractiv.com/content/uploads/sites/2/2025/10/cc50436c-f1e2-443a-8176-eb9452bdafa5-1182x788.jpeg",
        "3": "https://www.euractiv.com/content/uploads/sites/2/2025/10/GettyImages-2230366772.jpg",
        "4": "https://www.euractiv.com/content/uploads/sites/2/2025/09/GettyImages-1058280254-3.jpg"
      },
      "content": "### Policy areas\n\n- Economy\n\n- Politics\n\n- Agrifood\n\n- Health\n\n- Tech\n\n- Energy, Environment & Transport\n\n- Defence\n\n- euractiv.com\n\n- euractiv.fr\n\n- euractiv.de\n\n- euractiv.gr\n\n- euractiv.pl\n\n- euractiv.cz\n\n- euractiv.sk\n\n- euractiv.it\n\n- euractiv.es\n\n## TOP STORIES\n\n#### EXCLUSIVE: German leads race to become EU’s next chief prosecutor\n\nPolitics\n\n##### Brussels prepares tighter visa rules for third countries over migration\n\n##### Spain rebukes Trump's NATO expulsion threat\n\n##### France joins mounting pressure against proposed EU-wide corporate levy\n\nEconomy\n\n##### Danes push for EU-wide age verification rules\n\nTech\n\n##### Every third doctor or nurse faces depression, WHO report reveals\n\nHealth\n\n##### Commissioner sees a 'unique moment' for tougher tobacco control\n\n##### Geert Wilders among alleged targets of foiled Belgian jihadist plot\n\n## Opinions\n\n##### Europe's holiday from reality\n\n##### The Brief – What Macron needs most is a one-state solution\n\nOpinion\n\n##### A dinner with Merkel where Russia was on the menu\n\n##### France joins mounting pressure against proposed EU-wide corporate levy\n\n##### Austria rules out weapons purchases with Russian frozen assets\n\nDefence\n\n##### Will the ‘Zucman tax’ go continental?\n\n## Agrifood\n\n##### Animal transport talks hit wall in Parliament – again\n\nAgrifood\n\n##### Farmers push back against fertiliser import tariff\n\n##### HARVEST: Geopolitics of soybeans\n\n##### Spain rebukes Trump's NATO expulsion threat\n\n##### US criticises European defence production as too slow\n\n##### Austria rules out weapons purchases with Russian frozen assets\n\n## Across Europe\n\n##### Spain rebukes Trump's NATO expulsion threat\n\n##### Islamist drone plot near Belgian PM's home foiled\n\n##### Macron hosts Paris summit to push political solution after Gaza ceasefire\n\n##### Warsaw rejects EU migrant relocation plan, Poland's president tells von der Leyen\n\n## Advocacy Lab content\n\n##### Longterm benchmarking will drive outcome-based health success, says Slovenian minister\n\n##### Europe’s reindustrialisation only succeeds if worker protection keeps pace\n\n##### Water industry calls for urgent delivery of resilience strategy\n\nEnergy, Environment & Transport\n\n##### Transplant patients need a survivors’ support framework, say health experts\n\n##### Commissioner sees a 'unique moment' for tougher tobacco control\n\n##### FIRST AID: Commission probes spy case involving Várhelyi ex-employee\n\n##### Every third doctor or nurse faces depression, WHO report reveals\n\n##### French, German business elite demands repeal of clean supply chains law\n\n##### Farmers push back against fertiliser import tariff\n\n##### VOLTAGE: Europe's automotive superpower conflicted over demise of the combustion engine\n\n## Promoted content\n\n##### Europe’s Bioeconomy Strategy must be industrial to succeed\n\n##### Secure, Competitive and Clean – Is Europe Delivering on Its Energy Promise?\n\n##### Back-to-School, Forward to Flu Season: Why Schools Hold the Key to Community Protection\n\n##### Raising the Bar: A Call for Outcomes-Based Legislation to Unleash Europe's Biotech Potential\n\n##### EU countries back child safety declaration\n\n##### Google's search and ads business to face tougher rules in the UK\n\n##### Danes push for EU-wide age verification rules\n\n## Euractiv's Pro newsletters\n\n##### VOLTAGE: Europe's automotive superpower conflicted over demise of the combustion engine\n\n##### FIRST AID: Commission probes spy case involving Várhelyi ex-employee\n\n##### HARVEST: Geopolitics of soybeans\n\n##### FIREPOWER: Get ahead of next week's NATO and FAC meetings\n\n##### THE HACK: Digital Ministers to sign children's Jutland Declaration\n\n## The Rapporteur\n\n##### Motion sickness\n\n##### France in limbo\n\n##### Metsola’s path to a third term\n\n##### Macron’s Strasbourg oasis",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "EP TODAY | Noticias | Parlamento Europeo",
      "url": "https://www.europarl.europa.eu/news/es/press-room/20250903IPR30126/ep-today?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.europarl.europa.eu/news/img/meta-facebook.jpg"
      },
      "content": "Parlamento Europeo\n\nEND OF REFACTORING\n\n# EP TODAY\n\nNotas de prensa Sesión plenaria 10-09-2025 - 08:00\n\n## Compartir esta página:\n\n- Facebook - X - LinkedIn - WhatsApp\n\nWednesday 10 September\n\nText content\n\n**State of the European Union debate**\n\nFilling the morning’s agenda, the annual parliamentary State of the European Union debate is a key opportunity for MEPs to hold the European Commission to account. In her opening statement, European Commission President Ursula von der Leyen will detail both the Commission’s achievements over the past year and current challenges. The political group leaders will then steer the debate, with members assessing the Commission’s work and its plans, while also presenting their own priorities. You can [follow President von der Leyen’s speech and the debate with MEPs](https://multimedia.europarl.europa.eu/en/webstreaming/debate-on-state-of-european-union-2025-with-nametags-of-speakers_20250910-0900-SPECIAL-OTHER) from 09.00.\n\nAhead of the debate, at 08.45, European Parliament President Roberta Metsola will give a doorstep statement in the media stand-up area by the hemicycle in Strasbourg. You can follow this live via [EP webstreaming](https://multimedia.europarl.europa.eu/en/webstreaming/doorstep-by-roberta-metsola-ep-president-prior-to-debate-on-state-of-european-union_20250910-0845-SPECIAL-OTHER) and the [European Broadcasting Service](https://audiovisual.ec.europa.eu/en/ebs/grid?ebs=yes&ebsplus=yes&date=20250910).\n\n**Andreas KLEINER****(+32) 498 98 33 22****Estefania NARRILLOS****(+32) 498 98 39 85****@EuroParlPress**\n\n**EU-US trade relations**\n\nIn a debate starting at about 14.30 with Trade Commissioner Maroš Šefčovič and Danish European Affairs Minister Marie Bjerre for the Council, MEPs will assess the implementation of the EU-US trade deal and the prospect of wider EU trade agreements.\n\n**Lieven COSIJN(+32) 473 864 141 @EP_Trade**\n\n**Updated rules on package holidays**\n\nMembers will discuss changes to the Package Travel Directive with Consumer Protection Commissioner Michael McGrath from around 17.00. The updated directive will refine travellers’ information and trip cancellation rights, as well as their rights to a refund and repatriation help, if their travel organiser should go bankrupt or unforeseen circumstances disrupt their holiday plans. The vote on Parliament’s negotiating position is scheduled for Thursday.\n\n**Maris KURME****(+32) 477 99 06 65****@EP_SingleMarket**\n\n**In brief**\n\n**Migration.**This month’s topical debate, on migration, will begin at 13.30, after the votes.\n\n**Global satellite navigation system interference.**In a debate with Commissioner for Defence and Space Andrius Kubilius, starting at around 17.30, Parliament will debate threats to aviation and maritime transport and the urgent need to build resilience against spoofing and jamming.\n\n**Slovakia.**MEPs will discuss the rule of law situation and possible misuse of EU funds in Slovakia, in a debate with Commissioner Michael McGrath and Marie Bjerre, Danish Minister for European Affairs, from about 18.30.\n\n**Taxation of large digital platforms**. In an evening debate, Commissioner McGrath will respond to an oral question on the implications of international developments for EU policy on taxing the digital economy.\n\n**Human rights.** In evening debates with Commissioner Jozef Síkela, MEPs will discuss the cases of EU citizens detained in the occupied areas of Cyprus, political prisoner Victoire Ingabire in Rwanda, and Irish national Abdoul Aziz Goma, arbitrarily detained in Togo. Three separate resolutions will be put to a vote in plenary on Thursday.\n\n**Votes**\n\nAt noon, MEPs will vote, among others, on:\n\n- simplifying and strengthening the carbon border adjustment mechanism; - cohesion policy, including the mid-term review; - facilitating investments and reforms to boost European competitiveness and on creating a capital markets union, one year after the Draghi Report; - the future of agriculture and the post-2027 common agricultural policy, and - a motion for a resolution on strengthening Moldova’s resilience against Russian hybrid threats and malign interference.\n\nLive coverage of the plenary session can be found on [Parliament’s webstreaming site](https://multimedia.europarl.europa.eu/en/webstreaming/plenary-session_20250910-0900-PLENARY) and on [EbS+](https://audiovisual.ec.europa.eu/en/ebs/grid?ebs=no&ebsplus=yes&date=20250910).\n\nFor detailed information on the session, please also see our [newsletter](https://www.europarl.europa.eu/news/en/agenda/briefing/2025-09-08) and the [detailed agenda](https://www.europarl.europa.eu/doceo/document/OJQ-10-2025-09-10_EN.html).\n\nFind more [information regarding plenary](https://www.europarl.europa.eu/plenary/en/home.html).\n\nContact\n\n## Contactos:\n\n- Press room Datos de contacto: Número de teléfono: (+33) 3 881 74 005 (STR)\n\nADDITIONAL LINKS COLUMN\n\nProduct reference\n\n## Información de producto\n\nRef.: 20250903IPR30126\n\n## Compartir esta página:\n\n- Facebook - X - LinkedIn - WhatsApp\n\nServicio de alertas por e-mail Versión PDF",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "European press roundup | eurotopics.net",
      "url": "https://www.eurotopics.net/en/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.eurotopics.net/sites/all/themes/bootstrap_eurotopics/media/images/facebook.jpg?-1760096104",
        "1": "https://www.eurotopics.net/cache/images/2/333922-5x3-teaser170x102.png?A7494",
        "2": "https://www.eurotopics.net/sites/all/themes/bootstrap_eurotopics/media/images/themenschwerpunkt-teaser-default.png",
        "3": "https://www.eurotopics.net/cache/images/2/148342-5x3-teaser170x102.jpg?2AD0B"
      },
      "content": "# European press roundup | eurotopics.net\n\n10 October 2025\n\n### László Krasznahorkai wins Nobel Prize in Literature\n\n10 October 2025\n\n### The Nobel prizes: what message do they send?\n\n10 October 2025\n\n### Athens: Tempi hunger strike pays off\n\n09 October 2025\n\n### France with no PM: will a solution be found?\n\n09 October 2025\n\n### EU protects MEPs from prosecution in Hungary\n\n09 October 2025\n\n### Is London failing to prevent Chinese espionage?\n\n09 October 2025\n\n### EU Parliament bans meat terms for plant-based food\n\n08 October 2025\n\n### Merkel's statements on Russia under fire\n\n08 October 2025\n\n### Antisemitism on the rise since Hamas massacre\n\n Middle East conflict\n\n 35 Debates\n\n The US under Trump\n\n 14 Debates\n\n European defence policy\n\n 11 Debates\n\n Artificial intelligence\n\n 7 Debates\n\n Russia's war against Ukraine\n\n 60 Debates\n\n Climate and environment\n\n 3 Debates",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Asian stocks today: Markets mostly in red amid tech bubble concerns; HSI down over 300 points, Kospi adds 1.3% - The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/international-business/asian-stocks-today-markets-mostly-in-red-amid-tech-bubble-concerns-hsi-down-over-300-points-kospi-adds-1-3/articleshow/124444290.cms?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124444292,width-1070,height-580,imgsize-82096,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/imgsize-28812,msid-124441996,width-375,resizemode-4/124441996.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-107272,msid-124411720,width-375,resizemode-4/124411720.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-686344,msid-124429196,width-375,resizemode-4/124429196.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-2233542,msid-124401874,width-375,resizemode-4/124401874.jpg"
      },
      "content": "# Asian stocks today: Markets mostly in red amid tech bubble concerns; HSI down over 300 points, Kospi adds 1.3%\n\nAsian stock markets traded mostly in red on Friday as the week closed, following a mix of positive and worrying developments.In Hong Kong, HSI fell 304 points or 1.14%, reaching 26,447.Tired of too many ads?go ad free nowShanghai and Shenzhen also traded in red shedding 0.51% and 1.85%, respectively. Japan's Nikkei was down 470 points or 0.97% at 10:10 AM IST.Meanwhile, Kospi traded in green jumping 49 points or 1.39% to reach 3,598.While news of a Middle East ceasefire and major AI investments lifted sentiment, concerns over a possible US government shutdown and fears of a tech bubble weighed on investors.Markets saw some records this week, with gold and bitcoin also hitting highs.Yet experts warn that some companies may now be overvalued, sparking talk of a market correction.Investor confidence received a boost after ChatGPT-maker OpenAI signed multi-billion-dollar chip deals with South Korea’s Samsung and SK hynix, along with US firm AMD. The deals add to the hundreds of billions already flowing into the artificial intelligence sector, driving stock prices higher. US chip leader Nvidia’s market value soared past $4 trillion.Gold also surged to record levels above $4,000 on Wednesday, as investors sought a safe haven.Adding to market uncertainty, the US government shutdown is expected to enter its third week, with little sign of compromise. Republican Senate Majority Leader John Thune said a weekend session was unlikely, according to Semafor.Donald Trump criticised Democrats over the shutdown at a cabinet meeting. Democrats are reportedly preparing for a shutdown lasting several more weeks if Republicans do not agree to extend healthcare subsidies due to expire on December 31, as per a CNN report.\n\n##### About the Author\n\nTOI Business Desk\n\nThe TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Asian stocks today: Markets trade mixed as investors assess AI outlook; Nikkei gains over 600 points, HSI down 0.1% - The Times of India",
      "url": "https://timesofindia.indiatimes.com/business/international-business/asian-stocks-today-markets-trade-mixed-as-investors-assess-ai-outlook-nikkei-gains-over-600-points-hsi-down-0-1/articleshow/124404256.cms?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.toiimg.com/thumb/msid-124404313,width-1070,height-580,imgsize-115812,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
        "1": "https://static.toiimg.com/thumb/imgsize-123456,msid-124397548,width-375,resizemode-4/124397548.jpg",
        "2": "https://static.toiimg.com/thumb/imgsize-32324,msid-124371624,width-375,resizemode-4/124371624.jpg",
        "3": "https://static.toiimg.com/thumb/imgsize-1061773,msid-124333068,width-375,resizemode-4/124333068.jpg",
        "4": "https://static.toiimg.com/thumb/imgsize-127392,msid-124381746,width-375,resizemode-4/124381746.jpg"
      },
      "content": "# Asian stocks today: Markets trade mixed as investors assess AI outlook; Nikkei gains over 600 points, HSI down 0.1%\n\nAsian markets were mixed on Thursday as investors tried to assess the global AI-driven rally, US interest rate moves, and the continuing government shutdown in Washington.Japan's Nikkei gained 1.29% or 614 points trading at 48,349, while HSI dipped 9 points or 0.03% to reach 26,820 at 9:30 AM IST.Tired of too many ads?go ad free nowIn India, NSE benchmark Nifty traded flat, adding 35 points or 0.14 to trade at 25,081.Some relief came from the Middle East, where Israel and Hamas agreed on the first phase of a ceasefire in Gaza. The news helped calm fears over oil supply, sending prices lower, while gold eased slightly after hitting a record above $4,000 an ounce on Wednesday.Tech companies have soared this year, with huge investments in AI driving stock markets higher.But worries are rising that the profits may not match the money being spent, raising concerns about a bubble in the sector.\"AI is clearly a bubble,\" said Neil Wilson of Saxo Markets.However, despite these concerns, Wall Street bounced back after Oracle’s report, with the S&P 500 and Nasdaq closing at new records on Wednesday.In Asia, optimism boosted Tokyo, which rose over 1 percent after business-friendly Sanae Takaichi was elected leader of Japan’s ruling party, fuelling hopes of further stimulus.Shanghai rose as markets reopened after a week-long holiday, while Sydney, Taipei, and Manila also gained. Hong Kong, Singapore, Wellington, and Jakarta fell.The US government shutdown continued to weigh on sentiment. Democrats blocked a sixth Republican attempt at a stopgap funding measure, insisting that any deal must include an extension of healthcare subsidies for 24 million people.On the geopolitical front, Donald Trump unveiled a 20-point peace plan as part of the Gaza ceasefire.Tired of too many ads?go ad free nowUnder the deal, Hamas would release all hostages, and Israeli troops would pull back to a pre-agreed line.Oil prices, which had been elevated over supply worries, eased. Gold, which surged to nearly $4,060 an ounce on Wednesday due to the crisis, also retreated.In company news, Hong Kong-listed Hang Seng Bank surged over 26% after reports that HSBC plans to take it private, buying remaining shares in a deal valuing the lender at US$37 billion. Meanwhile, HSBC shares fell more than 6%.\n\n##### About the Author\n\nTOI Business Desk\n\nThe TOI Business Desk is a vigilant and dedicated team of journalists committed to delivering the latest and most relevant business news from around the world to readers of The Times of India. The primary focus of the TOI Business Desk is to keep a watchful eye on the global business landscape, covering a wide spectrum of industries, markets, economic trends, in-depth analysis, exclusive reports and breaking stories that impact businesses and economies. With a mission to provide valuable insights and updates, the desk ensures that TOI readers are well-informed about the ever-changing and dynamic world of commerce and can navigate the complexities of the business world.Read More",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Asia stocks rise as AI cheer boosts tech, China reopens on strong footing By Investing.com",
      "url": "https://www.investing.com/news/stock-market-news/asia-stocks-rise-as-ai-cheer-boosts-tech-china-reopens-on-strong-footing-4278581?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://i-invdn-com.investing.com/news/LYNXNPEC0B0BR_L.jpg"
      },
      "content": "# Asia stocks rise as AI cheer boosts tech, China reopens on strong footing\n\nAdds context on China’s Golden Week holiday, India open\n\nInvesting.com-- Most Asian stocks rose on Thursday, buoyed chiefly by gains in technology shares as optimism over artificial intelligence drove buying into chipmaking and related stocks.\n\nMainland Chinese markets rallied in catch-up trade after a week-long holiday, with state media reports pointing to strong travel and spending trends during the break.\n\nHong Kong markets, however, lagged on steep losses in health technology stocks, following a report that U.S. tech giant Microsoft planned to enter the sector.\n\nHSBC was also a major weight on the Hang Seng after it proposed to privatize its unit Hang Seng Bank.\n\nAsian markets took positive cues from a strong overnight session on Wall Street, where the S&P 500 and the NASDAQ Composite hit record highs on a rally in tech shares.\n\nTech was boosted by encouraging comments from NVIDIA Corporation (NASDAQ:NVDA) on AI-fueled demand, as well as anticipation of a strong third-quarter earnings season.\n\nS&P 500 Futures were flat in Asian trade. Risk appetite was also aided by Hamas and Israel agreeing to a U.S.-brokered ceasefire proposal, which could end their two-year war.\n\n## Japan shares back in sight of records on tech gains\n\nJapanese markets resumed their outperformance on Thursday, with the Nikkei 225 and TOPIX indexes adding 1.5% and 0.4%, respectively. Both indexes were headed for record-high closes at current levels.\n\nTech shares were a major boost to the Nikkei, with SoftBank Group Corp. (TYO:9984) rallying over 11% to a record high after it agreed to buy the robotics arm of Swiss engineering group ABB Ltd (SIX:ABBN) for about $5.4 billion.\n\nJapanese industrials– including Yaskawa Electric Corp. (TYO:6506), Ebara Corp. (TYO:6361), and Fuji Electric Co., Ltd. (TYO:6504)– rose sharply, resuming their climb on hopes of more government spending under fiscal dove Sanae Takaichi as prime minister.\n\nGrowing conviction that the Bank of Japan will not hike interest rates soon also aided Japanese stocks, although a pause in the yen’s losses pressured exporters.\n\n## China shares reopen strong, Hong Kong lags\n\nChina’s Shanghai Shenzhen CSI 300 and Shanghai Composite indexes rose 1.6% and 1.3%, respectively, as trade resumed after the Golden Week holiday.\n\nGains in tech and industrial stocks supported mainland markets, with tech– especially chipmakers– catching up with strong gains logged by their global peers in the past week.\n\nState media reports said Chinese consumer spending remained robust during the Golden Week holiday. Passenger travel flows grew 6.2% year-on-year, while retail sales grew 3.3% y-o-y in the first four days of the holiday.\n\nThe reports sparked some optimism over a recovery in Chinese consumer spending, especially as the country grapples with persistent deflation.\n\nHong Kong stocks, however, were laggards, although the Hang Seng did recover from a 1% drop to trade 0.3% higher.\n\nThe Hang Seng was pressured by heavy profit-taking in healthtech and healthcare stocks, after the sector clocked a stellar run-up this year.\n\nA Wall Street Journal report, that tech giant Microsoft Corporation (NASDAQ:MSFT) planned to foray heavily into artificial intelligence-powered healthcare, also weighed on healthtech stocks.\n\nAlibaba Health Information Technology Ltd (HK:0241) and Jd Health International (HK:6618) fell 3.6% and 4.7%, respectively, and were among the worst performers on the Hang Seng.\n\nSino Biopharmaceutical Ltd (HK:1177) and Hansoh Pharmaceutical Group Co Ltd (HK:3692) sank 8.1% and 6.8%, respectively.\n\nHSBC (HK:0005) was the worst performer on the Hang Seng, sliding over 6% after it proposed taking its unit– Hang Seng Bank– private in a HK$106 billion ($13.62 billion) deal.\n\nHang Seng Bank (HK:0011) soared as much as 40% and was the top performer in Hong Kong.\n\nBroader Asian markets were mostly buoyed by tech, although declines in other, economically sensitive sectors reduced overall gains.\n\nTaiwan’s Taiwan Weighted surged to a fresh record high, while Australia’s ASX 200 added 0.3%.\n\nSingapore’s Straits Times index fell 0.3%, while India’s Nifty 50 index rose 0.2%, keeping course above the coveted 25,000 point level.\n\nSouth Korean markets were closed for a holiday.\n\n## Latest comments",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    },
    {
      "title": "Daily News on Southeast Asia - 9 Oct 2025 - ISEAS-Yusof Ishak Institute",
      "url": "https://www.iseas.edu.sg/library/blog/daily-news-alerts/251009?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://iseas.edu.sg/wp-content/uploads/2025/06/DNA_2510.png",
        "1": "https://www.iseas.edu.sg/wp-content/themes/iseas/assets/img/banner/library_banner_1025x186.jpg",
        "2": "https://www.iseas.edu.sg/wp-content/uploads/2025/06/DNA_2510.png"
      },
      "content": "Library > Blog > Daily News Alerts\n\nAbout ISEAS Library\n\nSearch Library Catalogue\n\n## Navigation\n\n- Home\n\n- Daily News Alerts\n\n- New Journals & Magazines\n\n- New Books\n\n- Highlights & Happenings\n\n## Recent Posts\n\n- Daily News on Southeast Asia - 10 Oct 2025\n\n- Daily News on Southeast Asia - 9 Oct 2025\n\n- Daily News on Southeast Asia - 8 Oct 2025\n\n- Daily News on Southeast Asia - 7 Oct 2025\n\n- Daily News on Southeast Asia - 6 Oct 2025\n\n## Tags\n\n## Archives\n\nEvery weekday, ISEAS Library collates articles relevant to Southeast Asia and special topics in line with the research interests of the ISEAS – Yusof Ishak Institute. To view articles behind paywalls, please visit the Library during its operating hours.\n\nToday’s issue includes the following commentaries and citations attributed to ISEAS – Yusof Ishak Institute and its researchers. You can click on the links to go to the articles directly.\n\n- No. 32: Michael J Montesano, Associate Senior Fellow\n\n- No. 38: Nguyen Khac Giang, Visiting Fellow\n\n- No. 45: The State of Southeast Asia: 2025 Survey Report\n\nBrunei | Cambodia | Indonesia | Laos | Malaysia | Myanmar | Philippines | Singapore | Thailand | Timor-Leste | Vietnam | ASEAN / Southeast Asia | Asia Pacific | East/South China Sea | Climate Change/Environment | Media, Technology & Society | Others\n\n#### Indonesia\n\n1. Takaichi and Prabowo can redefine the Japan-Indonesia relationshipAyu RachmanInterpreter, 9 October 20252. Papua in focus as Prabowo swears in leaders, new development authorityYerica Lai and Dio SuhendaJakarta Post, 9 October 20253. Jokowi seen as seeking Prabowo’s reassurance amid power shiftYerica LaiJakarta Post, 9 October 20254. Indonesia’s financial buffers under pressure from Prabowo Subianto’s spending plansA. Anantha LakshmiFinancial Times, 8 October 20255. Why Indonesia’s ‘Golden Generation’ Could Stall Economic GrowthAddin Anugrah Siwi, ZhulfakarJakarta Globe, 8 October 20256. Indonesia Has No Cards to Negotiate with Trump Alone: Chinese EconomistJayanty Nada ShofaJakarta Globe, 8 October 20257. Government rolls out Garuda Schools for top studentsMaretha UliJakarta Post, 8 October 20258. Indonesia struggles to create jobs for its youth[Link to report “Jobs: East Asia and Pacific Economic Update — October 2025“]Deni GhifariJakarta Post, 8 October 20259. Did Indonesia fall into ‘diplomatic trap’ over Trump’s Gaza peace plan?Resty Woro YuniarSouth China Morning Post, 8 October 2025\n\n#### Laos\n\n10. Laos, DPRK presidents hold talks to bolster tiesVientiane Times, 9 October 2025\n\n#### Malaysia\n\n11. Rural heartlands key to next growth wave under 13MPNazatul IzmaFree Malaysia Today, 9 October 202512. MIC sees PN as light at tunnel’s end, say sourcesK. ParkaranFree Malaysia Today, 9 October 202513. Kampung Sungai Baru’s status clarified: Not designated as Malay reserve land, Federal Territories Minister saysMalay Mail Online, 9 October 202514. Malaysia’s politics shaken and stirred by alcohol controversiesHazlin HassanStraits Times, 9 October 202515. Malaysia’s Moral Clarity On Trial Over Trump’s ASEAN InvitationCarolyn KhorEurasia Review, 8 October 202516. Warisan rules out political alliances, sets sights on two-thirds majority for Sabah pollsMalay Mail Online, 8 October 202517. COMMENT | Balancing act: Malaysia’s gamble on TrumpR Paneir SelvamMalaysiakini, 8 October 202518. First booze, now beef? Malaysia called to extend menu ban at government eventsJoseph SipalanSouth China Morning Post, 8 October 202519. Protest in the ‘Beverly Hills of Malaysia’ sparks anti-elitist backlashMuzliza MustafaStraits Times, 8 October 2025\n\n#### Myanmar\n\n20. The Rohingya’s vanishing homelandDr. Azeem IbrahimArab News, 8 October 202521. How the Myanmar Junta’s Election Laws Are Stifling Dissent Ahead of PollsMyo PyaeIrrawaddy, 8 October 202522. Myanmar Poll: Military Candidates Line Up as Suu Kyi Kept Behind BarsIrrawaddy, 8 October 2025\n\n#### Philippines\n\n23. How corruption drowns the Philippines’ climate responseCristina Eloisa BacligInquirer, 9 October 202524. Remulla’s daunting tasksInquirer, 9 October 202525. Filipino distrust in China among highest in AsiaKurt Dela PeñaInquirer, 9 October 202526. Public distrust in govt hits three-year high — surveyFranco Jose C. BaroñaManila Times, 9 October 202527. India supplying Philippines the missiles it needs to fend off ChinaNguyen Thanh LongAsia Times, 8 October 202528. Palace vows Remulla’s impartiality as new ombudsmanDexter CabalzaInquirer, 8 October 202529. Philippines and Japan signal defence pact’s depth via aid to quake-hit CebuJeoffrey MaitemSouth China Morning Post, 8 October 2025\n\n#### Thailand\n\n30. Parliament to debate charter billsAekarach SattaburuthBangkok Post, 9 October 202531. History beyond race, ultra-nationalismSanitsuda EkachaiBangkok Post, 9 October 202532. 佩通坦：为泰党首相候选人不会来自达信家族 [Paetongtarn: Pheu Thai Party’s PM candidate will not be from Thaksin’s family]联合早报, 8 October 2025\n\n#### Timor-Leste\n\n33. Can Timor-Leste Transition from an ASEAN Observer to a Regional Contributor?Teh Lip LiDiplomat, 9 October 202534. Asean membership draws a tiny but strategic Indo-Pacific nation closer to US-China chess matchKhushboo RazdanSouth China Morning Post, 9 October 202535. Organised crime may be infiltrating Timor-Leste’s government. One minister is sounding the alarmMichael RoseThe Conversation, 8 October 2025\n\n#### Vietnam\n\n36. How Vietnam could ease Trump’s China soybean painNguyen Ngoc Nhu QuynhAsia Times, 9 October 202537. EU factory park giant places $1bn Vietnam bet amid tariff warsLien HoangNikkei Asia, 9 October 202538. Vietnam’s Leader Makes Rare Visit to North Korea to Bolster TiesNguyen Xuan QuynhBloomberg, 8 October 202539. Pakistan And Vietnam Set Stage For Preferential Trade AgreementSara SheikhEurasia Review, 8 October 2025\n\n#### ASEAN/Southeast Asia\n\n40. Malaysia foreign minister heads to Myanmar for talks with junta on election, peace planCNA, 9 October 202541. US President could oversee Cambodia-Thailand peace deal signing at ASEAN Summit in Kuala LumpurTaing RinithKhmer Times, 9 October 202542. Normalisation’ fears in Asean as Indonesia welcomes Israeli athletes, Anwar defends Trump visitAbdar Rahman KoyaMalaysia Now, 9 October 202543. Analysts: Border conflict shows ASEAN strong on paper, practical mechanisms neededNiem ChhengPhnom Penh Post, 9 October 202544. Singapore and Malaysia better as friends than enemies, says Malaysia’s Trade and Industry Minister ZafrulHariz BaharudinStraits Times, 9 October 202545. Rising Anti-Government Protests in Southeast AsiaTemjenmeren AoManohar Parrikar Institute For Defence Studies and Analyses, 8 October 202546. Trump to attend ASEAN summit under conditions, US media reportsThe Nation, 8 October 2025\n\n#### Asia Pacific\n\n47. Japan boosts US strategy, South Korea raises risk: Carnegie[Link to the report, “Legacy or Liability? Auditing U.S. Alliances to Compete with China“]Ken MoriyasuNikkei Asia, 9 October 202548. Analysis: US-China power game heats up ahead of APEC summitKatsuji NakazawaNikkei Asia, 9 October 202549. China to Stockpile 169 Million Barrels of Oil by 2026, Southeast Asia Hubs AidEdwin Shri BimoChina Global South Project, 8 October 2025\n\n#### East/South China Sea\n\n50. China Uses Green Messaging to Bolster South China Sea Claims Amid Nature Preserve PushEric OlanderChina Global South Project, 8 October 2025\n\n#### Climate Change/Environment\n\n51. As NZBA shuts down membership model, Southeast Asian banks reaffirm decarbonisation effortsSamantha HoEco-Business, 8 October 202552. High cost of capital and limited project pipeline hinder clean energy investment in Southeast AsiaYinglun Teng and Musa ErdoganIEA, 8 October 202553. COP30: RI jualan karbon lagi? Lihatlah kasus kegagalan sistemik pasar global [COP30: Is Indonesia selling carbon again? A look at the systemic failure of the global market]Denny GunawanThe Conversation, 8 October 202554. Why are major economies choosing the same electricity sources?Joseph Webster and Hansika NathAtlantic Council, 6 October 2025\n\n#### Others\n\nCritical Minerals55. China unveils sweeping rare earth export controls to protect ‘national security’Ryan McMorrowFinancial Times, 9 October 2025\n\nBest effort has been made to ensure the external links provided are valid as of collation. We welcome your suggestions to help us improve this service. Please take a moment to give us your feedback via our feedback form.\n\nIn making materials available online, the ISEAS Library always does its best to meet the requirements of copyright and other laws. If you have concerns about any material that ISEAS Library has placed online and want to suggest that it be taken down, please contact us at libcir@iseas.edu.sg.\n\n### ABOUT US\n\n- Mission\n\n- Organization Chart\n\n- Board of Trustees\n\n- Director\n\n- Senior Advisor\n\n- Deputy Director\n\n- Researchers\n\n- Sustainability\n\n- Annual Report\n\n- Opportunities\n\n### CENTRES\n\n- ASEAN Studies Centre\n\n- Singapore APEC Study Centre\n\n- Temasek History Research Centre\n\n### PROGRAMME\n\n- Regional Economic Studies\n\n- Regional Social & Cultural Studies\n\n- Regional Strategic & Political Studies\n\n- Country Studies Programme\n\n### RESEARCH\n\n- NHB Heritage Research Grant\n\n- SSRTG\n\n### LIBRARY\n\n- Introduction\n\n- Library Blog\n\n- Library Catalogue\n\n- Collections & Resources\n\n- Using the Library\n\n### Flagship Publications\n\n- Contemporary Southeast Asia\n\n- Journal of Southeast Asian Economies\n\n- SOJOURN\n\n- Southeast Asian Affairs\n\n### Articles & Commentaries\n\n- ISEAS Economics Working Papers\n\n- ISEAS Perspective\n\n- Trends in Southeast Asia\n\n- ASEANFocus\n\n- Temasek Working Paper Series\n\n- Fulcrum\n\n### Events\n\n- All Events\n\n- Upcoming Events\n\n- Event Highlights\n\n- Regional Outlook Forum\n\n- Singapore Lecture\n\n### Support\n\n- Get Involved with ISEAS\n\n- Benefits of Giving\n\n- Support ISEAS\n\n- Donations FAQs",
      "source": "News Source",
      "date": "2025-10-10T17:13:42.121Z"
    }
  ],
  "timestamp": 1760116422122
}